{"id":11883,"date":"2017-04-06T06:46:31","date_gmt":"2017-04-06T06:46:31","guid":{"rendered":"https:\/\/digiperform.in\/backup\/?p=11883"},"modified":"2022-03-30T09:32:25","modified_gmt":"2022-03-30T09:32:25","slug":"growth-hacking-strategy-of-patanjali-india","status":"publish","type":"post","link":"https:\/\/digiperform.com\/growth-hacking-strategy-of-patanjali-india\/","title":{"rendered":"Growth Hacking Strategy of Patanjali &#8211; India"},"content":{"rendered":"Patanjali is like a ménage of products in India now. You can see the television advertisements, hoarding and ad campaigns of Patanjali running all over the way. Patanjali has been rated and reviewed as the “<strong>Best Ayurvedic Indian FMCG<\/strong> (Fast Moving Consumer Goods)” company, started in 2008 by Baba Ramdev and Acharya Balkrishna in India. It has taken an extra special place in people’s hearts and minds by conserving the motto &#8211; <strong>“Prakriti ka ashirward”<\/strong> (nature’s blessing).\r\n<img loading=\"lazy\" class=\"wp-image-11886 aligncenter\" src=\"https:\/\/digiperform.com\/wp-content\/uploads\/2017\/04\/504501-patanjali-logowebsite.jpg\" alt=\"504501-patanjali-logowebsite\" width=\"362\" height=\"197\" \/>\r\nHas anyone wondered how Baba Ramdev’s Patanjali made it’s so unshared and unique place in the market? Let’s dig into the past and find out how Baba Ramdev has created such an exponential history in Indian Market.\r\n<strong>Journey of Baba Ramdev………<\/strong>\r\nThousands of people, old and young, used to sit beside their TV and try his yoga exercises to stay fit and healthy. People had known him as a famous personality but hardly few knew about the struggle he had in his early days of life.<strong><img loading=\"lazy\" class=\"size-medium wp-image-11885 alignleft\" src=\"https:\/\/digiperform.com\/wp-content\/uploads\/2017\/04\/3428-baba-ramdev-0-300x300.jpg\" alt=\"3428-baba-ramdev-0\" width=\"300\" height=\"300\" \/><\/strong>\r\nBorn as Ramkrishna Yadav on 11 Jan 1965 in the district of Haryana, Baba Ramdev belonged to a poor Indian family. He joined Yoga Monastery (Gurukul) in Khanpur village and started learning the techniques of Yoga.\r\nThere, he earned a postgraduate degree with the specialization in Sanskrit Grammar, Hindu Philosophy, Yoga, Vedas, and Upanishads. After Gurukul, he took the Sanyas and changed his name to Ramdev.\r\nAfter changing his name, he offered free yoga training to villagers across Haryana and with so much self-discipline and meditation; he went to the Himalayas and researched Indian scriptures\r\nHe stayed there for several years and become the founder of “<u>Yoga Empire Divya Mandir Trust<\/u>” with the help of Acharya Karamveer and Acharya Balakrishnan established in 1995, Haridwar.\r\n<img loading=\"lazy\" class=\"wp-image-11891 aligncenter\" src=\"https:\/\/digiperform.com\/wp-content\/uploads\/2017\/04\/haridwar-300x144.jpg\" alt=\"haridwar\" width=\"500\" height=\"240\" \/>\r\nDuring the span of time, when Yoga started gaining popularity in western culture, Baba Ramdev became the model of popularizing Yoga in India as well as around the world. He started broadcasting program named “<em>Divya Yog<\/em>” that airs on Aastha TV.\r\nWith his stay in the Himalayas, his interest started in the Ayurveda and he inaugurated “<u>Patanjali Yog Peeth Trust<\/u>” which is actively engaged in the research for the healing powers of Yoga and Ayurveda.\r\nThis trust had provided free services to millions of people which had built a great faith in Ayurveda, Yoga and of course Baba Ramdev.\r\nThe trust was acknowledged by many awards and recognitions; and received great funding by Scottish couple of Indian Origin which led to born a brand name – Patanjali.\r\n<em>So, how Patanjali has become the fasted growing Ayurvedic company with the impressive revenues of 5000 Cr. (2015-16) and 1000 dedicated centers all over India (400 in Delhi and 270 in Mumbai)?<\/em>\r\n<em>What kind of Growth Hacking Strategy followed by Baba Ramdev and his partners to push the Patanjali at top-notch which is only a few years old in the market where companies like Hindustan Unilever and P&amp;G are almost 8 decades old?<\/em>\r\nBaba Ramdev has acted as a <strong>Brand Ambassador<\/strong> for Patanjali who single-handedly responsible for its success. As per Baba Ramdev, Patanjali only focuses surpassing information to people that “<em>Revenue of Patanjali is for Charity and not for Brand Owners<\/em>”, however from any business point of view, it’s a complete organized and fully planned business.\r\nBy the virtue of modernization, Baba Ramdev has followed all the parameters of a <em>Growth Hacking<\/em> in a very subtle but classy way.\r\n<em>Growth Hacking is a process of both conventional and unconventional marketing experiments across the channels and product development to find the effective and efficient ways to grow a business. It’s main focus on building, engaging, converting and retaining the user base of a business.<\/em>\r\nAnd Growth Hacker is the “<em>White Hat Hacker of Marketing<\/em>” whose true north is growth of the company. Here Patanjali’s Growth Hacker is our own Baba Ramdev.\r\nDefinition and concept of Growth Hacking were invented by Sean Ellis in 2010. The algorithm revolves around 5 basic stages: Acquisition, Activation, Retention, Referral and Revenue.\r\n<strong><img loading=\"lazy\" class=\"aligncenter wp-image-11884 size-full\" src=\"https:\/\/digiperform.com\/wp-content\/uploads\/2017\/04\/1-PwjoZ9yJ_k2Bo7DpqjF4Lw.png\" alt=\"1-PwjoZ9yJ_k2Bo7DpqjF4Lw\" width=\"794\" height=\"374\" \/><\/strong>\r\n\r\n<strong>1st &amp; 2nd Stage: Acquisition &amp; Activation:<\/strong>\r\nAcquisition stage defines how to acquire users from different channels and Activation is when the user decides to take action and use your product.\r\n<em>How Baba Ramdev’s followers become the resource of acquisition -consumers?<\/em>\r\nPatanjali has a major advantage over other companies as it is associated with a very famous personality – <strong>Baba Ramdev<\/strong>, who is a health guru followed by famous Bollywood and Hollywood stars.\r\nHe is a yoga guru who has untold millions of fan following on Social Media as well as in real life and he is the one who can directly popularize Patanjali through his yoga camps.\r\nBaba Ramdev has direct interaction with the consumers that has created a positive and trustworthy face value of Patanjali and helped to promote the brand even internationally.\r\nRecently Baba Ramdev has promoted his brand on the reality show “<strong>India’s Best Dramebaaz<\/strong>” which is also sponsored by Patanjali and comedy show “<strong>The Kapil Sharma show<\/strong>”.\r\n<img loading=\"lazy\" class=\"aligncenter wp-image-11897 size-full\" src=\"https:\/\/digiperform.com\/wp-content\/uploads\/2017\/04\/unnamed-112.jpg\" alt=\"unnamed-112\" width=\"759\" height=\"539\" \/>\r\nHe also has a good political support from the BJP government. He was called to lead the World Yoga Day celebration on 21st June 2015 by the Prime Minister himself.\r\n<strong><img loading=\"lazy\" class=\"wp-image-11895 size-full aligncenter\" src=\"https:\/\/digiperform.com\/wp-content\/uploads\/2017\/04\/ramdev_inside_1_1473749634.jpg\" alt=\"ramdev_inside_1_1473749634\" width=\"725\" height=\"460\" \/><\/strong>\r\n<strong>Use of Modern Marketing Tool………..<\/strong>\r\nDigital Marketing has played a major role in the success of Patanjali too. Patanjali is regular in promoting new products through e-mails with the help of Digital Marketing and Content Marketing Tools; Patanjali has attracted consumers by bombarding ads and educating them on the importance of Ayurvedic products through blogs and articles.\r\nHis focus is not on proclaiming why Patanjali is the best but he has just shown the reason why to left old products and use new ones.\r\nNot company only, CEO Baba Ramdev is digital himself. He has 541K followers and 5.7 million people on Facebook have liked his page.\r\n<img loading=\"lazy\" class=\"aligncenter wp-image-11887 size-full\" src=\"https:\/\/digiperform.com\/wp-content\/uploads\/2017\/04\/50576847.png\" alt=\"50576847\" width=\"644\" height=\"368\" \/>\r\nUnlike other herbal brands, Patanjali has its own brand ambassador as a real life Yoga Guru who preached yoga and Ayurveda all his life and hence their brand identity and brand image has been on the same line.\r\nOnce customer trust is earned (through Yoga), reaching them (customers) through products becomes easier.\r\nAll these quintessential A-plus following and politics support made him a trust worthy and reliable character which led customers to buy Patanjali’s products without a blink of an eye.\r\nVery smartly, he used his years of struggle and achievements to acquire generic potential customers and has built a well deserved FMCG in competition to all the herbal and FMCG market.\r\nHe has set a marvelous example of acquisition and activation of users in the industry in the best possible way.\r\n<strong>3rd Stage: Retention<\/strong>\r\nOnce the user has become an active user of your product, this stage helps the user to come back and stay engage with your product for a longer run.\r\n<strong><em>Nestle Maggi Scam – 2015<\/em><\/strong>\r\nIn 2015, Maggi- the product of Nestle India, was stamped as “<em>adulterated<\/em>” product and was banned for consumption by <em>Union Food and Consumer Affairs Minister<\/em>.\r\n<img loading=\"lazy\" class=\"alignnone size-medium wp-image-11892 aligncenter\" src=\"https:\/\/digiperform.com\/wp-content\/uploads\/2017\/04\/Maggi4-600x314-300x157.jpg\" alt=\"Maggi4-600x314\" width=\"300\" height=\"157\" \/>\r\nSame time, Baba Ramdev launched Patanjali&#8217;s Atta Noodles and announced to hit one million stores by the end of December, 2015. He made sure that it would be cheaper than usual Maggi Noodles.\r\n<img loading=\"lazy\" class=\"aligncenter wp-image-11896 size-full\" src=\"https:\/\/digiperform.com\/wp-content\/uploads\/2017\/04\/ramdev-1457509909.jpg\" alt=\"ramdev-1457509909\" width=\"740\" height=\"520\" \/>\r\nEven Baba Ramdev made a statement in media against FMCG companies that “<em>Multinational firms like Hindustan Unilever, Colgate and Nestle were bringing people to get fake and adulterated products. Patanjali products always tested in labs<\/em>”.\r\nAs a prominent businessman, Baba Ramdev made sure to target the same audience who was holding their anger of betrayal and guided them the importance of natural products of Patanjali.\r\nAlong with that, he made an announcement of new categories such as childcare, skincare and healthcare would enter the market to make Patanjali more promising and ideal solution for people.\r\n<strong>Add on factor….<\/strong>\r\nPrices also played an important role in leashing the growth of Patanjali one step ahead of its competitors. Hindustan Unilever and P&amp;G are trying their best level to cope with the competition however the love for Baba Ramdev and Patanjali are not helping them to even stand in the queue.\r\nBaba Ramdev knows that Patanjali can’t conquer the market with higher prices, so he is educating the people about the benefit of using products as well as comparing the prices with other competitors.\r\nSecondly, the ingredients are natural and domestic; the cost of product and making is lesser as compare to International Products.\r\nIn this way, he has retained his consumer&#8217;s faith and made sure he will provide the best, healthy and cheap products keeping the health of people in mind.\r\n<strong>4th Stage: Referral<\/strong>\r\nWhen the user starts to refer or recommend your product to friends and shares the positive reviews.\r\nBaba Ramdev has suggested Patanjali’s promotion through media and online campaigns and supported Indian industries by creating demands of Swadeshi Products. He requested political parties and Bollywood to create awareness and strengthen Indian economy by replacing foreign products with Swadeshi Products.\r\nBaba Ramdev made sure his preaching should be available to all in the form of DVDs, Video CDs and magazines and has mastered the art of mass customization and practices so that each individual feels that he is talking to them individually which created a chain of fan following and referred by everyone to grab more learning regarding the importance of healthy life.\r\n<img loading=\"lazy\" class=\"aligncenter wp-image-11888 size-large\" src=\"https:\/\/digiperform.com\/wp-content\/uploads\/2017\/04\/1426226958_UUCHERATCHAPKEf-714x1024.jpg\" alt=\"1426226958_UUCHERATCHAPKEf\" width=\"714\" height=\"1024\" \/>\r\nBaba has the vision to develop World’s largest food and Herbal Park because of which about 7000 people will get direct and 200000 people will get indirect employment opportunities with this project which has already created hush in the youth.\r\nWhat else you need to be fan of these companies who promise to offer great product with job stability. This is all what a young generation would need.\r\n<strong>5Th Stage: Revenue<\/strong>\r\nThe most important stage for a company, users fully understand the value of your products and paying for it.\r\nPatanjali is one of the start-ups who have targeted the audiences through two websites mediums: <strong>Corporate and E-commerce.<\/strong>\r\nIn corporate website <strong>.org<\/strong>, Patanjali shares about the mission and philosophy behind Patanjali &#8211; the use of ayurvedic products.\r\n<img loading=\"lazy\" class=\"aligncenter wp-image-11898\" src=\"https:\/\/digiperform.com\/wp-content\/uploads\/2017\/04\/org-image-1024x560-1-300x153.jpg\" alt=\"org-image-1024x560\" width=\"500\" height=\"254\" \/>\r\n\r\nPatanjali has also <strong>.net<\/strong> e-commerce website through which Patanjali sell products online besides being available with retail chains and under its own distribution centers as per market need.\r\n<img loading=\"lazy\" class=\"size-full wp-image-11890 aligncenter\" src=\"https:\/\/digiperform.com\/wp-content\/uploads\/2017\/04\/download-21.jpg\" alt=\"download (21)\" width=\"294\" height=\"172\" \/>\r\nIt is the fasted growing Ayurveda Company with the impressive revenues of 5000 Cr by 2016.\r\n<img loading=\"lazy\" class=\"wp-image-11889 size-full aligncenter\" src=\"https:\/\/digiperform.com\/wp-content\/uploads\/2017\/04\/1461701561-4228.jpg\" alt=\"1461701561-4228\" width=\"350\" height=\"292\" \/>\r\nPatanjali has made a surprising expansion in the FMCG sector with its innovative marketing strategies and has bought a revolution in the industry within a very short period of time. It has been doing great in some of the sectors and products like; Foods including jams, biscuits, noodles, oats, pulses and other food products, beverages, Healthcare &amp; Medicines, personal care products and cleaning agents.\r\nThe time will come soon when people around the world are going to use Patanjali&#8217;s products as substitutes to Hindustan Unilever and P&amp;G.","protected":false},"excerpt":{"rendered":"Patanjali is like a ménage of products in India now. You can see the television advertisements, hoarding and ad campaigns of Patanjali running all over the way. Patanjali has been rated and reviewed as the “Best Ayurvedic Indian FMCG (Fast&#8230;","protected":false},"author":1,"featured_media":35625,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[120],"tags":[139,40,140],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v19.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Growth Hacking Strategy of Patanjali - India - Digiperform<\/title>\n<meta name=\"description\" content=\"How Patanjali used Digital marketing to manage its products in India now. You can see the television advertisements, hoarding and ad campaigns of Patanjali\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/digiperform.com\/growth-hacking-strategy-of-patanjali-india\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Growth Hacking Strategy of Patanjali - India - Digiperform\" \/>\n<meta property=\"og:description\" content=\"How Patanjali used Digital marketing to manage its products in India now. You can see the television advertisements, hoarding and ad campaigns of Patanjali\" \/>\n<meta property=\"og:url\" content=\"https:\/\/digiperform.com\/growth-hacking-strategy-of-patanjali-india\/\" \/>\n<meta property=\"og:site_name\" content=\"Digiperform\" \/>\n<meta property=\"article:published_time\" content=\"2017-04-06T06:46:31+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-03-30T09:32:25+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/digiperform.com\/wp-content\/uploads\/2017\/04\/Patanjali.png\" \/>\n\t<meta property=\"og:image:width\" content=\"700\" \/>\n\t<meta property=\"og:image:height\" content=\"394\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"admin\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/digiperform.com\/#website\",\"url\":\"https:\/\/digiperform.com\/\",\"name\":\"Digiperform\",\"description\":\"Digital Marketing Training Institute\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/digiperform.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/digiperform.com\/growth-hacking-strategy-of-patanjali-india\/#primaryimage\",\"url\":\"https:\/\/digiperform.com\/wp-content\/uploads\/2017\/04\/Patanjali.png\",\"contentUrl\":\"https:\/\/digiperform.com\/wp-content\/uploads\/2017\/04\/Patanjali.png\",\"width\":700,\"height\":394,\"caption\":\"patanjali digital amrketing\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/digiperform.com\/growth-hacking-strategy-of-patanjali-india\/#webpage\",\"url\":\"https:\/\/digiperform.com\/growth-hacking-strategy-of-patanjali-india\/\",\"name\":\"Growth Hacking Strategy of Patanjali - India - Digiperform\",\"isPartOf\":{\"@id\":\"https:\/\/digiperform.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/digiperform.com\/growth-hacking-strategy-of-patanjali-india\/#primaryimage\"},\"datePublished\":\"2017-04-06T06:46:31+00:00\",\"dateModified\":\"2022-03-30T09:32:25+00:00\",\"author\":{\"@id\":\"https:\/\/digiperform.com\/#\/schema\/person\/1420e87bcb82e48906cd5160911fcc1a\"},\"description\":\"How Patanjali used Digital marketing to manage its products in India now. You can see the television advertisements, hoarding and ad campaigns of Patanjali\",\"breadcrumb\":{\"@id\":\"https:\/\/digiperform.com\/growth-hacking-strategy-of-patanjali-india\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/digiperform.com\/growth-hacking-strategy-of-patanjali-india\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/digiperform.com\/growth-hacking-strategy-of-patanjali-india\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/digiperform.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Growth Hacking Strategy of Patanjali &#8211; India\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/digiperform.com\/#\/schema\/person\/1420e87bcb82e48906cd5160911fcc1a\",\"name\":\"admin\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/digiperform.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/b69047a5cc9f5694c48ca69f8b62a83b?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/b69047a5cc9f5694c48ca69f8b62a83b?s=96&d=mm&r=g\",\"caption\":\"admin\"},\"sameAs\":[\"https:\/\/digihero.in\/new\"],\"url\":\"https:\/\/digiperform.com\/author\/admin\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Growth Hacking Strategy of Patanjali - India - Digiperform","description":"How Patanjali used Digital marketing to manage its products in India now. You can see the television advertisements, hoarding and ad campaigns of Patanjali","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/digiperform.com\/growth-hacking-strategy-of-patanjali-india\/","og_locale":"en_US","og_type":"article","og_title":"Growth Hacking Strategy of Patanjali - India - Digiperform","og_description":"How Patanjali used Digital marketing to manage its products in India now. You can see the television advertisements, hoarding and ad campaigns of Patanjali","og_url":"https:\/\/digiperform.com\/growth-hacking-strategy-of-patanjali-india\/","og_site_name":"Digiperform","article_published_time":"2017-04-06T06:46:31+00:00","article_modified_time":"2022-03-30T09:32:25+00:00","og_image":[{"width":700,"height":394,"url":"https:\/\/digiperform.com\/wp-content\/uploads\/2017\/04\/Patanjali.png","type":"image\/png"}],"twitter_card":"summary_large_image","twitter_misc":{"Written by":"admin","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/digiperform.com\/#website","url":"https:\/\/digiperform.com\/","name":"Digiperform","description":"Digital Marketing Training Institute","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/digiperform.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/digiperform.com\/growth-hacking-strategy-of-patanjali-india\/#primaryimage","url":"https:\/\/digiperform.com\/wp-content\/uploads\/2017\/04\/Patanjali.png","contentUrl":"https:\/\/digiperform.com\/wp-content\/uploads\/2017\/04\/Patanjali.png","width":700,"height":394,"caption":"patanjali digital amrketing"},{"@type":"WebPage","@id":"https:\/\/digiperform.com\/growth-hacking-strategy-of-patanjali-india\/#webpage","url":"https:\/\/digiperform.com\/growth-hacking-strategy-of-patanjali-india\/","name":"Growth Hacking Strategy of Patanjali - India - Digiperform","isPartOf":{"@id":"https:\/\/digiperform.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/digiperform.com\/growth-hacking-strategy-of-patanjali-india\/#primaryimage"},"datePublished":"2017-04-06T06:46:31+00:00","dateModified":"2022-03-30T09:32:25+00:00","author":{"@id":"https:\/\/digiperform.com\/#\/schema\/person\/1420e87bcb82e48906cd5160911fcc1a"},"description":"How Patanjali used Digital marketing to manage its products in India now. You can see the television advertisements, hoarding and ad campaigns of Patanjali","breadcrumb":{"@id":"https:\/\/digiperform.com\/growth-hacking-strategy-of-patanjali-india\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/digiperform.com\/growth-hacking-strategy-of-patanjali-india\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/digiperform.com\/growth-hacking-strategy-of-patanjali-india\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/digiperform.com\/"},{"@type":"ListItem","position":2,"name":"Growth Hacking Strategy of Patanjali &#8211; India"}]},{"@type":"Person","@id":"https:\/\/digiperform.com\/#\/schema\/person\/1420e87bcb82e48906cd5160911fcc1a","name":"admin","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/digiperform.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/b69047a5cc9f5694c48ca69f8b62a83b?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/b69047a5cc9f5694c48ca69f8b62a83b?s=96&d=mm&r=g","caption":"admin"},"sameAs":["https:\/\/digihero.in\/new"],"url":"https:\/\/digiperform.com\/author\/admin\/"}]}},"_links":{"self":[{"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/posts\/11883"}],"collection":[{"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/comments?post=11883"}],"version-history":[{"count":3,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/posts\/11883\/revisions"}],"predecessor-version":[{"id":38096,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/posts\/11883\/revisions\/38096"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/media\/35625"}],"wp:attachment":[{"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/media?parent=11883"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/categories?post=11883"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/tags?post=11883"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}