{"id":15324,"date":"2018-03-23T13:47:20","date_gmt":"2018-03-23T13:47:20","guid":{"rendered":"https:\/\/digiperform.in\/backup\/?p=15324"},"modified":"2022-03-30T12:15:00","modified_gmt":"2022-03-30T12:15:00","slug":"google-seo-updates-the-past-present-future","status":"publish","type":"post","link":"https:\/\/digiperform.com\/google-seo-updates-the-past-present-future\/","title":{"rendered":"Google SEO Updates: The Past, Present &#038; Future"},"content":{"rendered":"<span style=\"font-weight: 400;\">The search engines like Google, Yahoo, Bing etc. have a vast playground with immense database and companies are playing hard to stand first in the same search engine database. To accomplish it, SEO is a good practice to be followed these days. Seo is the process of getting the traffic from the free, organic, editorial or natural search results on search engines. Search Engine Optimisation (SEO) in 2018 is a technical, analytical and creative process to improve the visibility of a website in search engines. The primary function of SEO is to drive more unpaid useful traffic to a site that converts into sales. <\/span>\r\n<span style=\"font-weight: 400;\">Though, it is constantly inviting changes in its practice. All major search engines have primary search results, where web pages and other content such as videos or local listings are shown and ranked based on what the search engine considers most relevant to users. As an SEO practitioner,  you need to understand that there is no magic way to rank your website on the first page of Google. Search engines are governed by complex algorithms and it takes a lot of time and effort to ‘convince’ them that your website or web page deserves one of the top spots. <\/span>\r\n<span style=\"font-weight: 400;\">There are certain rules that one should follow to optimize the website to provide the search engine with the necessary signals. Almost every day, Google introduces changes to its ranking algorithm. Some are tiny tweaks; others seriously shake up the Search Engine Result Pages (SERPs). Let’s find out what the updates in years (descending) to have an overview of the changes in the ranking algorithm.<\/span>\r\n\r\n<b>2018 Updates:<\/b>\r\n<b>Core Update- Rank Risk Index (Google SERP Fluctuations)<\/b>\r\n<b>Confirmed date: March 09, 2018.<\/b>\r\n<b>Hazards: SERP Fluctuations and ranking<\/b>\r\n<strong>About the update:<\/strong>\r\n<span style=\"font-weight: 400;\">Rank Risk Index is one of the tools in Google algorithm monitoring service that helps to measure SERP fluctuations for “N” number of domains and keywords. <\/span>\r\n<span style=\"font-weight: 400;\">While sharing the update, Google has confirmed that they ran a broad core algorithm update where they had explained what exactly means if page drops that could impact the appearance and rankings of some websites in the search results or not. Rank Risk Index during the update testing began recording increased rank fluctuations on both desktop and mobile. While the uptick in rank fluctuations was initially moderate, the Rank Risk index caught an unusual and highly significant upsurge. According to the index, fluctuations reached a level of 99 &#8211; out of 100 on desktop and 92- out of 100 on mobile. <\/span>\r\n<img loading=\"lazy\" class=\" wp-image-15327 aligncenter\" src=\"https:\/\/digiperform.com\/wp-content\/uploads\/2018\/03\/Screen-Shot-2018-03-21-at-2.55.38-PM-300x105.png\" alt=\"\" width=\"805\" height=\"282\" \/>\r\n\r\n<b>Page Speed to Become Mobile Ranking Factor<\/b>\r\n<b>Confirmed date: JANUARY 18, 2018<\/b>\r\n<b>Hazards: Page ranking<\/b>\r\n<strong>About the Update:<\/strong>\r\n<span style=\"font-weight: 400;\">Since 2010, Page speed has been a ranking factor on desktop and Google announced that page speed would become a mobile ranking factor in January. However, with this announcement, it becomes official that the ranking factor now is an official part of a mobile page&#8217;s placement on the Google SERP come July 2018. Rest confirmation would be given once updates related to slow loading pages will be targeted. As such, the search engine does not predict that an extensive number of pages will be impacted as the ranking factor becomes incorporated into the algorithm this July. According to Google, the pending mobile page speed ranking factor exists independently of the mobile-first index.<\/span>\r\n<img loading=\"lazy\" class=\" wp-image-15329 aligncenter\" src=\"https:\/\/digiperform.com\/wp-content\/uploads\/2018\/03\/unnamed-300x169.png\" alt=\"\" width=\"641\" height=\"361\" \/>\r\n\r\n<b>2017 Updates<\/b>\r\n<b>Snippet Length Increase  — <\/b>\r\n<b>Confirmed Date: November 30, 2017<\/b>\r\n<b>Hazards: Snippet Description Length<\/b>\r\n<strong>About the update:<\/strong>\r\n<span style=\"font-weight: 400;\">A snippet is the content description of a page shown below the URL in an organic search result that helps to show how it relates to the search query which is often dynamically generated based on the user query and content found in both the meta description and the content visible on the page.<\/span>\r\n<span style=\"font-weight: 400;\">Earlier Google always recommended adding the description to snippet between 50-150 words to give an overview of the search query, however you can write a snippet of any length but won’t give benefit as per SEO guidelines. While testing for snippets over two years, Google realized in 10K tracking data for December 15th, which consisted of 89,909 page-one organic results, the average display snippet (stripped of HTML, of course) was 215 characters long well above historical trends. This led Google to adopt a new Meta Description limit up to 300 characters from the previous 155 (almost doubling). <\/span>\r\n<img loading=\"lazy\" class=\" wp-image-15330 aligncenter\" src=\"https:\/\/digiperform.com\/wp-content\/uploads\/2018\/03\/sniippet-300x230.png\" alt=\"\" width=\"587\" height=\"450\" \/>\r\n\r\n<b>Chrome HTTPS Warnings  — <\/b>\r\n<b>Confirmed Date: October 17, 2017<\/b>\r\n<b>Hazards: Chrome Communication and data security<\/b>\r\n<strong>About the update:<\/strong>\r\n<span style=\"font-weight: 400;\">Google has always been looking for ways to improve how Chrome communicates the connection security of HTTP pages. You must have noticed after the update that Chrome now marks HTTP pages as “Not secure” if they have password or credit card fields. <\/span>\r\n<span style=\"font-weight: 400;\">Under these two additional situations, Chrome shows the “Not secure” warning: <\/span>\r\n<ul>\r\n \t<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">when users enter data on an HTTP page<\/span><\/li>\r\n \t<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">all HTTP pages visited in Incognito mode<\/span><\/li>\r\n<\/ul>\r\n<span style=\"font-weight: 400;\">Based on increasingly broad criteria, HTTP sites as non-secure is taking place in gradual steps. Any type of data that users type including passwords and credit cards into websites should not be accessible to others on the network. There has been a 23% reduction in the fraction of navigations to HTTP pages with password or credit card forms since the change in Chrome 56, on the desktop. Therefore, since the update, whenever user type data into HTTP sites, the Chrome 62 version will show the “Not Secure” warning. With the same discovery, Google started warning visitors to sites with unsecured forms. This has been an important step in Google&#8217;s push toward HTTPS though it&#8217;s not an algorithm update but may have a material impact on site traffic.<\/span>\r\n<img loading=\"lazy\" class=\" wp-image-15331 aligncenter\" src=\"https:\/\/digiperform.com\/wp-content\/uploads\/2018\/03\/Untitled-design-27-300x169.png\" alt=\"\" width=\"504\" height=\"284\" \/>\r\n<b>Google Jobs  — <\/b>\r\n<b>Confirmed Date: June 20, 2017<\/b>\r\n<b>Hazards: Duplicate Jobs<\/b>\r\n<span style=\"font-weight: 400;\"><strong>About the Update:<\/strong> <\/span>\r\n<span style=\"font-weight: 400;\">Google has launched a new jobs search feature in June 2017 which shows right on its search result pages that let Google users search for jobs across virtually all of the major online job boards like LinkedIn, Monster, DirectEmployers, CareerBuilder and Facebook and others. The idea here is to give job seekers an easy experience and way to see which type of jobs are available without having to go to multiple sites only to find duplicate postings and lots of irrelevant jobs.<\/span>\r\n<span style=\"font-weight: 400;\">To create this comprehensive list, Google first has been removing all of the duplicate listings that employers post to all of these job sites. Then, its machine learning-trained algorithms sift through and categorize them. These job sites often already use at least some job-specific markup to help search engines understand criteria of the job posting. <\/span>\r\n<img loading=\"lazy\" class=\" wp-image-15328 aligncenter\" src=\"https:\/\/digiperform.com\/wp-content\/uploads\/2018\/03\/jobs-169x300.png\" alt=\"\" width=\"405\" height=\"719\" \/>\r\n\r\n<b>Intrusive Interstitial Penalty  — <\/b>\r\n<b>Confirmed Date: January 10, 2017<\/b>\r\n<b>Hazards: User experience, unnecessary pop-ups<\/b>\r\n<strong>About the Update:<\/strong>\r\n<span style=\"font-weight: 400;\">An Intrusive Interstitial is an activity of showing a popup or alert that covers the main content, either immediately after the user navigates to a page from the search results especially on mobile phones, or while they are looking through the page. It’s a kind of displaying a standalone interstitial that the Google user has to dismiss before accessing the main content.<\/span>\r\n<span style=\"font-weight: 400;\">Google has officially announced on January 10, 2017, that it would begin cracking down on intrusive interstitials. The agenda behind is that this type of ad or popups can be problematic and give pathetic user experience especially on mobile devices where screens are often smaller and can hamper the user experience. Google will be potentially penalizing as this is also lowering the rankings of web pages. During the update, Google said these pages where content is not easily accessible to a user on the transition from the mobile search due to intrusive interstitials, results may not rank as highly. Although, Google also provided a rare warning of this update five months in advance. <\/span>\r\n<img loading=\"lazy\" class=\" wp-image-15332 aligncenter\" src=\"https:\/\/digiperform.com\/wp-content\/uploads\/2018\/03\/interstitial-good-300x271.png\" alt=\"\" width=\"527\" height=\"476\" \/>\r\n\r\n<b>Fred<\/b>\r\n<b>Confirmed Date: March 8, 2017<\/b>\r\n<b>Hazards: high-quality post or content, misguiding guidelines for showing ads<\/b>\r\n<strong>About the update:<\/strong>\r\n<span style=\"font-weight: 400;\">Fred isn’t really an algorithm or even one set of processes. It is a catchall name for any quality related algorithm updates related to site quality that Google does not otherwise identify. Fred targets websites that violate Google’s webmaster guidelines. The majority of affected sites are blogs with low-quality posts that appear to be created mostly for the purpose of generating ad revenue. You need to make sure that your pages on the website have high quality and relevant information if you have registered the website for showing ads. Don’t try to trick Google into thinking your page is about something as Google can analyze easily about the page or site that is the full gateway to affiliate links.<\/span>\r\n\r\n<b>2016 Updates<\/b>\r\n<b>Penguin 4.0,  Phase 1 &amp; Penguin 4.0 Announcement  — <\/b>\r\n<b>Confirmed Date &#8211; September 27, 2016 &amp; September 23, 2016<\/b>\r\n<b>Hazards: spamming<\/b>\r\n<strong>About the update:<\/strong>\r\n<span style=\"font-weight: 400;\">Penguin is real-time signal processed &#8211; filter tool which is designed to capture sites that are spamming Google’s search results, within its core search algorithm which operates on a periodic base. This tool is helpful when Google regular spamming systems are not able to detect the spamming.<\/span>\r\n<span style=\"font-weight: 400;\">The new Penguin is baked into the core algorithm with small initial impact assessments which was later revealed that the Penguin 4.0 rollout was unusually long and multi-phase. Google&#8217;s algorithms generally rely on more than 200 unique signals or clues that make it possible to surface what you might be looking for. These signals include things like the specific words that appear on websites, the freshness of content, your region and PageRank. One specific signal of the algorithms is called Penguin, which was first launched in 2012 and today has an update. <\/span>\r\n<img loading=\"lazy\" class=\" wp-image-15333 aligncenter\" src=\"https:\/\/digiperform.com\/wp-content\/uploads\/2018\/03\/clip_image024-300x245.jpg\" alt=\"\" width=\"599\" height=\"489\" \/>\r\n\r\n<b>Mobile-friendly  — <\/b>\r\n<b>Confirmed date: May 12, 2016<\/b>\r\n<b>Hazards: mobile friendly ranking<\/b>\r\n<strong>About the update:<\/strong>\r\n<span style=\"font-weight: 400;\">Google mobile-friendly algorithm is a page-by-page signal as Google takes time to assess each page on the web no matter how fast Google crawls and indexes all pages of your site. The impact will be slow to show up. Just after the original mobile-friendly update, Google rolled out another update to boost benefit mobile-friendly sites on mobile search. However, the impact of the latest update is small as the majority of sites are mobile friendly. This technology is supposed to “increase the effect of the [mobile-friendly] ranking signal.” <\/span>\r\n<img loading=\"lazy\" class=\" wp-image-15334 aligncenter\" src=\"https:\/\/digiperform.com\/wp-content\/uploads\/2018\/03\/Mobile-Friendly-Search-Ranking2-300x160.png\" alt=\"\" width=\"572\" height=\"305\" \/>\r\n\r\n<b>AdWords Shake-up  — <\/b>\r\n<b>Confirmed Date: February 23, 2016<\/b>\r\n<b>Hazards: spacing in Display AdWord Ads<\/b>\r\n<strong>About the update:<\/strong>\r\n<span style=\"font-weight: 400;\">Earlier Google used to 1-3 ads at top of the ad-block. Google has been testing SERPs with 4 ads at the top of the page is rolling out a change to Google AdWords which lead to a ton of speculation in the PPC Community. The 4 ads seem to be at the top of the search results, none on the sidebar at all, and an additional 3 ads at the bottom of the search results.  This replaces the usual mix of top, bottom, and sidebar-heavy AdWords ads, depending on the specific search result. While this was a paid search update, it had significant implications for CTR for both paid and organic results, especially on competitive keywords.<\/span>\r\n<img loading=\"lazy\" class=\" wp-image-15335 aligncenter\" src=\"https:\/\/digiperform.com\/wp-content\/uploads\/2018\/03\/Google-SERP-Updates2.JPG-300x142.png\" alt=\"\" width=\"803\" height=\"380\" \/>\r\n<b>Possum<\/b>\r\n<b>Confirmed Date: September 1, 2016<\/b>\r\n<b>About the Update:<\/b>\r\n<span style=\"font-weight: 400;\">Possum is one of the updates that ensured that local results vary more depending on the user’s location, for example, the closer you are to a business’s address, the more likely you are to see it among local results. Possum also resulted in a greater variety of results ranking for very similar queries, like “Direct Inspections” and “Direct Inspections Co.”. Interestingly, Possum also gave a boost to businesses located outside the physical city area.<\/span>\r\n<img loading=\"lazy\" class=\" wp-image-15336 aligncenter\" src=\"https:\/\/digiperform.com\/wp-content\/uploads\/2018\/03\/Sarasota-vs-Gulf-Gate-Estates-800x351-300x132.png\" alt=\"\" width=\"787\" height=\"346\" \/>\r\n\r\n<b>2015 Updates<\/b>\r\n<b>RankBrain  — <\/b>\r\n<b>Confirmed Date: October 26, 2015<\/b>\r\n<b>Hazards: Optimize content, best search results<\/b>\r\n<strong>About the update:<\/strong>\r\n<span style=\"font-weight: 400;\">RankBrain is Google’s name for a machine-learning artificial intelligence system and part of Google’s Hummingbird algorithm that’s used to help process its search results which use artificial intelligence to filter results. It is one of the hundreds of signals that go into an algorithm that determines what results appear on a Google search page and where they are ranked. <\/span>\r\n<span style=\"font-weight: 400;\">It helps to find out the actual meaning and purpose behind queries and provide the best matching response to those queries. RankBrain is the third most important ranking factor in Google which helps to optimize content for relevance and comprehensiveness with the help of competitive analysis. It helps Optimize content for relevance and comprehensiveness with the help of competitive analysis.<\/span>\r\n\r\n<b>Mobile Update AKA &#8220;Mobilegeddon&#8221;  — <\/b>\r\n<b>Confirmed Date: April 22, 2015<\/b>\r\n<b>About the Update:<\/b>\r\n<span style=\"font-weight: 400;\">When it comes to search on mobile devices, users should get the most relevant and timely results, no matter if the information lives on mobile-friendly web pages or apps. As more people use mobile devices to access the internet, algorithms have to adapt to these usage patterns. Mobilegeddon ensures that mobile-friendly pages rank at the top of the mobile search while pages not optimized for mobile are filtered out from the SERPs or seriously down-ranked.<\/span>\r\n\r\n<b>Other Major Updates:<\/b>\r\n<b>Panda<\/b>\r\n<b>Confirmed Date: February 24, 2011<\/b>\r\n<b>Hazards: Duplicate, plagiarized or thin content; user-generated spam; keyword stuffing<\/b>\r\n<span style=\"font-weight: 400;\">Panda is a search filter introduced to stop sites with poor quality content by assigning the so-called quality score to web pages; from working their way into Google&#8217;s top search results. This score is later used in deciding the ranking factor as well. This tool helps to rectify the duplicate or plagiarized content and excessive keyword stuffing. Initially, Panda was a filter rather than part of Google’s ranking also, but in January 2016, it was officially incorporated into the core algorithm. Panda rollouts have become more frequent, so both penalties and recoveries now happen faster.<\/span>\r\n<img loading=\"lazy\" class=\" wp-image-15337 aligncenter\" src=\"https:\/\/digiperform.com\/wp-content\/uploads\/2018\/03\/panda-290x300.jpg\" alt=\"\" width=\"484\" height=\"501\" \/>\r\n\r\n<b>Hummingbird<\/b>\r\n<b>Confirmed Date: August 22, 2013<\/b>\r\n<b>Hazards: Keyword stuffing; low-quality content<\/b>\r\n<span style=\"font-weight: 400;\">Hummingbird is a search algorithm used by Google to improve results for a conversational search, instead of just looking for keywords it helps the user search specific questions. It pays more attention to each word in a query, ensuring that the whole query the whole sentence or conversation or meaning is taken into account, rather than particular words. The goal is to provide the right search result that matches the meaning to search than pages matching just a few words. <\/span>\r\n<b>Pigeon<\/b>\r\n<b>Confirmed Date: July 24, 2014 (US); December 22, 2014 (UK, Canada, Australia)<\/b>\r\n<b>Hazards: Poor on- and off-page SEO<\/b>\r\n<span style=\"font-weight: 400;\">Pigeon stresses on searches which are based on location. The update created closer ties between the local algorithm and the core algorithm: traditional SEO factors are now used to rank local results. A good way to start with off-page SEO is getting listed in relevant business directories.  <\/span>\r\n<b>Google: Payday Update<\/b>\r\n<b>Confirmed Date:  June 11, 2013 – <\/b>\r\n<span style=\"font-weight: 400;\">The Payday Update was a new algorithm targeted at cleaning up search results for traditionally spammy queries such as pornographic and other heavily spammed queries.<\/span>\r\n<b>Google: Pirate Update<\/b>\r\n<b>Confirmed Date: August 2012<\/b>\r\n<span style=\"font-weight: 400;\">Pirate Update is a filter designed to prevent sites with many copyright infringement reports from ranking well in Google’s listings. The filter may also catch new sites that escaped being caught before, plus it may release false positives that were caught.<\/span>\r\n<b>Google: EMD Update<\/b>\r\n<b>Confirmed Date: September 2012<\/b>\r\n<span style=\"font-weight: 400;\">The EMD Update for Exact Match Domain &#8211; a filter Google launched to prevent poor quality sites from ranking from an irrelevant site. Earlier, Google used to rank those sites on top who had words that match the search terms in their domain names which led to many fluctuations and irrelevancy in ranking. Since the update has come into functioning, the sites have improved their content and ranking.<\/span>\r\n\r\nI hope the list of updates give you an idea how Google keeps on updating each second just to give a better user experience.","protected":false},"excerpt":{"rendered":"The search engines like Google, Yahoo, Bing etc. have a vast playground with immense database and companies are playing hard to stand first in the same search engine database. To accomplish it, SEO is a good practice to be followed&#8230;","protected":false},"author":1,"featured_media":36303,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[116],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v19.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Google SEO Updates: The Past, Present &amp; Future - Digiperform<\/title>\n<meta name=\"description\" content=\"There are certain rules that one should follow to optimize the website to provide the search engine with the necessary signals. Almost every day, Google introduces changes in SEO Updates to its ranking algorithm.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/digiperform.com\/google-seo-updates-the-past-present-future\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Google SEO Updates: The Past, Present &amp; Future - Digiperform\" \/>\n<meta property=\"og:description\" content=\"There are certain rules that one should follow to optimize the website to provide the search engine with the necessary signals. Almost every day, Google introduces changes in SEO Updates to its ranking algorithm.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/digiperform.com\/google-seo-updates-the-past-present-future\/\" \/>\n<meta property=\"og:site_name\" content=\"Digiperform\" \/>\n<meta property=\"article:published_time\" content=\"2018-03-23T13:47:20+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-03-30T12:15:00+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/digiperform.com\/wp-content\/uploads\/2018\/03\/Google-SEO-Updates_-The-Past-Pre.png\" \/>\n\t<meta property=\"og:image:width\" content=\"560\" \/>\n\t<meta property=\"og:image:height\" content=\"315\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"admin\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"13 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/digiperform.com\/#website\",\"url\":\"https:\/\/digiperform.com\/\",\"name\":\"Digiperform\",\"description\":\"Digital Marketing Training Institute\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/digiperform.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/digiperform.com\/google-seo-updates-the-past-present-future\/#primaryimage\",\"url\":\"https:\/\/digiperform.com\/wp-content\/uploads\/2018\/03\/Google-SEO-Updates_-The-Past-Pre.png\",\"contentUrl\":\"https:\/\/digiperform.com\/wp-content\/uploads\/2018\/03\/Google-SEO-Updates_-The-Past-Pre.png\",\"width\":560,\"height\":315},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/digiperform.com\/google-seo-updates-the-past-present-future\/#webpage\",\"url\":\"https:\/\/digiperform.com\/google-seo-updates-the-past-present-future\/\",\"name\":\"Google SEO Updates: The Past, Present & Future - Digiperform\",\"isPartOf\":{\"@id\":\"https:\/\/digiperform.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/digiperform.com\/google-seo-updates-the-past-present-future\/#primaryimage\"},\"datePublished\":\"2018-03-23T13:47:20+00:00\",\"dateModified\":\"2022-03-30T12:15:00+00:00\",\"author\":{\"@id\":\"https:\/\/digiperform.com\/#\/schema\/person\/1420e87bcb82e48906cd5160911fcc1a\"},\"description\":\"There are certain rules that one should follow to optimize the website to provide the search engine with the necessary signals. Almost every day, Google introduces changes in SEO Updates to its ranking algorithm.\",\"breadcrumb\":{\"@id\":\"https:\/\/digiperform.com\/google-seo-updates-the-past-present-future\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/digiperform.com\/google-seo-updates-the-past-present-future\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/digiperform.com\/google-seo-updates-the-past-present-future\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/digiperform.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Google SEO Updates: The Past, Present &#038; Future\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/digiperform.com\/#\/schema\/person\/1420e87bcb82e48906cd5160911fcc1a\",\"name\":\"admin\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/digiperform.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/b69047a5cc9f5694c48ca69f8b62a83b?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/b69047a5cc9f5694c48ca69f8b62a83b?s=96&d=mm&r=g\",\"caption\":\"admin\"},\"sameAs\":[\"https:\/\/digihero.in\/new\"],\"url\":\"https:\/\/digiperform.com\/author\/admin\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Google SEO Updates: The Past, Present & Future - Digiperform","description":"There are certain rules that one should follow to optimize the website to provide the search engine with the necessary signals. Almost every day, Google introduces changes in SEO Updates to its ranking algorithm.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/digiperform.com\/google-seo-updates-the-past-present-future\/","og_locale":"en_US","og_type":"article","og_title":"Google SEO Updates: The Past, Present & Future - Digiperform","og_description":"There are certain rules that one should follow to optimize the website to provide the search engine with the necessary signals. Almost every day, Google introduces changes in SEO Updates to its ranking algorithm.","og_url":"https:\/\/digiperform.com\/google-seo-updates-the-past-present-future\/","og_site_name":"Digiperform","article_published_time":"2018-03-23T13:47:20+00:00","article_modified_time":"2022-03-30T12:15:00+00:00","og_image":[{"width":560,"height":315,"url":"https:\/\/digiperform.com\/wp-content\/uploads\/2018\/03\/Google-SEO-Updates_-The-Past-Pre.png","type":"image\/png"}],"twitter_card":"summary_large_image","twitter_misc":{"Written by":"admin","Est. reading time":"13 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/digiperform.com\/#website","url":"https:\/\/digiperform.com\/","name":"Digiperform","description":"Digital Marketing Training Institute","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/digiperform.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/digiperform.com\/google-seo-updates-the-past-present-future\/#primaryimage","url":"https:\/\/digiperform.com\/wp-content\/uploads\/2018\/03\/Google-SEO-Updates_-The-Past-Pre.png","contentUrl":"https:\/\/digiperform.com\/wp-content\/uploads\/2018\/03\/Google-SEO-Updates_-The-Past-Pre.png","width":560,"height":315},{"@type":"WebPage","@id":"https:\/\/digiperform.com\/google-seo-updates-the-past-present-future\/#webpage","url":"https:\/\/digiperform.com\/google-seo-updates-the-past-present-future\/","name":"Google SEO Updates: The Past, Present & Future - Digiperform","isPartOf":{"@id":"https:\/\/digiperform.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/digiperform.com\/google-seo-updates-the-past-present-future\/#primaryimage"},"datePublished":"2018-03-23T13:47:20+00:00","dateModified":"2022-03-30T12:15:00+00:00","author":{"@id":"https:\/\/digiperform.com\/#\/schema\/person\/1420e87bcb82e48906cd5160911fcc1a"},"description":"There are certain rules that one should follow to optimize the website to provide the search engine with the necessary signals. Almost every day, Google introduces changes in SEO Updates to its ranking algorithm.","breadcrumb":{"@id":"https:\/\/digiperform.com\/google-seo-updates-the-past-present-future\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/digiperform.com\/google-seo-updates-the-past-present-future\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/digiperform.com\/google-seo-updates-the-past-present-future\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/digiperform.com\/"},{"@type":"ListItem","position":2,"name":"Google SEO Updates: The Past, Present &#038; Future"}]},{"@type":"Person","@id":"https:\/\/digiperform.com\/#\/schema\/person\/1420e87bcb82e48906cd5160911fcc1a","name":"admin","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/digiperform.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/b69047a5cc9f5694c48ca69f8b62a83b?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/b69047a5cc9f5694c48ca69f8b62a83b?s=96&d=mm&r=g","caption":"admin"},"sameAs":["https:\/\/digihero.in\/new"],"url":"https:\/\/digiperform.com\/author\/admin\/"}]}},"_links":{"self":[{"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/posts\/15324"}],"collection":[{"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/comments?post=15324"}],"version-history":[{"count":3,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/posts\/15324\/revisions"}],"predecessor-version":[{"id":38239,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/posts\/15324\/revisions\/38239"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/media\/36303"}],"wp:attachment":[{"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/media?parent=15324"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/categories?post=15324"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/tags?post=15324"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}