{"id":15957,"date":"2018-04-18T11:44:33","date_gmt":"2018-04-18T11:44:33","guid":{"rendered":"https:\/\/digiperform.in\/backup\/?p=15957"},"modified":"2022-03-30T12:31:53","modified_gmt":"2022-03-30T12:31:53","slug":"interview-founder-tej-solpro","status":"publish","type":"post","link":"https:\/\/digiperform.com\/interview-founder-tej-solpro\/","title":{"rendered":"An interview session with the Founder of Digital Marketing Agency &#8211; Tej SolPro"},"content":{"rendered":"<span style=\"font-weight: 400;\">Digitalization is not limited to states or countries, it is winning over each road-every city. When digital marketing was not even a known industry, this man interpreted the possibilities and believed that <a href=\"https:\/\/digiperform.com\/future-digital-marketing\/\" target=\"_blank\" rel=\"noopener\">digital marketing is going to be &#8211; the FUTURE<\/a>. He is known for his sense of humor and digital marketing skills. Commonly whooped as Digital Baba, he has been a known face in the fields of IT and Marketing. <\/span>\r\n<span style=\"font-weight: 400;\">He had worked with various known brands and gathered a lot of accolades and appreciation before he became an entrepreneur. Time and again, he has successfully switched and adapted to various roles ranging from web entrepreneur, social media expert to digital marketing speaker and achieved commendable milestones during his endeavor. Let&#8217;s have an open chit chat with the founder of digital marketing agency &#8211; Tej SolPro and renowned Digital Baba &#8211; <\/span><b>Jaydip Parikh<\/b><span style=\"font-weight: 400;\">.<\/span>\r\n<b>About Jaydip Parikh:<\/b>\r\n<a href=\"https:\/\/tej9.com\/team\/jaydip-parikh\/\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" class=\" wp-image-15958 aligncenter\" src=\"https:\/\/digiperform.com\/wp-content\/uploads\/2018\/04\/Screen-Shot-2018-04-18-at-3.49.14-PM-300x170.png\" alt=\"\" width=\"461\" height=\"261\" \/><\/a>\r\n<span style=\"font-weight: 400;\"><a href=\"https:\/\/www.linkedin.com\/in\/jaydipparikh\/\" target=\"_blank\" rel=\"noopener\">Jaydip Parikh<\/a> has more than 15+ years of experience in Marketing as well Digital Marketing. He is an active speaker online as well as offline and Social Media &amp; E-Commerce consultancy are a part of his dominion. He has taken lectures on Digital Marketing at various renowned institutes like NIFT, DDIT, Changa University, C.U. Shah Engineering College, Ahmedabad University, Nirma University, to name a few. He has worked with brands like YourStory, CIIE-IIM, Kevi Rite Jaish, Saptpadii (ABCL Movie), Shamiana etc. Jaydip Parikh, the <\/span><b>CEO of Tej SolPro and a Digital Marketing Strategist<\/b><span style=\"font-weight: 400;\">, has ardent interests in technology and brand innovation, apart from thorough knowledge in business and product promotions.<\/span>\r\n<b>About Tej SolPro:<\/b>\r\n<a href=\"https:\/\/tej9.com\/\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" class=\" wp-image-15962 aligncenter\" src=\"https:\/\/digiperform.com\/wp-content\/uploads\/2018\/04\/tejLogo.png\" alt=\"\" width=\"335\" height=\"138\" \/><\/a>\r\n<span style=\"font-weight: 400;\"><a href=\"https:\/\/tej9.com\/\" target=\"_blank\" rel=\"noopener\">Tej SolPro<\/a> is a Google Partner Digital Marketing agency, offering the full spectrum of digital marketing services like SEO, SEM, Online Reputation Management, Content Marketing, Social Media Marketing, and PPC with Google AdWords &amp; Facebook. They do result-oriented multichannel marketing campaigns for brand awareness and sales.<\/span>\r\n&nbsp;\r\n<b>Video Transcription: <\/b>\r\n<span style=\"font-weight: 400;\">In this video, our product manager &#8211; Pratik, had one on one session with Jaydip Parikh discussing digital marketing, his company, personal vs corporate branding, the inspiration behind Tej SolPro, etc. Let’s read out to know more:<\/span>\r\n<iframe loading=\"lazy\" src=\"https:\/\/www.youtube.com\/embed\/b8E8NtBflgY\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>\r\n<b><i>Digiperform:<\/i><\/b><span style=\"font-weight: 400;\"> Being a Digital Strategist and founder of the digital marketing agency, how you manage both professional as well personal life? Any advice that you would like to give to our readers as well as digital marketers regarding how to balance their busy lives and cope with stressful life. <\/span>\r\n<b><i>Jaydip Parikh:<\/i><\/b><span style=\"font-weight: 400;\"> Balancing professional as well personal life can be tough but manageable. First, you need to understand how to draw line between your working and professional life. You should discuss how you are planning to strategize your work with your family. For example, if you are one who handles US clients and supposes to work on odd hours, you should discuss the same with your family. Share your priority as they need to cope up with the same. Once you start sharing your goals with them, they will understand the need and will be supportive as well. <\/span>\r\n<span style=\"font-weight: 400;\">Also, same goes for the clients as well. If you believe to spend your weekends with your family only, then you need to deliver the same message to your clients as well. Share the cut off line with your clients and family both on regular basis. There is no fixed pattern to any situation. It’s all up to you and priority at the same time. <\/span>\r\n<b><i>Digiperform:<\/i><\/b><span style=\"font-weight: 400;\"> Please share your journey from Jaydip Parikh to Digital Baba. How does digital baba come into the picture?<\/span>\r\n<b><i>Jaydip Parikh:<\/i><\/b><span style=\"font-weight: 400;\"> It started in the days when some Nirmal Baba did some scam. We and my friends were randomly discussing the event and our business deals where someone complimented on my sense of humor that I should be baba too like Jaydip Baba. I personally liked the idea and being a marketer, I always believed that branding is the most important aspect of your career journey, especially in our line. Then I took the advice and booked the domain with <a href=\"http:\/\/jaydipbaba.com\/\" target=\"_blank\" rel=\"noopener\">Jaydipbaba.com<\/a> and started pitching the same with my projects. After some successful projects, people started calling me &#8211; Digital Baba.<\/span>\r\n<b><i>Digiperform:<\/i><\/b><span style=\"font-weight: 400;\"> How you differentiate your personal name &#8211; Digital Baba with your digital marketing agency &#8211; Tej SolPro?<\/span>\r\n<b><i>Jaydip Parikh:<\/i><\/b><span style=\"font-weight: 400;\"> My company Tej SolPro believes to work as a team. And, we hunt for projects as a team only. Ideally, when it comes to spending lakhs on any campaign or project, you don’t get sold on your personal branding, it’s all on your company profile and teamwork. Plus, it also depend on the client to client, for example, I have few clients based on my personal branding and relations whereas somewhere I meet people as a CEO of Tej SolPro. All you need to act as per the clients and requirements. Sometimes, they go in hand in hand. Based on the work and person, one should decide to pitch. <\/span>\r\n<b><i>Digiperform:<\/i><\/b><span style=\"font-weight: 400;\"> How long its been in digital space?<\/span>\r\n<b><i>Jaydip Parikh:<\/i><\/b><span style=\"font-weight: 400;\"> If I only talk about digital space, it been almost a decade, ten years. I started my online marketing career as a Product Manager in 2006 in one of the IT companies. My job responsibilities were to take care of entire life cycle of the product from its sale to customer support. During the period, I realized how SEO could help in online ranking and the importance of SEO in online marketing. Thereafter, I started researching and learning about the same. I used to sit with the SEO and social media experts to learn more and ask as much I can to clear my doubts. <\/span>\r\n<span style=\"font-weight: 400;\">After learning the facts, I recommended my company to add Online Payment Gateway for the product sale. Initially, it took 3 months to get our first order, then by the end of 2007, we had 40% sales directly through online. This strategy made me sure that online marketing is going to be the FUTURE and my passion led me to start my own digital marketing agency a few years back. <\/span>\r\n<b><i>Digiperform:<\/i><\/b><span style=\"font-weight: 400;\"> During the learning phase, did you run your own blog?<\/span>\r\n<b><i>Jaydip Parikh:<\/i><\/b><span style=\"font-weight: 400;\"> While learning about SEO, I started my first blog on BlogSpot and started writing whatever I used to learn in the process. Thereafter, I also started writing about my personal domain and after some time I started receiving inquiries based on my blogs. This made me believe my efforts and I purchased 4-5 domains for only blogging purpose and started my blogs for advertisement purpose. <\/span>\r\n<b><i>Digiperform:<\/i><\/b><span style=\"font-weight: 400;\"> For you, when Social Media Marketing came into the picture?<\/span>\r\n<b><i>Jaydip Parikh:<\/i><\/b><span style=\"font-weight: 400;\"> At the beginning of my career, Orkut was famous among youngsters. I used to follow Orkut a lot, then later joined Facebook &amp; Twitter as well. I used to follow marketing news on social media and tried to share the same by adding my sense of humor to it. With the same, I build great friend list. With them, I used to share my marketing idea or new discoveries happening around the world. Later, I joined ShoutMeLoud.com and started managing brand pages as well. ShoutMeLoud is a blogging platform where you can share your ideas and strategies through blogging. In mid-2008, these efforts led to meet PM Modi Ji with whom I shared my ideas and benefits of digitalization. I even run my blogs on Modi Ji digital campaigns.  <\/span>\r\n<img loading=\"lazy\" class=\" wp-image-15960 aligncenter\" src=\"https:\/\/digiperform.com\/wp-content\/uploads\/2018\/04\/jaydip1-300x200.jpeg\" alt=\"\" width=\"452\" height=\"301\" \/>\r\n<b><i>Digiperform:<\/i><\/b><span style=\"font-weight: 400;\"> What has inspired you to build a Digital Marketing Agency &#8211; Tej SolPro?<\/span>\r\n<b>Jaydip Parikh:<\/b><span style=\"font-weight: 400;\"> While discovering about digital marketing, I realized that there was no company specialized in online marketing in Ahmedabad. Like, no exclusive agency which could handle all platforms of online marketing like social media marketing, SEO, website development, etc. where a layman could not handle or plan online marketing strategies on their own. They needed a proper help. This was somehow an advantage for me to realize that it was the threshold to bring an exclusive digital marketing company in the market. Therefore, I decided to bring the new concept of the digital marketing agency in Ahmedabad market. <\/span>\r\n<b>Note for new Entrepreneurs or Wannabe Entrepreneurs: <\/b>\r\n<span style=\"font-weight: 400;\">Entrepreneurship is the very dark concept. It’s not easy to swing along without any troubles or hiccups. It involved proper planning and during the time, you may find yourself completely alone in your projects as well. That’s why I call it as a Dark concept. Also, always try to be unique and show your original talent. It will take time but will help you a lot in future to stand above in the competition. <\/span>\r\n<b><i>Digiperform:<\/i><\/b><span style=\"font-weight: 400;\"> What is the strength of your company? How you hunt new projects for your company?<\/span>\r\n<b><i>Jaydip Parikh:<\/i><\/b><span style=\"font-weight: 400;\"> We are a <a href=\"https:\/\/tej9.com\/team\/\" target=\"_blank\" rel=\"noopener\">small team of around 10 people in the company<\/a> and extra 5 more for offline activities. <\/span>\r\n<span style=\"font-weight: 400;\">Currently, we are already a Big Brand in Ahmedabad, so we get projects easily through inbound inquiries. Clients approach us through social media or website and tell us they have heard about us from any source. They approach us for their digital marketing needs for various brands. <\/span>\r\n<b><i>Digiperform:<\/i><\/b><span style=\"font-weight: 400;\"> What you would like to suggest to the newbie or a person who is totally new to this and want to start as a fresher in digital marketing? If they want to start a local business, how they should approach new clients?<\/span>\r\n<b><i>Jaydip Parikh:<\/i><\/b><span style=\"font-weight: 400;\"> These are few things I would like to recommend to fellow freshmen which I rigorously followed in my journey:<\/span>\r\n<ul>\r\n \t<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">They need to be confident about themselves and their teams. If you don’t believe in your team, no one going to believe you as well.<\/span><\/li>\r\n \t<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Keep interacting or start talking about your brand in your links, friends, colleagues and over social media as well. <\/span><\/li>\r\n \t<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Create your own or business &#8211; social media page.<\/span><\/li>\r\n \t<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Don’t be shy to talk publically. Also, do public speaking and share your ideas with others. <\/span><\/li>\r\n<\/ul>\r\n<span style=\"font-weight: 400;\">One should never be afraid of failures. For any situation, either you will get your answers as Yes or No. There is nothing wrong to accept both. Discuss and share your ideas, at least they will get to know about your company.<\/span>\r\n<b><i>Digiperform:<\/i><\/b><span style=\"font-weight: 400;\"> How you promote your company on online platforms?<\/span>\r\n<b><i>Jaydip Parikh:<\/i><\/b><span style=\"font-weight: 400;\"> We generally follow simple rules:<\/span>\r\n<ul>\r\n \t<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">We do basic social media marketing. Currently, we do have good clienteles over social media platforms since the beginning.  <\/span><\/li>\r\n \t<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">We have separate teams to manage different platforms like SEO, social media and website etc.<\/span><\/li>\r\n \t<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Currently, we are focussing on videos and planning to launch videos to promote our business as well. <\/span><\/li>\r\n<\/ul>\r\n&nbsp;\r\n<b><i>Digiperform: <\/i><\/b><span style=\"font-weight: 400;\">On which platform you are most active in 2018?<\/span>\r\n<b><i>Jaydip Parikh: <\/i><\/b><span style=\"font-weight: 400;\">Facebook is always been my favorite and easy to handle as well. I am quite active on Facebook, followed by Twitter. You need to be very handy when it comes to Twitter. <\/span>\r\n<b><i>Digiperform:<\/i><\/b><span style=\"font-weight: 400;\"> Do you still blog?<\/span>\r\n<b><i>Jaydip Parikh:<\/i><\/b><span style=\"font-weight: 400;\"> Yes, I have been blogging for many years. I blog on my company website and also, on my own domain &#8211; <a href=\"http:\/\/jaydipbaba.com\/\" target=\"_blank\" rel=\"noopener\">JaydipBaba.com<\/a>. Apart from that, I write blogs on LinkedIn and Medium as well. <\/span>\r\n<b><i>Digiperform:<\/i><\/b><span style=\"font-weight: 400;\"> These days LinkedIn is turning or called as Professional Facebook? What are your views on the same?<\/span>\r\n<b><i>Jaydip Parikh: <\/i><\/b><span style=\"font-weight: 400;\">In 2006, LinkedIn was the best platform if you wanted some suggestion or businesses\/clients. That time, I cracked a deal of 1.6 million INR on LinkedIn. It was more easy and professional than current scenario. Now, it has become messier with “N” numbers of fake profiles. Still, it hasn’t lost it charm and the great platform to showcase your business. We are also planning to launch LinkedIn ads (though costly) to promote our business. <\/span>\r\n<b><i>Digiperform:<\/i><\/b><span style=\"font-weight: 400;\"> Any tips or suggestions for our viewers or readers especially freshers.<\/span>\r\n<b><i>Jaydip Parikh:<\/i><\/b><span style=\"font-weight: 400;\"> Personally, I feel these are the few tips to become the successful digital marketing in the initial stage:<\/span>\r\n<ul>\r\n \t<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">It’s all about practical stuff. Try to learn and apply those theories practically. <\/span><\/li>\r\n \t<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Try to strategize things and then work on it. You can also discuss same with your superiors and experts to get an idea of how it will work out or not. Make your plan be ready as well.<\/span><\/li>\r\n \t<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Finally, believe in your strategies and just implement what you believe.<\/span><\/li>\r\n<\/ul>\r\n&nbsp;\r\n<span style=\"font-weight: 400;\">Thanks a lot, Jaydip for sharing your valuable journey. We wish the best for your company. <\/span>\r\nYou can reach them by following social profiles as well:\r\n<div dir=\"ltr\">Facebook: <a href=\"https:\/\/www.facebook.com\/TejSolPro\/\" target=\"_blank\" rel=\"noopener\">https:\/\/www.facebook.com\/TejSolPro\/<\/a><\/div>\r\n<div dir=\"ltr\">Twitter:  <a href=\"https:\/\/twitter.com\/tejsolpro\" target=\"_blank\" rel=\"noopener\">https:\/\/twitter.com\/tejsolpro<\/a><\/div>\r\n<div dir=\"ltr\">Instagram: <a href=\"https:\/\/www.instagram.com\/tejsolpro\/\" target=\"_blank\" rel=\"noopener\">https:\/\/www.instagram.com\/tejsolpro\/<\/a><\/div>\r\n<div dir=\"ltr\">LinkedIn: <a href=\"https:\/\/www.linkedin.com\/company\/tej-solpro\/\" target=\"_blank\" rel=\"noopener\">https:\/\/www.linkedin.com\/company\/tej-solpro\/<\/a><\/div>","protected":false},"excerpt":{"rendered":"Digitalization is not limited to states or countries, it is winning over each road-every city. When digital marketing was not even a known industry","protected":false},"author":1,"featured_media":15980,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[132],"tags":[250,251],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v19.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>An interview session with the Founder of Digital Marketing Agency - Tej SolPro - Digiperform<\/title>\n<meta name=\"description\" content=\"Digital Baba has more than 15+ years of experience in Marketing as well Digital Marketing. He is an active speaker online as well as offline and Social Media &amp; E-Commerce consultancy are a part of his dominion.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/digiperform.com\/interview-founder-tej-solpro\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"An interview session with the Founder of Digital Marketing Agency - Tej SolPro - Digiperform\" \/>\n<meta property=\"og:description\" content=\"Digital Baba has more than 15+ years of experience in Marketing as well Digital Marketing. He is an active speaker online as well as offline and Social Media &amp; E-Commerce consultancy are a part of his dominion.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/digiperform.com\/interview-founder-tej-solpro\/\" \/>\n<meta property=\"og:site_name\" content=\"Digiperform\" \/>\n<meta property=\"article:published_time\" content=\"2018-04-18T11:44:33+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-03-30T12:31:53+00:00\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"admin\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/digiperform.com\/#website\",\"url\":\"https:\/\/digiperform.com\/\",\"name\":\"Digiperform\",\"description\":\"Digital Marketing Training Institute\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/digiperform.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/digiperform.com\/interview-founder-tej-solpro\/#primaryimage\",\"url\":\"\",\"contentUrl\":\"\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/digiperform.com\/interview-founder-tej-solpro\/#webpage\",\"url\":\"https:\/\/digiperform.com\/interview-founder-tej-solpro\/\",\"name\":\"An interview session with the Founder of Digital Marketing Agency - Tej SolPro - Digiperform\",\"isPartOf\":{\"@id\":\"https:\/\/digiperform.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/digiperform.com\/interview-founder-tej-solpro\/#primaryimage\"},\"datePublished\":\"2018-04-18T11:44:33+00:00\",\"dateModified\":\"2022-03-30T12:31:53+00:00\",\"author\":{\"@id\":\"https:\/\/digiperform.com\/#\/schema\/person\/1420e87bcb82e48906cd5160911fcc1a\"},\"description\":\"Digital Baba has more than 15+ years of experience in Marketing as well Digital Marketing. He is an active speaker online as well as offline and Social Media & E-Commerce consultancy are a part of his dominion.\",\"breadcrumb\":{\"@id\":\"https:\/\/digiperform.com\/interview-founder-tej-solpro\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/digiperform.com\/interview-founder-tej-solpro\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/digiperform.com\/interview-founder-tej-solpro\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/digiperform.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"An interview session with the Founder of Digital Marketing Agency &#8211; Tej SolPro\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/digiperform.com\/#\/schema\/person\/1420e87bcb82e48906cd5160911fcc1a\",\"name\":\"admin\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/digiperform.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/b69047a5cc9f5694c48ca69f8b62a83b?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/b69047a5cc9f5694c48ca69f8b62a83b?s=96&d=mm&r=g\",\"caption\":\"admin\"},\"sameAs\":[\"https:\/\/digihero.in\/new\"],\"url\":\"https:\/\/digiperform.com\/author\/admin\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"An interview session with the Founder of Digital Marketing Agency - Tej SolPro - Digiperform","description":"Digital Baba has more than 15+ years of experience in Marketing as well Digital Marketing. He is an active speaker online as well as offline and Social Media & E-Commerce consultancy are a part of his dominion.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/digiperform.com\/interview-founder-tej-solpro\/","og_locale":"en_US","og_type":"article","og_title":"An interview session with the Founder of Digital Marketing Agency - Tej SolPro - Digiperform","og_description":"Digital Baba has more than 15+ years of experience in Marketing as well Digital Marketing. He is an active speaker online as well as offline and Social Media & E-Commerce consultancy are a part of his dominion.","og_url":"https:\/\/digiperform.com\/interview-founder-tej-solpro\/","og_site_name":"Digiperform","article_published_time":"2018-04-18T11:44:33+00:00","article_modified_time":"2022-03-30T12:31:53+00:00","twitter_card":"summary_large_image","twitter_misc":{"Written by":"admin","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/digiperform.com\/#website","url":"https:\/\/digiperform.com\/","name":"Digiperform","description":"Digital Marketing Training Institute","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/digiperform.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/digiperform.com\/interview-founder-tej-solpro\/#primaryimage","url":"","contentUrl":""},{"@type":"WebPage","@id":"https:\/\/digiperform.com\/interview-founder-tej-solpro\/#webpage","url":"https:\/\/digiperform.com\/interview-founder-tej-solpro\/","name":"An interview session with the Founder of Digital Marketing Agency - Tej SolPro - Digiperform","isPartOf":{"@id":"https:\/\/digiperform.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/digiperform.com\/interview-founder-tej-solpro\/#primaryimage"},"datePublished":"2018-04-18T11:44:33+00:00","dateModified":"2022-03-30T12:31:53+00:00","author":{"@id":"https:\/\/digiperform.com\/#\/schema\/person\/1420e87bcb82e48906cd5160911fcc1a"},"description":"Digital Baba has more than 15+ years of experience in Marketing as well Digital Marketing. He is an active speaker online as well as offline and Social Media & E-Commerce consultancy are a part of his dominion.","breadcrumb":{"@id":"https:\/\/digiperform.com\/interview-founder-tej-solpro\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/digiperform.com\/interview-founder-tej-solpro\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/digiperform.com\/interview-founder-tej-solpro\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/digiperform.com\/"},{"@type":"ListItem","position":2,"name":"An interview session with the Founder of Digital Marketing Agency &#8211; Tej SolPro"}]},{"@type":"Person","@id":"https:\/\/digiperform.com\/#\/schema\/person\/1420e87bcb82e48906cd5160911fcc1a","name":"admin","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/digiperform.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/b69047a5cc9f5694c48ca69f8b62a83b?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/b69047a5cc9f5694c48ca69f8b62a83b?s=96&d=mm&r=g","caption":"admin"},"sameAs":["https:\/\/digihero.in\/new"],"url":"https:\/\/digiperform.com\/author\/admin\/"}]}},"_links":{"self":[{"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/posts\/15957"}],"collection":[{"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/comments?post=15957"}],"version-history":[{"count":2,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/posts\/15957\/revisions"}],"predecessor-version":[{"id":38266,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/posts\/15957\/revisions\/38266"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/digiperform.com\/wp-json\/"}],"wp:attachment":[{"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/media?parent=15957"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/categories?post=15957"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/tags?post=15957"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}