{"id":17534,"date":"2018-07-20T11:04:45","date_gmt":"2018-07-20T11:04:45","guid":{"rendered":"https:\/\/digiperform.in\/backup\/?p=17534"},"modified":"2022-03-24T09:53:23","modified_gmt":"2022-03-24T09:53:23","slug":"free-email-marketing-course-chapter-2-how-to-build-email-marketing-list","status":"publish","type":"post","link":"https:\/\/digiperform.com\/free-email-marketing-course-chapter-2-how-to-build-email-marketing-list\/","title":{"rendered":"Chapter 2: How to build an email marketing list from scratch?"},"content":{"rendered":"<span style=\"font-weight: 400;\">In our first chapter of <a href=\"https:\/\/digiperform.com\/the-beginners-guide-to-email-marketing\/\" target=\"_blank\" rel=\"noopener\">free online email marketing course<\/a>, we have shared <a href=\"https:\/\/digiperform.com\/free-courses-email-marketing-course-chapter1\/\" target=\"_blank\" rel=\"noopener\">the basic of email marketing and the role of email marketing in business. <\/a><\/span>\r\n<span style=\"font-weight: 400;\">In chapter 2 of email marketing course, we are going to discuss:<\/span>\r\n<ul>\r\n \t<li><span style=\"font-weight: 400;\">What is an email marketing list? <\/span><\/li>\r\n \t<li><span style=\"font-weight: 400;\">What is the significance of the email marketing list in online business? <\/span><\/li>\r\n \t<li><span style=\"font-weight: 400;\">How to start an email marketing list? <\/span><\/li>\r\n \t<li><span style=\"font-weight: 400;\">What are the best practices to <em>create the email marketing list? <\/em><\/span><\/li>\r\n \t<li><span style=\"font-weight: 400;\">How to segment the email marketing list for business purposes? <\/span><\/li>\r\n \t<li><span style=\"font-weight: 400;\">And, what are the w<\/span><span style=\"font-weight: 400;\">ays to grow an email marketing list?<\/span><\/li>\r\n<\/ul>\r\nHere we go!\r\n<h2><span style=\"color: #993300;\"><b>What is the <\/b><strong>Email Marketing List?<\/strong><\/span><\/h2>\r\n<span style=\"font-weight: 400;\">An email marketing list is a list of subscribers\/customers who are a part of periodic mailing distribution by the businesses. The email marketing list generally includes each person&#8217;s email address rather than a postal address. <\/span>\r\n<span style=\"font-weight: 400;\">As per the experts, it is always a good idea to include as much information with the mailing list as possible; like that:<\/span>\r\n<ul>\r\n \t<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Helps in tracking which services\/products are used or purchased by that customer.<\/span><\/li>\r\n \t<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Track how they make purchases.<\/span><\/li>\r\n \t<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">And, track how often they contact customer service.<\/span><\/li>\r\n<\/ul>\r\n&nbsp;\r\n<h2><span style=\"color: #993300;\"><b>Why are contacts and lists important?<\/b><\/span><\/h2>\r\n<span style=\"font-weight: 400;\">For any business, the email is always taken as the trustable source to interact with customers. With the prevalence of social media and hundreds of other messaging services, the emails are considered as the most appropriate way to communicate and share business with the customers as well. <\/span>\r\n<span style=\"font-weight: 400;\">However, having an accurate and responsive email marketing list of current customers is always a goldmine for any business. More importantly, having an updated and test mailing list can be an ultimate reason for any successful marketing campaign. <\/span>\r\n<span style=\"font-weight: 400;\">These lists play a big role in any marketing strategy as they provide leads for sales, a group for testing new products and a group to provide feedback on satisfaction.<\/span>\r\nStill not sure, read out astonishing <a href=\"https:\/\/digiperform.com\/31-astonishing-email-marketing-statistics-you-need-to-know\/\" target=\"_blank\" rel=\"noopener\">email marketing statistics<\/a> that you need to know&#8230;&#8230;\r\n<h2><span style=\"color: #993300;\"><b>What is the role of the email marketing list in online business?<\/b><\/span><\/h2>\r\n&nbsp;\r\n<h4><b>More People Will Read Your Messages<\/b><\/h4>\r\n<span style=\"font-weight: 400;\">No doubt, people are active on social media than any other platform. However, there are many ways that add lots of worry surroundings on the use of social media. The readers don’t accept every social media post to be read and followed. <\/span>\r\n<span style=\"font-weight: 400;\">Secondly, from a marketer perspective, the social media platforms’ algorithms keep on changing which makes it sometimes not easy to share descriptive information. <\/span>\r\n<span style=\"font-weight: 400;\">These algorithm limits won’t let you drop your message directly in your customer&#8217;s inbox. The emails help to deliver your content straight to your subscribers’ inbox and urge them to read at their leisure. <\/span>\r\n<span style=\"font-weight: 400;\">Therefore no worry about the algorithms and limited access, you can directly send your product details to your subscriber&#8217;s inbox and increase the traffic simultaneously.<\/span>\r\n<a href=\"https:\/\/digiperform.com\/wp-content\/uploads\/2018\/07\/fab-1.png\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" class=\"wp-image-17541 aligncenter\" src=\"https:\/\/digiperform.com\/wp-content\/uploads\/2018\/07\/fab-1.png\" alt=\"\" width=\"452\" height=\"553\" \/><\/a>\r\n<h4><b>Share the Launch of New Products<\/b><\/h4>\r\n<span style=\"font-weight: 400;\">Once you gain trusted readers from your email marketing list, you can share various information related to your businesses; like product launches, posts related to new products and much more. <\/span>\r\n<span style=\"font-weight: 400;\">Your current subscribers who are happy to read your email will definitely invest his\/her time to read about your new product launches and show the interest to try your new product as well. <\/span>\r\n<span style=\"font-weight: 400;\">You can even utilize your designated email marketing list to create the curiosity among readers before the product launch as well. <\/span>\r\n<span style=\"font-weight: 400;\">Like, sharing the complete information about new events on time and getting the people to talk about your product\/business (which is the ideal motto of any mailing list). It’s a great way to get ideas for new products that will do well in the market. <\/span>\r\n<span style=\"font-weight: 400;\">This element is generally beneficial in the case of e-commerce. For Example, you might have noticed in your inboxes that e-commerce companies keep on sharing their upcoming sales and new seasonal product launches to keep their customers ready and alert enough to make most out of the sale.  <\/span>\r\n<span style=\"font-weight: 400;\">You can see the example in the picture as well. <\/span>\r\n<a href=\"https:\/\/digiperform.com\/wp-content\/uploads\/2018\/07\/email2.jpg\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" class=\" wp-image-17539 aligncenter\" src=\"https:\/\/digiperform.com\/wp-content\/uploads\/2018\/07\/email2.jpg\" alt=\"\" width=\"426\" height=\"759\" \/><\/a>\r\n<h4><b>To Generate Sales Leads<\/b><\/h4>\r\n<span style=\"font-weight: 400;\">Once you have built the required trust, shared enough information with your subscribers and people who have already purchased from your company are more likely to purchase again provided have given a good experience.<\/span>\r\n<span style=\"font-weight: 400;\">An email marketing list gathered from your subscribers is a great way to start your sales strategy; particularly if you are a company with multiple SKUs or products. As I have mentioned earlier, mailing list plays a big role in the case of e-commerce companies or companies with multiple product choices. <\/span>\r\n<span style=\"font-weight: 400;\">For example, a company that leases vehicles and provides roadside services can contact their customers who have only purchased one or the other. The sales team can try to persuade their customers to purchase the other service through the right content and email marketing list. <\/span>\r\n<h4><b>Customer Service<\/b><\/h4>\r\n<span style=\"font-weight: 400;\">A great email marketing list can also build by providing good customer service. Also, the list can be effectively used to get feedback on satisfying levels. Giant companies use call center applications like Optimum and ask customers to complete a survey on their experience.<\/span>\r\n<a href=\"https:\/\/digiperform.com\/wp-content\/uploads\/2018\/07\/email3.png\" target=\"_blank\" rel=\"noopener\"><span style=\"font-weight: 400;\"><img loading=\"lazy\" class=\"wp-image-17542 aligncenter\" src=\"https:\/\/digiperform.com\/wp-content\/uploads\/2018\/07\/email3.png\" alt=\"\" width=\"657\" height=\"434\" \/><\/span><\/a>\r\n<span style=\"font-weight: 400;\">The email marketing list can be utilized to find the areas of your company and work on to bring low to high satisfaction levels. Learn from your customers and let them help you improve.<\/span>\r\n<h4><b>Return On Investment<\/b><\/h4>\r\n<span style=\"font-weight: 400;\">If you still not believe what wonders an email marketing list could do and how it can be more powerful than social media, then you need to focus on these three words: <em><strong>Return On Investment<\/strong><\/em>. <\/span>\r\n<span style=\"font-weight: 400;\">Whatever you do to bring the best out of your marketing campaigns; all will go in vain if it&#8217;s not generating conversions. <\/span>\r\n<span style=\"font-weight: 400;\">And, the conversion can be in many forms like clicks, reviews, purchase, download etc, depending on your call-to-action buttons. <\/span>\r\n<span style=\"font-weight: 400;\">With the help of various email marketing tools like <a href=\"http:\/\/www.aweber.com\/easy-email.htm?id=479814\" target=\"_blank\" rel=\"noopener\">AWeber<\/a>, <a href=\"http:\/\/www.getresponse.com\/index\/aditi0308\" target=\"_blank\" rel=\"noopener\">GetResponse<\/a>, <a href=\"https:\/\/mailchimp.com\/\" target=\"_blank\" rel=\"noopener\">MailChimp<\/a>, <a href=\"http:\/\/mbsy.co\/convertkit\/29912177\" target=\"_blank\" rel=\"noopener\">ConvertKit<\/a>, <a href=\"http:\/\/www.benchmarkemail.com\/?p=777762\" target=\"_blank\" rel=\"noopener\">Benchmark<\/a>, etc, you can keep a track on your conversions and build your upcoming campaigns on the basis of the tool analysis.<\/span>\r\n<h2><\/h2>\r\n<h2><\/h2>\r\n<h2><\/h2>\r\n<h2><span style=\"color: #993300;\"><b>Best Practices to Build an Email Marketing List (Step by Step Guide on how to start building your <\/b><strong>Email Marketing List<\/strong><b>)<\/b><\/span><\/h2>\r\n<span style=\"font-weight: 400;\">It is even said by many marketers that the secret of a great campaigns lies in a great email marketing List. However, you need patience. <\/span>\r\n<span style=\"font-weight: 400;\">You can not start sending emails to your subscribers and expect conversions in just minutes. You need to create a right email marketing campaign.<\/span>\r\n<span style=\"font-weight: 400;\">An ideal marketer will always start the best campaign with the best email marketing lists, understand its reader&#8217;s interest and create a brilliant design with engaging copies including graphics. <\/span>\r\n<span style=\"font-weight: 400;\">You should have three main priorities for building a quality list. In order, these are:<\/span>\r\n<ul>\r\n \t<li style=\"font-weight: 400;\"><b>Quality-<\/b><span style=\"font-weight: 400;\"> You want real information from real people who check their email frequently.<\/span><\/li>\r\n \t<li style=\"font-weight: 400;\"><b>Relevance-<\/b><span style=\"font-weight: 400;\"> These people should be genuinely interested in your brand and industry.<\/span><\/li>\r\n \t<li style=\"font-weight: 400;\"><b>Volume-<\/b><span style=\"font-weight: 400;\"> If the first two priorities are squared away, you can start focusing on quantity.<\/span><\/li>\r\n<\/ul>\r\n&nbsp;\r\n<h4><b>Step 1: Start Early As You Can <\/b><\/h4>\r\n<span style=\"font-weight: 400;\">An ideal marketer will understand the importance of <a href=\"https:\/\/digiperform.com\/what-is-email-marketing\/\" target=\"_blank\" rel=\"noopener\">email marketing<\/a>. <\/span>\r\n<span style=\"font-weight: 400;\">One should start looking for various email marketing tools and read various case studies to understand how big companies make their name in this competitive world through email marketing campaigns. <\/span>\r\n<span style=\"font-weight: 400;\">With the right strategy and tools, your email list will be able to compound the growth that you deserve and the time you spend developing it. Sooner you start, faster you will be able to build the email marketing list and longer it will help. <\/span>\r\n<span style=\"font-weight: 400;\">Start with the basic and simple segments, crafting email campaigns that target the specific groups of your email subscribers basis on their interest. <\/span>\r\n<span style=\"font-weight: 400;\">For example, divide your list into 2 segments: <\/span>\r\n<span style=\"font-weight: 400;\">1) customers who have already made a purchase from your company, and <\/span>\r\n<span style=\"font-weight: 400;\">2) prospects who have expressed interest in your company. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">AND;<\/span>\r\n\r\n<b>Start With Who You Know<\/b>\r\n<span style=\"font-weight: 400;\">Just start with the current email marketing list you have. If you have nil, then import all of your existing customers&#8217; contacts you have in your CRM system which would give you a decent start. You can also dig the list of your previous email list from old campaigns. <\/span>\r\n<span style=\"font-weight: 400;\">For building your email list, you can use one of the many email marketing services available. Some that we recommend are MailChimp, AWeber, and Infusionsoft.<\/span>\r\n<h4><b>Step 2: Build a Great Content<\/b><\/h4>\r\n<span style=\"font-weight: 400;\">What would you share in your email campaigns? The content, right! Before using your email marketing list, you should be sure enough that you have paralleled content to be shared. <\/span>\r\n<span style=\"font-weight: 400;\">Prepare your content strategy, try to use more graphics, fewer links, advised information, and attractable but non-offensive content. <\/span>\r\n<span style=\"font-weight: 400;\">You should only think to serve and direct your customers\/subscribers into your website as well as an incentive to subscribe (so that they can receive the exclusive content\/emails in future).<\/span>\r\n<span style=\"font-weight: 400;\">We do understand creating an ideal content takes times. You should have enough resources who can create content strategies for you or you can try yourself as well. Once you have done with the content, add graphics and videos if you can. <\/span>\r\n<span style=\"font-weight: 400;\">Do not forget to add <\/span><b>Call-to-Actions<\/b><span style=\"font-weight: 400;\"> for the email subscription or your call out action like download, signup, purchase, call back, etc.<\/span>\r\n<a href=\"https:\/\/digiperform.com\/wp-content\/uploads\/2018\/07\/Screen-Shot-2018-07-20-at-4.25.23-PM.png\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" class=\" wp-image-17548 aligncenter\" src=\"https:\/\/digiperform.com\/wp-content\/uploads\/2018\/07\/Screen-Shot-2018-07-20-at-4.25.23-PM.png\" alt=\"\" width=\"552\" height=\"561\" \/><\/a>\r\n<h4><b>Step 3: Analyze Your Email Marketing List<\/b><\/h4>\r\n<span style=\"font-weight: 400;\">With the help of your email marketing tools, you can analyze that the email marketing list is worthy enough to give you the desired conversion. Are the emails going spam? What are the opening rates? These minor details will not only help you to build an ideal email marketing list but also gives you the chance to target the right customers. <\/span>\r\n<span style=\"font-weight: 400;\"><strong>Note: Test and optimize your segmented email campaigns regularly.<\/strong> <\/span>\r\n<span style=\"font-weight: 400;\">In addition to opens, clicks, and conversions, be sure to measure success using such metrics as sales, return on investment, and overall revenue. Based on the results, adjust your email content and segments to continually improve your performance results.<\/span>\r\n<a href=\"https:\/\/digiperform.com\/wp-content\/uploads\/2018\/07\/mail-chimp2.png\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" class=\" wp-image-17543 aligncenter\" src=\"https:\/\/digiperform.com\/wp-content\/uploads\/2018\/07\/mail-chimp2.png\" alt=\"\" width=\"618\" height=\"428\" \/><\/a>\r\n<h4><b>Step 4: Get Your People Sharing<\/b><\/h4>\r\n<span style=\"font-weight: 400;\">I won’t deny the fact that social sharing is also the most powerful and easiest way to get more followers\/subscribers. For example, adding a “<strong>SHARE<\/strong>” feature on the body of the email content and social media pages links in the bottom of each mailer can increase the click-through rates by 158 percent which is huge as per marketing experts. <\/span>\r\n<span style=\"font-weight: 400;\">However, sharing isn’t just about getting more email subscribers to engage with your content, it’s also about getting more people interested in becoming subscribers.<\/span>\r\n<span style=\"font-weight: 400;\">For example, you have shared some coupon in your email content to discount to your customers. Few of your customers want to share the same content as well coupon in their contact lists.<\/span>\r\n<a href=\"https:\/\/digiperform.com\/wp-content\/uploads\/2018\/07\/email1.jpg\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" class=\" wp-image-17538 aligncenter\" src=\"https:\/\/digiperform.com\/wp-content\/uploads\/2018\/07\/email1.jpg\" alt=\"\" width=\"502\" height=\"775\" \/><\/a>\r\n<span style=\"font-weight: 400;\">It will be more convenient for them if they can easily share the same content through social media shareable buttons. It will give a natural inclination to join your list for future offers (assuming that you have a  new customer, to begin with).<\/span>\r\n<h2><span style=\"color: #993300;\"><b>Segmentation: Why do we recommend to segment your email marketing list?<\/b><\/span><\/h2>\r\n<span style=\"font-weight: 400;\">Likewise, we stated in one step, segmenting your email list is very important if you want to build a strong email marketing list. <\/span>\r\n<span style=\"font-weight: 400;\">If you are in product sale business, you can segment your subscribers\/customers into 2 segments: <\/span>\r\n<span style=\"font-weight: 400;\">1) customers who have already made a purchase from your company, and <\/span>\r\n<span style=\"font-weight: 400;\">2) prospects who have expressed interest in your company. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">In a recent study, marketers have analyzed many email marketing tools and realized that segmentation impacts your email marketing performance results. <\/span>\r\n<span style=\"font-weight: 400;\">Like,<\/span>\r\n<span style=\"font-weight: 400;\">In a study, MailChimp looked at the results of about 2,000 users who sent approximately 11,000 segmented campaigns to nearly 9 million recipients.<\/span>\r\n<span style=\"font-weight: 400;\">The results of the segmented campaigns were compared to the results of the same customers’ unsegmented campaigns, which demonstrated that email list segmentation:<\/span>\r\n<ul>\r\n \t<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Increased opens by 14.31%<\/span><\/li>\r\n \t<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Increased unique opens by 10.64%<\/span><\/li>\r\n \t<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Decreased bounces by 4.65%<\/span><\/li>\r\n \t<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Increased clicks by 100.95%<\/span><\/li>\r\n \t<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Decreased unsubscribes by 9.37%.<\/span><\/li>\r\n<\/ul>\r\n<span style=\"font-weight: 400;\">And what about the impact of segmentation on email-marketing revenue? Compared to sending one-size-fits-all email campaigns, the Direct Marketing Association found that segmentation increased email campaign revenue by 760%.<\/span>\r\n<span style=\"font-weight: 400;\">This is huge!<\/span>\r\n<span style=\"font-weight: 400;\">Well, that is all for this chapter. We hope the chapter has given you an idea what is email marketing list is all about and how it can help you gain more customers (of course ROI) in the simplest ways. <\/span>\r\nRead More&#8230;.\r\n<a class=\"btn btn-default\" title=\"Read more\" href=\"https:\/\/digiperform.com\/free-courses-email-marketing-course-how-to-get-started-with-email-marketing\/\" target=\"_blank\" rel=\"noopener\">Chapter 1<\/a><a class=\"next\" title=\"next\" href=\"https:\/\/digiperform.com\/free-courses-email-marketing-course-how-to-create-a-free-email-template-without-coding\/\" target=\"_blank\" rel=\"noopener\">Chapter 3<\/a>","protected":false},"excerpt":{"rendered":"In our first chapter of free online email marketing course, we have learned the basic of email marketing and the role of email marketing in business. In chapter 2, we are going to discuss what is a mailing list? What is the significance of the mailing list in online business? What are the best practices to create the mailing list and segment them for business purposes?\r\n","protected":false},"author":1,"featured_media":36527,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[325,111],"tags":[330,331,332],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v19.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Chapter 2: How to build an email marketing list from scratch? - Digiperform<\/title>\n<meta name=\"description\" content=\"A mailing list is a list of subscribers\/customers who are a part of periodic mailing distribution by the businesses.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/digiperform.com\/free-email-marketing-course-chapter-2-how-to-build-email-marketing-list\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Chapter 2: How to build an email marketing list from scratch? - Digiperform\" \/>\n<meta property=\"og:description\" content=\"A mailing list is a list of subscribers\/customers who are a part of periodic mailing distribution by the businesses.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/digiperform.com\/free-email-marketing-course-chapter-2-how-to-build-email-marketing-list\/\" \/>\n<meta property=\"og:site_name\" content=\"Digiperform\" \/>\n<meta property=\"article:published_time\" content=\"2018-07-20T11:04:45+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-03-24T09:53:23+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/digiperform.com\/wp-content\/uploads\/2018\/07\/Chapter-2.png\" \/>\n\t<meta property=\"og:image:width\" content=\"533\" \/>\n\t<meta property=\"og:image:height\" content=\"300\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"admin\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/digiperform.com\/#website\",\"url\":\"https:\/\/digiperform.com\/\",\"name\":\"Digiperform\",\"description\":\"Digital Marketing Training Institute\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/digiperform.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/digiperform.com\/free-email-marketing-course-chapter-2-how-to-build-email-marketing-list\/#primaryimage\",\"url\":\"https:\/\/digiperform.com\/wp-content\/uploads\/2018\/07\/Chapter-2.png\",\"contentUrl\":\"https:\/\/digiperform.com\/wp-content\/uploads\/2018\/07\/Chapter-2.png\",\"width\":533,\"height\":300},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/digiperform.com\/free-email-marketing-course-chapter-2-how-to-build-email-marketing-list\/#webpage\",\"url\":\"https:\/\/digiperform.com\/free-email-marketing-course-chapter-2-how-to-build-email-marketing-list\/\",\"name\":\"Chapter 2: How to build an email marketing list from scratch? - Digiperform\",\"isPartOf\":{\"@id\":\"https:\/\/digiperform.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/digiperform.com\/free-email-marketing-course-chapter-2-how-to-build-email-marketing-list\/#primaryimage\"},\"datePublished\":\"2018-07-20T11:04:45+00:00\",\"dateModified\":\"2022-03-24T09:53:23+00:00\",\"author\":{\"@id\":\"https:\/\/digiperform.com\/#\/schema\/person\/1420e87bcb82e48906cd5160911fcc1a\"},\"description\":\"A mailing list is a list of subscribers\/customers who are a part of periodic mailing distribution by the businesses.\",\"breadcrumb\":{\"@id\":\"https:\/\/digiperform.com\/free-email-marketing-course-chapter-2-how-to-build-email-marketing-list\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/digiperform.com\/free-email-marketing-course-chapter-2-how-to-build-email-marketing-list\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/digiperform.com\/free-email-marketing-course-chapter-2-how-to-build-email-marketing-list\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/digiperform.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Chapter 2: How to build an email marketing list from scratch?\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/digiperform.com\/#\/schema\/person\/1420e87bcb82e48906cd5160911fcc1a\",\"name\":\"admin\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/digiperform.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/b69047a5cc9f5694c48ca69f8b62a83b?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/b69047a5cc9f5694c48ca69f8b62a83b?s=96&d=mm&r=g\",\"caption\":\"admin\"},\"sameAs\":[\"https:\/\/digihero.in\/new\"],\"url\":\"https:\/\/digiperform.com\/author\/admin\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Chapter 2: How to build an email marketing list from scratch? - Digiperform","description":"A mailing list is a list of subscribers\/customers who are a part of periodic mailing distribution by the businesses.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/digiperform.com\/free-email-marketing-course-chapter-2-how-to-build-email-marketing-list\/","og_locale":"en_US","og_type":"article","og_title":"Chapter 2: How to build an email marketing list from scratch? - Digiperform","og_description":"A mailing list is a list of subscribers\/customers who are a part of periodic mailing distribution by the businesses.","og_url":"https:\/\/digiperform.com\/free-email-marketing-course-chapter-2-how-to-build-email-marketing-list\/","og_site_name":"Digiperform","article_published_time":"2018-07-20T11:04:45+00:00","article_modified_time":"2022-03-24T09:53:23+00:00","og_image":[{"width":533,"height":300,"url":"https:\/\/digiperform.com\/wp-content\/uploads\/2018\/07\/Chapter-2.png","type":"image\/png"}],"twitter_card":"summary_large_image","twitter_misc":{"Written by":"admin","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/digiperform.com\/#website","url":"https:\/\/digiperform.com\/","name":"Digiperform","description":"Digital Marketing Training Institute","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/digiperform.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/digiperform.com\/free-email-marketing-course-chapter-2-how-to-build-email-marketing-list\/#primaryimage","url":"https:\/\/digiperform.com\/wp-content\/uploads\/2018\/07\/Chapter-2.png","contentUrl":"https:\/\/digiperform.com\/wp-content\/uploads\/2018\/07\/Chapter-2.png","width":533,"height":300},{"@type":"WebPage","@id":"https:\/\/digiperform.com\/free-email-marketing-course-chapter-2-how-to-build-email-marketing-list\/#webpage","url":"https:\/\/digiperform.com\/free-email-marketing-course-chapter-2-how-to-build-email-marketing-list\/","name":"Chapter 2: How to build an email marketing list from scratch? - Digiperform","isPartOf":{"@id":"https:\/\/digiperform.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/digiperform.com\/free-email-marketing-course-chapter-2-how-to-build-email-marketing-list\/#primaryimage"},"datePublished":"2018-07-20T11:04:45+00:00","dateModified":"2022-03-24T09:53:23+00:00","author":{"@id":"https:\/\/digiperform.com\/#\/schema\/person\/1420e87bcb82e48906cd5160911fcc1a"},"description":"A mailing list is a list of subscribers\/customers who are a part of periodic mailing distribution by the businesses.","breadcrumb":{"@id":"https:\/\/digiperform.com\/free-email-marketing-course-chapter-2-how-to-build-email-marketing-list\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/digiperform.com\/free-email-marketing-course-chapter-2-how-to-build-email-marketing-list\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/digiperform.com\/free-email-marketing-course-chapter-2-how-to-build-email-marketing-list\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/digiperform.com\/"},{"@type":"ListItem","position":2,"name":"Chapter 2: How to build an email marketing list from scratch?"}]},{"@type":"Person","@id":"https:\/\/digiperform.com\/#\/schema\/person\/1420e87bcb82e48906cd5160911fcc1a","name":"admin","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/digiperform.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/b69047a5cc9f5694c48ca69f8b62a83b?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/b69047a5cc9f5694c48ca69f8b62a83b?s=96&d=mm&r=g","caption":"admin"},"sameAs":["https:\/\/digihero.in\/new"],"url":"https:\/\/digiperform.com\/author\/admin\/"}]}},"_links":{"self":[{"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/posts\/17534"}],"collection":[{"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/comments?post=17534"}],"version-history":[{"count":3,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/posts\/17534\/revisions"}],"predecessor-version":[{"id":37305,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/posts\/17534\/revisions\/37305"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/media\/36527"}],"wp:attachment":[{"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/media?parent=17534"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/categories?post=17534"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/tags?post=17534"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}