{"id":18304,"date":"2018-08-24T18:09:31","date_gmt":"2018-08-24T18:09:31","guid":{"rendered":"https:\/\/digiperform.in\/backup\/?p=18304"},"modified":"2022-03-31T09:12:57","modified_gmt":"2022-03-31T09:12:57","slug":"free-email-marketing-course-chapter-12-most-frequently-email-marketing-questions-asked-by-marketers","status":"publish","type":"post","link":"https:\/\/digiperform.com\/free-email-marketing-course-chapter-12-most-frequently-email-marketing-questions-asked-by-marketers\/","title":{"rendered":"Chapter 12 &#8211; Most frequently email marketing questions asked by marketers"},"content":{"rendered":"<strong>Hello Readers!<\/strong>\r\n\r\n<span style=\"font-weight: 400;\">Welcome to the last chapter of our <a href=\"https:\/\/digiperform.com\/free-courses-email-marketing-course-beginners-guide-to-email-marketing\/\" target=\"_blank\" rel=\"noopener\">free email marketing course<\/a> where we will be sharing the common set of email marketing questions asked by the marketers. <\/span>\r\n<span style=\"font-weight: 400;\">These questions can be your doubts or questions asked during your interview to test your knowledge. In either way, this chapter will be helpful to you to understand the concept.<\/span>\r\n<span style=\"font-weight: 400;\">Here we go!<\/span>\r\n<img loading=\"lazy\" class=\"wp-image-18310 aligncenter\" src=\"https:\/\/digiperform.com\/wp-content\/uploads\/2018\/08\/question-mark-370x350.png\" alt=\"\" width=\"225\" height=\"213\" \/>\r\n<h4><span style=\"color: #993300;\"><strong>Q: What’s the point of email marketing (In short, what is email marketing)?<\/strong><\/span><\/h4>\r\n<span style=\"font-weight: 400;\">Email marketing is the effective medium of online marketing to reach out to people at once in order to encourage them to do business with you. The business can be in any form; like purchasing your product or service, download the ebook, visiting your blogs\/website, etc. <\/span>\r\n<span style=\"font-weight: 400;\">The end goal of any email marketing strategy leads to sales, conversion, web traffic, etc executed in a way that leads their subscribers to willingly complete the desired action. This approach builds audience trust through emails that are valuable and entertaining for the reader, thus increasing the sender’s credibility and getting that sender closer to their desired goal.<\/span>\r\n<span style=\"font-weight: 400;\">Read More…&#8230;<\/span>\r\n<h4><span style=\"color: #993300;\"><strong>Q: How do I grow my email subscriber list?<\/strong><\/span><\/h4>\r\n<span style=\"font-weight: 400;\">Email marketing strategy is nothing if you don’t have a good email list or mailing list. An email marketing list is a list of subscribers\/customers who are a part of periodic mailing distribution by the businesses. Your email list should include past, current and potential customers, friends, family and past coworkers. <\/span>\r\n<span style=\"font-weight: 400;\">It is not easy to create valid and responsive mailing list just like that. It requires regular efforts and marketing strategy. <\/span>\r\n<span style=\"font-weight: 400;\">Learn how to build an email marketing list from scratch?<\/span>\r\n<a class=\"btn btn-default\" title=\"Read More\" href=\"https:\/\/digiperform.com\/free-courses-email-marketing-course-how-to-get-started-with-email-marketing\/\" target=\"_blank\" rel=\"noopener\">Read More<\/a>\r\n\r\n<span style=\"font-weight: 400;\">Also, <a href=\"https:\/\/blog.hubspot.com\/blog\/tabid\/6307\/bid\/32028\/25-clever-ways-to-grow-your-email-marketing-list.aspx\" target=\"_blank\" rel=\"noopener\">29 Simple Ways to Grow Your Email List<\/a><\/span>\r\n<a class=\"btn btn-default\" title=\"Read More\" href=\"https:\/\/blog.hubspot.com\/blog\/tabid\/6307\/bid\/32028\/25-clever-ways-to-grow-your-email-marketing-list.aspx\" target=\"_blank\" rel=\"noopener\">Read More<\/a>\r\n<h4><span style=\"color: #993300;\"><strong>Q: How do I figure out what to write about?<\/strong><\/span><\/h4>\r\n<span style=\"font-weight: 400;\">Good content is the sword of any marketing strategy. If you are not writing as per your audience interest, you will lose your chance to gain subscribers as well as potential buyers. The email should contain the valid information about your product or services but in a short &amp; crisp way. <\/span>\r\n<span style=\"font-weight: 400;\">It should be tied to the short subject line that contains the agenda of your email. Find out what your readers are looking for, learn about their habits &#8211; hobbies &#8211; patterns and try to provide them the resolution for the same. There are many email marketing analytics tools that can help you to understand the behavior pattern of your subscribers\/visitors. Make sure that what you write is serving their interests, not your own agenda.<\/span>\r\n<h4><span style=\"color: #993300;\"><strong>Q: What are the best practices for email subject lines?<\/strong><\/span><\/h4>\r\n<span style=\"font-weight: 400;\">Email subject lines play a major role in deciding whether the email will get clicked or not. You get only 3-4 seconds before your reader decides to open the email or not. Best practice is to personalize your subject line and share what is the email all about. <\/span>\r\n<span style=\"font-weight: 400;\">Also, 30-50 characters are considered as good and safe to follow. However, people have seen great success with subject lines over 70 characters and less than 49, so feel free to experiment. All you should follow to design short, specific and compelling subject lines. <\/span>\r\n<span style=\"font-weight: 400;\">For an example, you can read <a href=\"https:\/\/digiperform.com\/15-amazing-email-subject-lines-youll-probably-want-to-click\/\" target=\"_blank\" rel=\"noopener\">15 Amazing Email Subject Lines You’ll Probably Want To Click<\/a><\/span>\r\n<a class=\"btn btn-default\" title=\"Subject Lines\" href=\"https:\/\/digiperform.com\/15-amazing-email-subject-lines-youll-probably-want-to-click\/\" target=\"_blank\" rel=\"noopener\">Subject Lines<\/a>\r\n<h4><span style=\"color: #993300;\"><strong> Q: Where does an email newsletter fit into email marketing?<\/strong><\/span><\/h4>\r\n<span style=\"font-weight: 400;\">The newsletter is one of the types of emails which is usually an email on one topic promoting a piece of content, products or services. Email newsletters may also feature ads or special offers, but they&#8217;re usually not prominently featured.<\/span>\r\n<span style=\"font-weight: 400;\">A generic email of your email campaign can eve be considered as a newsletter. Most people think they need an email newsletter, but often your email marketing program will be more effective for building your business if you send really specific content tailored to your marketing strategy. <\/span>\r\n<h4><span style=\"color: #993300;\"><strong>Q: What are the laws of email marketing?<\/strong><\/span><\/h4>\r\n<span style=\"font-weight: 400;\">An email marketing law such as CAN-SPAM never approves phishing as well as the purchased mailing list. Any ideal marketer is never approved of buying lists because there are laws in place to protect people from receiving certain types of unsolicited communications. <\/span>\r\n<span style=\"font-weight: 400;\">Readout complete guide to the <a href=\"https:\/\/www.ftc.gov\/tips-advice\/business-center\/guidance\/can-spam-act-compliance-guide-business\" target=\"_blank\" rel=\"noopener\">laws of email marketing<\/a>.<\/span>\r\n<a class=\"btn btn-default\" title=\"Email Laws\" href=\"https:\/\/www.ftc.gov\/tips-advice\/business-center\/guidance\/can-spam-act-compliance-guide-business\" target=\"_blank\" rel=\"noopener\">Email Laws<\/a>\r\n<h4><\/h4>\r\n<h4><span style=\"color: #993300;\"><strong>Q: What’s the best time and day to send emails?<\/strong><\/span><\/h4>\r\n<span style=\"font-weight: 400;\">This is the most debatable question of all times &#8211; When to send emails? Ask as many people you can, you will get different answers. Even many trusted brands and resources have different opinions like:<\/span>\r\n<span style=\"font-weight: 400;\">Kissmetrics says early mornings and weekends … but also says those days\/times are also the most likely to get you unsubscribes and bounces.<\/span>\r\n<span style=\"font-weight: 400;\">Experian’s benchmark study says that 8 p.m. to midnight is optimal.<\/span>\r\n<span style=\"font-weight: 400;\">Wordstream thinks that Thursday from 8-9 a.m. is best.<\/span>\r\n<span style=\"font-weight: 400;\">MailChimp says that Tuesdays, Wednesdays, and Thursdays between 2 p.m. and 5 p.m. are the surefire winners.<\/span>\r\n<h4><span style=\"color: #993300;\"><strong>Q: Email deliverability and email open rates: what do these mean?<\/strong><\/span><\/h4>\r\n<span style=\"font-weight: 400;\">These are two important email marketing metrics that decide the success of your email marketing campaign. <\/span>\r\n<span style=\"font-weight: 400;\">Email deliverability rate is the success rate of your email marketing campaign where getting an email delivered to a person’s email address is measured. For same, all you need is to take the number of emails delivered and divide it by the number that was sent.<\/span>\r\n<span style=\"font-weight: 400;\">Whereas, an email open rate is the percentage emails opened that have ended up in the inboxes. These metrics have an important impact on how your email marketing campaign performs. If someone doesn’t open your email, they never even have the chance to engage with your content.<\/span>\r\n<h4><span style=\"color: #993300;\"><strong>Q: What’s a good email open rate?<\/strong><\/span><\/h4>\r\n<span style=\"font-weight: 400;\">There is no definite answer to this question. Every business or campaign has their own requirements. Statistically speaking, Silverpop’s email benchmark study revealed that across 3,000 companies in 40 different countries, the average open rate was 20.2 percent. <\/span>\r\n<span style=\"font-weight: 400;\">Typically if you’re getting 15-25 percent email open rates, you’re up to industry standards. Over 30 percent and you’re nailing it.<\/span>\r\n<h4><span style=\"color: #993300;\"><strong>Q: What other metrics should you track for email marketing?<\/strong><\/span><\/h4>\r\n<span style=\"font-weight: 400;\">Apart from email deliverability and open rate, there are many other metrics that marketer should measure for larger goals whether its B2B or B2C campaign.  <\/span>\r\n<span style=\"font-weight: 400;\">However, there are four other foundational metrics that you should measure in order to get high email deliverability:<\/span>\r\n<span style=\"font-weight: 400;\"><strong>Inbox Rates:<\/strong> which determines how many delivered emails actually made it into someone’s inbox (rather than their junk folder).<\/span>\r\n<span style=\"font-weight: 400;\"><strong>Bounce Rates:<\/strong> It is the percentage of emails that were rejected by recipients’ mail servers.<\/span>\r\n<span style=\"font-weight: 400;\"><strong>Spam Reports:<\/strong> It depicts how many times your emails were marked as junk mail\/spam by recipients.<\/span>\r\n<span style=\"font-weight: 400;\"><strong>Unsubscribes:<\/strong> states how many people unsubscribed from your emails.<\/span>\r\n<h4><span style=\"color: #993300;\"><strong>Q: What are the best ways to encourage opt-in?<\/strong><\/span><\/h4>\r\n<span style=\"font-weight: 400;\">I recommend brainstorming alternative techniques for capturing email addresses. Map out all the opportunities available for capturing a buyer’s information between your different channels and audience segments (shown in the matrix below) and use this to generate new ideas. Take a look at what you and competitors are currently doing and then do a ‘gap analysis’ to select options you aren’t currently using.<\/span>\r\n<span style=\"font-weight: 400;\">￼<\/span>\r\n<h4><span style=\"color: #993300;\"><strong>Q: Should I be using pop-ups? What about the quality of the people from pop-ups?<\/strong><\/span><\/h4>\r\n<span style=\"font-weight: 400;\">Pop-ups are increasingly being used in many industry sectors, particularly retail, publishing, and travel. This is because, when well-defined and tested, they will almost always give you significantly more new contacts in your database. <\/span>\r\n<span style=\"font-weight: 400;\">If you use pop-ups to boost your subscriber numbers, it’s inevitable that there may be some decline in quality as not every subscriber is ready to allow and make changes in their settings. Some subscribers are not even aware of the benefits as well.  <\/span>\r\n<span style=\"font-weight: 400;\">To maintain the quality, it’s important to be able to profile visitors efficiently. Also, follow the best practices to be sensitive to the user experience and don’t display a pop-up too quickly. <\/span>\r\n<h4><span style=\"color: #993300;\"><strong>Q: How much do I need to profile subscribers?<\/strong><\/span><\/h4>\r\n<span style=\"font-weight: 400;\">Asking too much information can be turned off for subscribers. Try to ask the limited but important question to subscribers that are important for enabling your business to send more relevant emails. For example, in Digiperform, we ask Name, Contact Number, Email, and City, so that we can discuss the course as per the location and send the necessary details as well.<\/span>\r\n<h4><span style=\"color: #993300;\"><strong>Q: Where can I begin to improve email targeting?<\/strong><\/span><\/h4>\r\n<span style=\"font-weight: 400;\">Ideally, you need to begin with these basic techniques to achieve the best results from your email marketing campaign:<\/span>\r\n<ul>\r\n \t<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Try A\/B testing, also known as Split testing, where you create two version of your campaign with slight changes and record the success rate. Learn more about A\/B testing &#8211; <a href=\"https:\/\/digiperform.com\/free-courses-email-marketing-course-how-to-use-a-b-tests-to-improve-your-email-campaigns\/\" target=\"_blank\" rel=\"noopener\">How to use A\/B tests to improve your email campaigns<\/a>?<\/span><\/li>\r\n \t<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Creating two (or more) alternative versions of your standard newsletter. For example, if you are a lifestyle writer, then you can create the separate newsletter for men clothing and women clothing. And, then send according to gender segmented list.<\/span><\/li>\r\n \t<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Changing your welcome email content to be relevant for different audience segments.<\/span><\/li>\r\n \t<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Sending post-purchase emails to promote similar products or related products in different categories (cross-sell and upsell).<\/span><\/li>\r\n<\/ul>\r\n<span style=\"font-weight: 400;\">You can also manage these things with automation where you can send Welcome or Thank you emails whenever any subscribers start following your services. Automation is very quick and efficient way to handle your email marketing campaigns.<\/span>\r\nYou can learn <a href=\"https:\/\/digiperform.com\/free-courses-email-marketing-course-how-to-get-started-with-email-marketing-automation\/\" target=\"_blank\" rel=\"noopener\">How to get started with Email Marketing Automation<\/a>?\r\n<a class=\"btn btn-default\" title=\"Read More\" href=\"https:\/\/digiperform.com\/free-courses-email-marketing-course-how-to-get-started-with-email-marketing-automation\/\" target=\"_blank\" rel=\"noopener\">Read More<\/a>\r\n<h4><span style=\"font-weight: 400; color: #993300;\"><strong>Q: Should I buy a list just to kick off my email marketing?<\/strong> <\/span><\/h4>\r\n<span style=\"font-weight: 400;\">The answer is Big <strong>NO<\/strong>. <\/span>\r\n<span style=\"font-weight: 400;\">You should never be buying lists. This is totally against Email Marketing Laws. Even you will buy these subscribers list and people opted into those lists, they didn&#8217;t opt in to hear from you. This means when they get an email from you, they&#8217;ll not just be less likely to open or click on it because they don&#8217;t know you. Then you will be marked as <strong>SPAM<\/strong>.<\/span>\r\n<span style=\"font-weight: 400;\">You could also be mucking up your deliverability score by buying lists, which will affect the success of your email marketing long term. And these are just a few of the dangers of buying a list.<\/span>\r\n<h4><span style=\"color: #993300;\"><strong>Q: How do I make sure I don&#8217;t land in the spam folder?<\/strong><\/span><\/h4>\r\n<span style=\"font-weight: 400;\">The biggest thing you can do to stay out of the spam folder is not to buy subscribers’ list. Earn the genuine subscribers with your efforts. <\/span>\r\n<span style=\"font-weight: 400;\">You should also follow best practices like identifying who you are in your sender name, making unsubscription easy, segmenting your lists and tailoring your content to those segments, cleansing your lists, and not bombarding your recipients&#8217; inboxes with too much email.<\/span>\r\n<h4><span style=\"color: #993300;\"><strong>Q: What&#8217;s the difference between a hard and a soft bounce?<\/strong><\/span><\/h4>\r\n<span style=\"font-weight: 400;\">When an email bounces, it means that your email couldn’t deliver in recipient&#8217;s email address. <\/span>\r\n<span style=\"font-weight: 400;\">A hard bounce means that it is failed to deliver due to major reasons such as fake, blocked or invalid email address. Whereas, in soft bounce, the email is failed to deliver to temporary issues such as a full mailbox or an unavailable service.<\/span>\r\n<span style=\"font-weight: 400;\">To keep your list healthy, make sure you&#8217;re removing all hard bounces and keeping an eye on the soft bounce addresses. <\/span>\r\n<span style=\"font-weight: 400;\">By not cleansing your list, you may end up hurting your other emails&#8217; deliverability. <\/span>\r\n<h4><span style=\"color: #993300;\"><strong>Q: How do I prevent people from unsubscribing from my emails?<\/strong><\/span><\/h4>\r\n<span style=\"font-weight: 400;\">If you don&#8217;t want to break the law, you should never prevent someone from unsubscribing from your emails. CAN-SPAM, one of the most important laws you need to follow as a marketer, says that email marketers should always make it easy for people to unsubscribe from their emails by providing a clearly visible link in every email message and honoring those unsubscribes in a timely manner.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">These are the list of few questions that can help you to understand the process. Let us know in the comment section if you have any question related to email marketing campaigns. We will definitely try our best to answer them. <\/span>\r\n<a class=\"btn btn-default\" title=\"Chapter 11\" href=\"https:\/\/digiperform.com\/free-courses-email-marketing-course-email-marketing-terms-every-marketer-should-know\/\" target=\"_blank\" rel=\"noopener\">Chapter 11<\/a>","protected":false},"excerpt":{"rendered":"Welcome to the last chapter of our free email marketing course where we will be sharing the common set of email marketing questions asked by the marketers.","protected":false},"author":1,"featured_media":37266,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[325,111],"tags":[350],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v19.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Chapter 12 - Most frequently email marketing questions asked by marketers - Digiperform<\/title>\n<meta name=\"description\" content=\"Welcome to the last chapter of our free email marketing course where we will be sharing the common set of email marketing questions asked by the marketers.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/digiperform.com\/free-email-marketing-course-chapter-12-most-frequently-email-marketing-questions-asked-by-marketers\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Chapter 12 - Most frequently email marketing questions asked by marketers - Digiperform\" \/>\n<meta property=\"og:description\" content=\"Welcome to the last chapter of our free email marketing course where we will be sharing the common set of email marketing questions asked by the marketers.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/digiperform.com\/free-email-marketing-course-chapter-12-most-frequently-email-marketing-questions-asked-by-marketers\/\" \/>\n<meta property=\"og:site_name\" content=\"Digiperform\" \/>\n<meta property=\"article:published_time\" content=\"2018-08-24T18:09:31+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-03-31T09:12:57+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/digiperform.com\/wp-content\/uploads\/2018\/08\/2.png\" \/>\n\t<meta property=\"og:image:width\" content=\"533\" \/>\n\t<meta property=\"og:image:height\" content=\"300\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"admin\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/digiperform.com\/#website\",\"url\":\"https:\/\/digiperform.com\/\",\"name\":\"Digiperform\",\"description\":\"Digital Marketing Training Institute\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/digiperform.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/digiperform.com\/free-email-marketing-course-chapter-12-most-frequently-email-marketing-questions-asked-by-marketers\/#primaryimage\",\"url\":\"https:\/\/digiperform.com\/wp-content\/uploads\/2018\/08\/2.png\",\"contentUrl\":\"https:\/\/digiperform.com\/wp-content\/uploads\/2018\/08\/2.png\",\"width\":533,\"height\":300,\"caption\":\"email marketing\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/digiperform.com\/free-email-marketing-course-chapter-12-most-frequently-email-marketing-questions-asked-by-marketers\/#webpage\",\"url\":\"https:\/\/digiperform.com\/free-email-marketing-course-chapter-12-most-frequently-email-marketing-questions-asked-by-marketers\/\",\"name\":\"Chapter 12 - Most frequently email marketing questions asked by marketers - Digiperform\",\"isPartOf\":{\"@id\":\"https:\/\/digiperform.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/digiperform.com\/free-email-marketing-course-chapter-12-most-frequently-email-marketing-questions-asked-by-marketers\/#primaryimage\"},\"datePublished\":\"2018-08-24T18:09:31+00:00\",\"dateModified\":\"2022-03-31T09:12:57+00:00\",\"author\":{\"@id\":\"https:\/\/digiperform.com\/#\/schema\/person\/1420e87bcb82e48906cd5160911fcc1a\"},\"description\":\"Welcome to the last chapter of our free email marketing course where we will be sharing the common set of email marketing questions asked by the marketers.\",\"breadcrumb\":{\"@id\":\"https:\/\/digiperform.com\/free-email-marketing-course-chapter-12-most-frequently-email-marketing-questions-asked-by-marketers\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/digiperform.com\/free-email-marketing-course-chapter-12-most-frequently-email-marketing-questions-asked-by-marketers\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/digiperform.com\/free-email-marketing-course-chapter-12-most-frequently-email-marketing-questions-asked-by-marketers\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/digiperform.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Chapter 12 &#8211; Most frequently email marketing questions asked by marketers\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/digiperform.com\/#\/schema\/person\/1420e87bcb82e48906cd5160911fcc1a\",\"name\":\"admin\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/digiperform.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/b69047a5cc9f5694c48ca69f8b62a83b?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/b69047a5cc9f5694c48ca69f8b62a83b?s=96&d=mm&r=g\",\"caption\":\"admin\"},\"sameAs\":[\"https:\/\/digihero.in\/new\"],\"url\":\"https:\/\/digiperform.com\/author\/admin\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Chapter 12 - Most frequently email marketing questions asked by marketers - Digiperform","description":"Welcome to the last chapter of our free email marketing course where we will be sharing the common set of email marketing questions asked by the marketers.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/digiperform.com\/free-email-marketing-course-chapter-12-most-frequently-email-marketing-questions-asked-by-marketers\/","og_locale":"en_US","og_type":"article","og_title":"Chapter 12 - Most frequently email marketing questions asked by marketers - Digiperform","og_description":"Welcome to the last chapter of our free email marketing course where we will be sharing the common set of email marketing questions asked by the marketers.","og_url":"https:\/\/digiperform.com\/free-email-marketing-course-chapter-12-most-frequently-email-marketing-questions-asked-by-marketers\/","og_site_name":"Digiperform","article_published_time":"2018-08-24T18:09:31+00:00","article_modified_time":"2022-03-31T09:12:57+00:00","og_image":[{"width":533,"height":300,"url":"https:\/\/digiperform.com\/wp-content\/uploads\/2018\/08\/2.png","type":"image\/png"}],"twitter_card":"summary_large_image","twitter_misc":{"Written by":"admin","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/digiperform.com\/#website","url":"https:\/\/digiperform.com\/","name":"Digiperform","description":"Digital Marketing Training Institute","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/digiperform.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/digiperform.com\/free-email-marketing-course-chapter-12-most-frequently-email-marketing-questions-asked-by-marketers\/#primaryimage","url":"https:\/\/digiperform.com\/wp-content\/uploads\/2018\/08\/2.png","contentUrl":"https:\/\/digiperform.com\/wp-content\/uploads\/2018\/08\/2.png","width":533,"height":300,"caption":"email marketing"},{"@type":"WebPage","@id":"https:\/\/digiperform.com\/free-email-marketing-course-chapter-12-most-frequently-email-marketing-questions-asked-by-marketers\/#webpage","url":"https:\/\/digiperform.com\/free-email-marketing-course-chapter-12-most-frequently-email-marketing-questions-asked-by-marketers\/","name":"Chapter 12 - Most frequently email marketing questions asked by marketers - Digiperform","isPartOf":{"@id":"https:\/\/digiperform.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/digiperform.com\/free-email-marketing-course-chapter-12-most-frequently-email-marketing-questions-asked-by-marketers\/#primaryimage"},"datePublished":"2018-08-24T18:09:31+00:00","dateModified":"2022-03-31T09:12:57+00:00","author":{"@id":"https:\/\/digiperform.com\/#\/schema\/person\/1420e87bcb82e48906cd5160911fcc1a"},"description":"Welcome to the last chapter of our free email marketing course where we will be sharing the common set of email marketing questions asked by the marketers.","breadcrumb":{"@id":"https:\/\/digiperform.com\/free-email-marketing-course-chapter-12-most-frequently-email-marketing-questions-asked-by-marketers\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/digiperform.com\/free-email-marketing-course-chapter-12-most-frequently-email-marketing-questions-asked-by-marketers\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/digiperform.com\/free-email-marketing-course-chapter-12-most-frequently-email-marketing-questions-asked-by-marketers\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/digiperform.com\/"},{"@type":"ListItem","position":2,"name":"Chapter 12 &#8211; Most frequently email marketing questions asked by marketers"}]},{"@type":"Person","@id":"https:\/\/digiperform.com\/#\/schema\/person\/1420e87bcb82e48906cd5160911fcc1a","name":"admin","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/digiperform.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/b69047a5cc9f5694c48ca69f8b62a83b?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/b69047a5cc9f5694c48ca69f8b62a83b?s=96&d=mm&r=g","caption":"admin"},"sameAs":["https:\/\/digihero.in\/new"],"url":"https:\/\/digiperform.com\/author\/admin\/"}]}},"_links":{"self":[{"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/posts\/18304"}],"collection":[{"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/comments?post=18304"}],"version-history":[{"count":3,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/posts\/18304\/revisions"}],"predecessor-version":[{"id":38398,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/posts\/18304\/revisions\/38398"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/media\/37266"}],"wp:attachment":[{"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/media?parent=18304"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/categories?post=18304"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/tags?post=18304"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}