{"id":22392,"date":"2019-06-22T08:07:48","date_gmt":"2019-06-22T08:07:48","guid":{"rendered":"https:\/\/digiperform.in\/backup\/?p=22392"},"modified":"2022-03-31T12:30:31","modified_gmt":"2022-03-31T12:30:31","slug":"interview-session-with-founder-digital-marketing-agency-mumbai-riddhi-chhabria","status":"publish","type":"post","link":"https:\/\/digiperform.com\/interview-session-with-founder-digital-marketing-agency-mumbai-riddhi-chhabria\/","title":{"rendered":"The right marketing strategy can add sparks &#038; shimmer to generate buzz, attract and convert the audience. &#8211; Riddhi Chhabria"},"content":{"rendered":"<strong>&#8220;Whenever you see a successful business, someone once made a courageous decision.&#8221; &#8211; Anonymous<\/strong>\r\nIt is well said that successful businesses are made on courageous decisions. And, we have come across an ambitious woman entrepreneur whose decisions have led her to taste the success in a very short span of time.\r\nIn <a href=\"https:\/\/digiperform.com\/digitalks\/\" target=\"_blank\" rel=\"noopener noreferrer\">DigiTalks by Digiperform<\/a>, Meet <a href=\"https:\/\/www.linkedin.com\/in\/riddhi-chhabria-54b48812a\/\" target=\"_blank\" rel=\"noopener noreferrer\">Riddhi Chhabria<\/a>, a go-getter entrepreneur, risk taker, traveler, dog lover, leader, friend and so on. A woman with so many roles. Her journey is full of wow experiences, treasures, and of course hard work.\r\nCurrently, she is a proud founder of a digital marketing agency in Mumbai &#8211; <a href=\"https:\/\/allstarsdigital.in\/\" target=\"_blank\" rel=\"noopener noreferrer\"><strong>All Stars Digital<\/strong><\/a>.\r\nDigiperform always encourages those who dream to aim high, believe in their will &amp; skill to bring out the best version of themselves.\r\nSo, we decided to get in touch with her personally and ask her journey from a graduate girl to India&#8217;s one of the Upcoming Leading Women Entrepreneur.\r\nHave a look and we hope her life and experiences will help others to motivate and feel confident in their abilities.\r\n&nbsp;\r\n<h4><b>Digiperform- Hi Riddhi Chhabria. Briefly share about yourself, your hobbies, likes or dislikes, previous experiences…..etc. in your words.<\/b><\/h4>\r\n<b>Riddhi: <\/b><span style=\"font-weight: 400;\">Hey, <\/span>\r\n<span style=\"font-weight: 400;\">First, I’d like to thank you for giving us this opportunity. The entire team of All Stars Digital is thrilled and grateful. <\/span>\r\n<span style=\"font-weight: 400;\">Let’s start with my professional life first, by the way, I&#8217;ve got a lot to say, so just loosen up and grab coffee…. 😀<\/span>\r\n<span style=\"font-weight: 400;\">Immediately after I completed my Computer engineering from Thadomal Shahani Engineering College, Mumbai, I worked at Viacom18’s Voot in their brand management sector. <\/span>\r\n<span style=\"font-weight: 400;\">During the time, everything was about branding, from the basic color-scheme, logo placement understanding to Brand Reputation and Visibility which intrigued me. <\/span>\r\n<span style=\"font-weight: 400;\">I felt like marketing and more specifically Brand Management is my calling. That is when I decided to pursue my further studies in this line. I managed to receive an admit from New York University &#8211; School of Professional Studies for Masters in Integrated Marketing. Lucky Me 🙂<\/span>\r\n<span style=\"font-weight: 400;\">From the very first day, I had concluded that I’ll specialize in Brand Management, but not everything goes as per planned. It felt like my life had some other plans.  <\/span>\r\n<h4><em><strong>How did I start working?<\/strong><\/em><\/h4>\r\n<span style=\"font-weight: 400;\">My first internship in the USA was at <\/span><a href=\"https:\/\/www.newyorkminutemag.com\/\" target=\"_blank\" rel=\"noopener noreferrer\"><b><i>New York Minute Magazine<\/i><\/b><\/a><span style=\"font-weight: 400;\">, my role was to monitor and optimize the analytics using all Social Media platforms. <\/span>\r\n<span style=\"font-weight: 400;\">After which, I returned to India for my Summer break and worked at <\/span><a href=\"https:\/\/www.republicworld.com\/\" target=\"_blank\" rel=\"noopener noreferrer\"><b>Republic TV <\/b><\/a><span style=\"font-weight: 400;\">for 4 months. I contributed towards their digital launch and solely oversaw their youtube page, here I learned the importance of monetization of social media platforms. <\/span>\r\n<span style=\"font-weight: 400;\">Because of my past 3 experiences, I got my first job in the States. It started the moment I returned for my third semester. Tier One Advertising Agency (T1), I joined as a part-time Marketing Associate and after 6 months I was promoted to Operations Manager. Coordinating with all the clients, handling social media platforms, SEO (Website and App stores) were a few of my duties at T1. <\/span>\r\n<span style=\"font-weight: 400;\">I was lucky to have had a chance of working directly with <\/span><b>Akon’s team<\/b><span style=\"font-weight: 400;\"> to launch his app <\/span><b>Emojikon<\/b><span style=\"font-weight: 400;\"> and managing social media accounts of many models including a few <\/span><b>Victoria’s Secret Angels<\/b><span style=\"font-weight: 400;\">.<\/span>\r\n<a href=\"https:\/\/digiperform.com\/wp-content\/uploads\/2019\/06\/emojikon.jpg\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\"><img loading=\"lazy\" class=\"wp-image-22400 aligncenter\" src=\"https:\/\/digiperform.com\/wp-content\/uploads\/2019\/06\/emojikon.jpg\" alt=\"emojikon\" width=\"411\" height=\"411\" \/><\/span><\/a>\r\n<span style=\"font-weight: 400;\">I simultaneously freelanced for a few other companies and learned as much as I can about <a href=\"https:\/\/digiperform.com\/digital-marketing-guide-marketing-todays-digital-world\/\" target=\"_blank\" rel=\"noopener noreferrer\">Digital Marketing<\/a>. My counselor at NYU was pleased with my work experience and said that I have earned extra credits and I qualify for a double specialization. <\/span>\r\n<span style=\"font-weight: 400;\">I graduated with a Master’s degree and a double specialization in Brand Management and Digital Marketing. After working at T1 for more than a year, my father Mr. Nagesh Chhabria recommended considering starting my own agency back in India. It was a great idea. Why not use my expertise in my own country. And, it clicked!<\/span>\r\n<span style=\"font-weight: 400;\">With the support of my family I founded my agency, after interviewing more than 100 people, my ideal team was hired and now we proudly call ourselves <\/span><b>All Stars Digital<\/b><span style=\"font-weight: 400;\">. <\/span>\r\n<h4><span style=\"color: #993300;\"><b>My Hobbies<\/b><\/span><span style=\"font-weight: 400;\"><span style=\"color: #993300;\">:<\/span> <\/span><\/h4>\r\n<span style=\"font-weight: 400;\">I love traveling, I have visited 4\/7 continents. Rest is on my travel list. 😀<\/span>\r\n<span style=\"font-weight: 400;\">I am a Bollywood fan and I love reading books of thriller and fiction genre. <\/span>\r\n<span style=\"font-weight: 400;\">An absolute dog lover, my family is currently the home for 2 dogs namely Euro (Shih Tzu) and Yen (Labrador).<\/span>\r\n&nbsp;\r\n<h4><b>Digiperform<\/b><b>&#8211; Please tell us about All-Stars Digital. Also, share the foundation of the company? How it got started?<\/b><\/h4>\r\n<b>Riddhi: <\/b><span style=\"font-weight: 400;\">Honestly speaking,<\/span> <span style=\"font-weight: 400;\">I wanted to start my own Influencer marketing agency in Mumbai. I strongly believe that any influencer on Instagram with just a thousand followers; or a mega Bollywood star followed by millions have the power to influence an audience into buying any product\/service. <\/span>\r\n<i><span style=\"font-weight: 400;\">The catch is it needs the right push. And that’s where we come into the picture! <\/span><\/i>\r\n<span style=\"font-weight: 400;\">Later, I decided that we won’t just restrain to only influencer marketing but use every digital marketing service to influence the audience with their purchase decisions. <\/span>\r\n<span style=\"font-weight: 400;\">All Stars Digital is the shine that adds sparks &amp; shimmer needed to generate buzz, attract and convert the audience from being a mere follower to a consumer, using everything the digital space has to offer.<\/span>\r\n<a href=\"https:\/\/allstarsdigital.in\/\" target=\"_blank\" rel=\"noopener noreferrer\"><img loading=\"lazy\" class=\"wp-image-22401 aligncenter\" src=\"https:\/\/digiperform.com\/wp-content\/uploads\/2019\/06\/ASD-Logo.png\" alt=\"all stars digital\" width=\"370\" height=\"188\" \/><\/a>\r\n<h4><b>Digiperform<\/b><b> &#8211; You have shared the profiles of your team on your website. No doubt, you have an amazing team. Please tell something about your team? Also, we are very much interested to know more about your company’s mascot Euro? 😀<\/b><\/h4>\r\n<b>Riddhi: <\/b><span style=\"font-weight: 400;\">After interviewing around 150-200 people I found my dream team. Though, some have discontinued working with us because they had to explore other opportunities, and I completely understand that. <\/span>\r\n<span style=\"font-weight: 400;\">One of them started his own company and returned as a client but all the others who stayed have been loyal and constantly working hard to achieve our goals. <\/span>\r\n<span style=\"font-weight: 400;\">You can say, I have been lucky to have a great team whether they have stayed with me or not. 😀<\/span>\r\n<span style=\"font-weight: 400;\">We are a proud team, filled with millennials all wanting the same thing I do, find some quirk and show it in our work.<\/span>\r\n<span style=\"font-weight: 400;\"><img loading=\"lazy\" class=\"wp-image-22397 aligncenter\" src=\"https:\/\/digiperform.com\/wp-content\/uploads\/2019\/06\/Team.jpeg\" alt=\"\" width=\"591\" height=\"669\" \/><\/span>\r\n<span style=\"font-weight: 400;\">They all are working here because at the end of the day, everyone has to contribute with campaign ideas for each of the clients, whether they are in the Social media team, Marketing team, Search engine marketing, design team or are solely invested in content writing. <\/span>\r\n<span style=\"font-weight: 400;\">Each person at All Stars Digital wants to test their creative side and contribute and make our brands shine. With all the running around and the constant pressure to think out of the box, not all days are happy and easy. <\/span>\r\n<span style=\"font-weight: 400;\">That’s where Euro comes in the picture, our company’s mascot. I like to assume that he’s our stress buster, he visits us almost daily and showers everyone with love.<\/span>\r\n<img loading=\"lazy\" class=\"wp-image-22394 aligncenter\" src=\"https:\/\/digiperform.com\/wp-content\/uploads\/2019\/06\/Euro.jpeg\" alt=\"Euro- Mascot\" width=\"440\" height=\"505\" \/>\r\n&nbsp;\r\n<h4><b>Digiperform<\/b><b>&#8211; Knowing your high professional activity, how do you combine your agenda to fulfill the tasks as a marketer, consultant, and entrepreneur?<\/b><\/h4>\r\n<b>Riddhi: <\/b><span style=\"font-weight: 400;\">The first misconception of starting a company, in any field, is that one can do what they like. More than doing it’s like monitoring, encouraging others to do it. <\/span>\r\n<span style=\"font-weight: 400;\">Honestly, most part of my day goes in monitoring everyone’s work, building a rapport with every team member, trying my best to help them implement what I imagine. Phewww!<\/span>\r\n<span style=\"font-weight: 400;\">At times, they provide exactly what I am looking for and the rest of the times, they surpass my imagination. <\/span>\r\n<span style=\"font-weight: 400;\">As an entrepreneur I have learned, I have to do a little of everything, from balancing between finance to surveying new hires like an HR, from monitoring all content to contributing with campaigns, and primarily dealing with people be it my team members or clients. <\/span>\r\n<span style=\"font-weight: 400;\">We have been lucky to have clients from different genres, our campaign meetings are undoubtedly the time we all look most forward to. <\/span>\r\n<span style=\"font-weight: 400;\">Brainstorming ideas, listening to some really good concepts and understanding how different people with different backgrounds can come up with strategies to promote the same product is the best part of what I do. <\/span>\r\n<span style=\"font-weight: 400;\">This is when I feel like a marketer. I think, that 1 of my best decisions has been making it a compulsion for everyone to contribute to campaigns. <\/span>\r\n<span style=\"font-weight: 400;\">I have been blessed with opportunities in a way that I have had some experience in every field of digital marketing, in the start it was helpful for me and now I am in a position to share it with my friends, team members, and clients. <\/span>\r\n<span style=\"font-weight: 400;\">Till today people don’t understand which service of digital marketing is going to help them better reach their goals. Consulting people on how they should allocate their funds, and why a particular service fits best for them has been a norm of my entrepreneurial life. <\/span>\r\n<span style=\"font-weight: 400;\">Consulting also includes a lot of strategies developing. We came across a client who hired us for 3 months only to consult her, give her strategies a direction, suggest her ways on how to grow and later she signed us for the implementation. <\/span>\r\n<span style=\"font-weight: 400;\">I think of myself as a marketer, wearing entrepreneurial shoes and paving the path as a consultant, always on the lookout to fill potholes with the rocks of progression. <\/span>\r\n&nbsp;\r\n<h4><b>Digiperform<\/b><b>&#8211; What makes All Stars Digital &#8211; the Best Digital Marketing Agency in Mumbai?<\/b><\/h4>\r\n<b>Riddhi: <\/b><span style=\"font-weight: 400;\">We are an agency that looks at everything differently, gives solutions differently and makes marketing easier &#8211; Differently!<\/span>\r\n<span style=\"font-weight: 400;\">We are an agency that provides quick and quirky digital marketing solutions that help brands shine. We are All Stars Digital. <\/span>\r\n<span style=\"font-weight: 400;\">Whatever we do we do it with passion. Yes, there are many like us. But every employee has the same vigor and vision that I have. Be the one-stop solution for everything digital. <\/span>\r\n<span style=\"font-weight: 400;\">With the digital space changing every nanosecond, it is difficult for brands to keep up with the digital hemisphere. We make sure that’s checked off for our brands. We are available, ready and game to anything digital.<\/span>\r\n<span style=\"font-weight: 400;\">This industry brings along a fair amount of challenges but it somehow drives all of us. We work for our brands and that’s why we work even harder when they bring different challenges on our plate.<\/span>\r\n&nbsp;\r\n<h4><b>Digiperform<\/b><span style=\"font-weight: 400;\">&#8211; <\/span><b>How do you see digital marketing evolving in the future? What are the top three trends do you foresee for the coming year 2019?<\/b><\/h4>\r\n<b>Riddhi: <\/b><span style=\"font-weight: 400;\">There are a lot of theories when it comes to the future of social media but in our opinion, <\/span><span style=\"font-weight: 400;\">\r\n<\/span>\r\n<span style=\"font-weight: 400;\">The landscape is dynamic and unpredictable. <\/span>\r\n<span style=\"font-weight: 400;\">The truth is that social media is constantly evolving, which is what makes it a very exciting field to work in.<\/span>\r\n<span style=\"font-weight: 400;\">It is an industry that constantly keeps you on your toes and forces you to be creative. This helps us grow as individuals making us nurture our creative spark as well as move with the fast-growing, changing trends. <\/span>\r\n<span style=\"font-weight: 400;\">This industry cannot be confined to one part of the spectrum and is going to constantly evolve and grow.<\/span>\r\n&nbsp;\r\n<h4><span style=\"color: #000000;\"><b>Three Trends for the year 2019<\/b><\/span><\/h4>\r\n<span style=\"font-weight: 400;\">Competition is fierce and consumers are unpredictable, which makes you brainstorm new marketing ways to persuade people to buy your products and services. <\/span>\r\n<span style=\"font-weight: 400;\">There are different methods such as engaging web content, PPC campaigns, blogs, social media and videos still common and popular among entrepreneurs, but these sources are not enough if you want to create competition in the market. <\/span>\r\n<span style=\"font-weight: 400;\">Technology trends are evolving as fast as anything and therefore you have to stay abreast of them. There are many digital marketing trends that will drastically change your digital business in 2019.<\/span>\r\n&nbsp;\r\n<h4><span style=\"color: #993300;\"><b>Voice search for higher CTR<\/b><\/span><\/h4>\r\n<span style=\"font-weight: 400;\">According to experts, 3 billion searches made on Google every day are voice searches. <\/span>\r\n<span style=\"font-weight: 400;\">Amazon Alexa and Apple Siri have recently been introduced that identify human speech and answer queries. When you type a query in the search bar, you get lots of search results and therefore chances are the customer will lose sight of your website. <\/span>\r\n<span style=\"font-weight: 400;\">However, when a customer uses a natural-language user interface, for instance, Siri, it’ll give you a few results and therefore your CTR can be much higher if your website is amongst those results. So make your search phrases more conversational.<\/span>\r\n&nbsp;\r\n<span style=\"color: #993300;\"><b>Chatbot for personalized customer services<\/b><\/span>\r\n<span style=\"font-weight: 400;\">Communication with customers is now easier with chatbot while keeping a lid on your budget. It can be integrated with a website, social media and an application, and interactive agents can receive queries and give data related answers. You can use user queries and information to make a further customized marketing strategy.<\/span>\r\n&nbsp;\r\n<span style=\"color: #993300;\"><b>Video marketing to grab more audience<\/b><\/span>\r\n<span style=\"font-weight: 400;\">Videos are expected to continue to rise because the majority of customers watch videos than reading blogs. If you want to draw the attention of your customers to your new launch, make an engaging video detailing about the product and spread it on all social media platforms including your website. Find the best way to incorporate video marketing into your strategy.<\/span>\r\n&nbsp;\r\n<span style=\"color: #993300;\"><b>Programmatic Advertising<\/b><\/span>\r\n<span style=\"font-weight: 400;\">Programmatic advertising involves the use of automation technology to buy and sell digital media. Its benefits far outweigh traditional advertising benefits. <\/span>\r\n<span style=\"font-weight: 400;\">The automation can help you buy advertising space more efficiently and target advertisers’ most valuable customers. You can access any amount of your audience, analyze data and get a real picture of how effective your ad is, which will further help you develop a more effective ad campaign.<\/span>\r\n&nbsp;\r\n<h4><b>Digiperform<\/b><b>&#8211; What are your future plans? <\/b><\/h4>\r\n<b>Riddhi: <\/b><span style=\"font-weight: 400;\">We are looking to have 4 branches in different cities of India by 2020 and expand internationally by 2025. <\/span>\r\n<span style=\"font-weight: 400;\">Currently, we cater to only digital marketing needs but by 2020 we want to be a 1 stop shop for all marketing. We want to be an agency that covers 360<\/span><span style=\"font-weight: 400;\">o  <\/span><span style=\"font-weight: 400;\">marketing for a brand which includes TV, Radio, News Paper, PR, Hoardings and of course digital marketing. <\/span>\r\n<span style=\"font-weight: 400;\">It’s an ambitious journey, surely difficult but with my team’s support, I’m confident it is achievable. 😀<\/span>\r\n&nbsp;\r\n<h4><b>Digiperform<\/b><b>&#8211; Tell us something about the projects you have been doing or completed so far? <\/b><\/h4>\r\n<b>Riddhi: <\/b><span style=\"font-weight: 400;\">When it comes to working with different brands and sectors, we did not restrict our associations to one particular sector or industry (Beggars can&#8217;t be choosers). <\/span>\r\n<span style=\"font-weight: 400;\">Our aim was to be involved with all kinds of businesses be it B2B or B2C. Digital Marketing is relevant to all. Initially, we began to work with small companies and start-ups and now we can proudly say that we have worked\/working with 60 clients. <\/span>\r\n<span style=\"font-weight: 400;\">Our retainership is fairly strong and our relationships with our clients have been transparent and fruitful to both of us.<\/span>\r\n&nbsp;\r\n<h4><span style=\"color: #993300;\"><b>Some of the brands we are currently working with are:<\/b><\/span><\/h4>\r\n<b>F&amp;B Sector <\/b>\r\n<span style=\"font-weight: 400;\">House of Thanos <\/span>\r\n<span style=\"font-weight: 400;\">Fast Food Factory<\/span>\r\n<span style=\"font-weight: 400;\">Trumpet Sky Lounge, etc. <\/span>\r\n&nbsp;\r\n<b>Fashion<\/b>\r\n<span style=\"font-weight: 400;\">D7 &#8211; a store that displays\/sell the work of renowned designers like (Gavin Miguel, Ranna Gill, AMPM, Namratha Joshipura, Pankaj Nidhi)<\/span>\r\n<span style=\"font-weight: 400;\">Rhua<\/span>\r\n&nbsp;\r\n<b>Apps<\/b>\r\n<span style=\"font-weight: 400;\">Whats The Scene App<\/span>\r\n<span style=\"font-weight: 400;\">CoValue<\/span>\r\n&nbsp;\r\n<b>Educational\/Institutes<\/b>\r\n<span style=\"font-weight: 400;\">Livewire Media Institute <\/span>\r\n<span style=\"font-weight: 400;\">Act and Express (Early Child Education School) <\/span>\r\n&nbsp;\r\n<b>Event companies<\/b>\r\n<span style=\"font-weight: 400;\">The Event co. <\/span>\r\n<span style=\"font-weight: 400;\">Fox Events.<\/span>\r\n&nbsp;\r\n<b>Nutritionist<\/b>\r\n<span style=\"font-weight: 400;\">Eat Right by Kamna Bandhari <\/span>\r\n<span style=\"font-weight: 400;\">And Fitness Nutritionist Sushmita Thadani.<\/span>\r\n&nbsp;\r\n<b>Others<\/b>\r\n<span style=\"font-weight: 400;\">The Wedding Trunk &amp; The Wedding Trunk Store.<\/span>\r\n<span style=\"font-weight: 400;\">Asmita Organic farms <\/span>\r\n<span style=\"font-weight: 400;\">Provo eyewear <\/span>\r\n<span style=\"font-weight: 400;\">Yellow Tie Hospitality<\/span>\r\n<span style=\"font-weight: 400;\">Finfort <\/span>\r\n&nbsp;\r\n<span style=\"font-weight: 400;\">We have worked with more than 60 companies in the last 10 months, I tried listing a few from each category, we have also worked with fitness resorts, dairies, recreational clubs, beauticians, Doctors, hospitals, salons, spas, e-commerce platforms, hair coloring products, career counselors, etc. <\/span>\r\n<i><span style=\"font-weight: 400;\">On Mother’s day, we stepped out of our comfort zone and helped plan and market a wine and cheese event at D7, with live music, special offers on each brand for all the lovely moms out there.<\/span><\/i>\r\n&nbsp;\r\n<h4><b>Digiperform<\/b><b>&#8211; According to you, what are the various ingredients for a successful digital marketer and business?<\/b><\/h4>\r\n<b>Riddhi: <\/b><span style=\"font-weight: 400;\">Ingredients, if looking, are very simple and basic. They apply to every company or institution. <\/span>\r\n<b>Knowledge<\/b><span style=\"font-weight: 400;\">: Knowing what you&#8217;re doing <\/span>\r\n<b>Skills\/Tools<\/b><span style=\"font-weight: 400;\">: In this day and age it&#8217;s very important to have the right tools and skills to make things work out for yourself and your client.<\/span>\r\n<b>Will<\/b><span style=\"font-weight: 400;\">: All my employees have one common goal and that pushes their will to put everything aside and keep the clients happy. Focus and will trickle down like a grapevine. It begins from the top management.   <\/span>\r\n<span style=\"font-weight: 400;\">Most importantly, <\/span><b>Creativity<\/b>\r\n<span style=\"font-weight: 400;\">There are so many of us out there. What makes us stand out is the creativity. We make sure that our content is different, engaging and digitally viable for the audiences. <\/span>\r\n<span style=\"font-weight: 400;\">Last but not least<\/span>\r\n<b>Keeping it simple: <\/b><span style=\"font-weight: 400;\">Be straight to your audience and your clients. There&#8217;s a paradigm shift. We see it amongst us as well. The consumer is smarter than ever. They know what&#8217;s happening. It&#8217;s always better to be straightforward then be called flakey!<\/span>\r\n&nbsp;\r\n<h4><b>Digiperform<\/b><b>&#8211; Any suggestion you would like to give to our readers and students?<\/b><\/h4>\r\n<b>Riddhi: <\/b><span style=\"font-weight: 400;\">In my experience, it’s not necessary that you make your career in the same field you did your education in. Your Skill plays a major role in your career than a degree.<\/span>\r\n<span style=\"font-weight: 400;\">That’s the motto of Digiperform too, <strong>#SKILLOVERDEGREE<\/strong><\/span>\r\n<span style=\"font-weight: 400;\">As an engineer, I dreamt of securing a job in one of the big tech companies. While working for college fests and extracurricular activities, I found myself invested in marketing. <\/span>\r\n<span style=\"font-weight: 400;\">While working at Viacom18, I wanted a career in brand management, but I kept getting jobs in different sectors of digital marketing. <\/span>\r\n<span style=\"font-weight: 400;\">Now, I’m here running an agency where digital marketing is the least of my worries and everything else that comes in with running a company like finance, sales, hiring and managing people, understanding the clients’ needs. <\/span>\r\n<span style=\"font-weight: 400;\">I’m confident a year from now I’ll be heading towards different, learning something new. And that’s the best motivator. Knowing that you’re walking towards progression. <\/span>\r\n<span style=\"font-weight: 400;\">Everyone wants a job to either make money or to gain experience to get something better, but the people who try out new lines or working to learn more, to be better and with the urge to progress are the true winners. <\/span>\r\n<span style=\"font-weight: 400;\">In today’s world, it is of utmost importance to be a jack of all trades, else you’ll lag and watch everyone overtake you. <\/span>\r\n<span style=\"font-weight: 400;\">And All Stars Digital is a growing company, we are always looking for new, talented and efficient youngsters, feel free to drop in your CVs at <\/span><b>info@allstarsdigital.in<\/b><span style=\"font-weight: 400;\">.<\/span>\r\n&nbsp;\r\n<h4><b>Digiperform:<\/b><\/h4>\r\n<span style=\"font-weight: 400;\">Wow! Riddhi. It feels like you have had an amazing journey so far professionally. And, we are 100% believe that All Stars Digital will become one of the top digital marketing agencies of the World. <\/span>\r\n<span style=\"font-weight: 400;\">Thanks for extending a helping hand for our trainees and readers. Definitely, our trainees would love to be part of such a marvelous team. And we personally would love to meet Euro &#8211; The Cutest Stress Buster, for some day, sure. <\/span>\r\n&nbsp;\r\n<h4><strong>Follow All Stars Digital at:<\/strong><\/h4>\r\n<b>Facebook &#8211; <\/b><a href=\"https:\/\/www.facebook.com\/allstarsdigital\/\"><span style=\"font-weight: 400;\">https:\/\/www.facebook.com\/allstarsdigital\/<\/span><\/a>\r\n<b>Twitter      &#8211; <\/b><a href=\"https:\/\/twitter.com\/AllStarsDigi\"><span style=\"font-weight: 400;\">https:\/\/twitter.com\/AllStarsDigi<\/span><\/a>\r\n<b>Instagram &#8211; <\/b><a href=\"https:\/\/www.instagram.com\/allstarsdigital\/\"><span style=\"font-weight: 400;\">https:\/\/www.instagram.com\/allstarsdigital\/<\/span><\/a>\r\n<b>Linkedin &#8211; <\/b><a href=\"https:\/\/www.linkedin.com\/company\/allstarsdigital\/\"><span style=\"font-weight: 400;\">https:\/\/www.linkedin.com\/company\/allstarsdigital\/<\/span><\/a>\r\n<b>Pinterest  &#8211; <\/b><a href=\"https:\/\/in.pinterest.com\/Allstarsdigi\/\"><span style=\"font-weight: 400;\">https:\/\/in.pinterest.com\/Allstarsdigi\/<\/span><\/a>\r\n&nbsp;","protected":false},"excerpt":{"rendered":"In DigiTalks by Digiperform, Meet Riddhi Chhabria, founder of digital marketing agency in Mumbai, a go-getter entrepreneur, risk taker, traveler, dog lover, leader, friend and so on. Her journey is full of wow experiences, treasures, and of course hard work.","protected":false},"author":1,"featured_media":22393,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[132],"tags":[479,389,480],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v19.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>The right marketing strategy can add sparks &amp; shimmer to generate buzz, attract and convert the audience. - Riddhi Chhabria - Digiperform<\/title>\n<meta name=\"description\" content=\"In DigiTalks by Digiperform, Riddhi Chhabria, from Mumbai, founder of digital marketing agency in Mumbai, All Stars Digital.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/digiperform.com\/interview-session-with-founder-digital-marketing-agency-mumbai-riddhi-chhabria\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"The right marketing strategy can add sparks &amp; shimmer to generate buzz, attract and convert the audience. - Riddhi Chhabria - Digiperform\" \/>\n<meta property=\"og:description\" content=\"In DigiTalks by Digiperform, Riddhi Chhabria, from Mumbai, founder of digital marketing agency in Mumbai, All Stars Digital.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/digiperform.com\/interview-session-with-founder-digital-marketing-agency-mumbai-riddhi-chhabria\/\" \/>\n<meta property=\"og:site_name\" content=\"Digiperform\" \/>\n<meta property=\"article:published_time\" content=\"2019-06-22T08:07:48+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-03-31T12:30:31+00:00\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"admin\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"16 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/digiperform.com\/#website\",\"url\":\"https:\/\/digiperform.com\/\",\"name\":\"Digiperform\",\"description\":\"Digital Marketing Training Institute\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/digiperform.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/digiperform.com\/interview-session-with-founder-digital-marketing-agency-mumbai-riddhi-chhabria\/#primaryimage\",\"url\":\"\",\"contentUrl\":\"\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/digiperform.com\/interview-session-with-founder-digital-marketing-agency-mumbai-riddhi-chhabria\/#webpage\",\"url\":\"https:\/\/digiperform.com\/interview-session-with-founder-digital-marketing-agency-mumbai-riddhi-chhabria\/\",\"name\":\"The right marketing strategy can add sparks & shimmer to generate buzz, attract and convert the audience. - Riddhi Chhabria - Digiperform\",\"isPartOf\":{\"@id\":\"https:\/\/digiperform.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/digiperform.com\/interview-session-with-founder-digital-marketing-agency-mumbai-riddhi-chhabria\/#primaryimage\"},\"datePublished\":\"2019-06-22T08:07:48+00:00\",\"dateModified\":\"2022-03-31T12:30:31+00:00\",\"author\":{\"@id\":\"https:\/\/digiperform.com\/#\/schema\/person\/1420e87bcb82e48906cd5160911fcc1a\"},\"description\":\"In DigiTalks by Digiperform, Riddhi Chhabria, from Mumbai, founder of digital marketing agency in Mumbai, All Stars Digital.\",\"breadcrumb\":{\"@id\":\"https:\/\/digiperform.com\/interview-session-with-founder-digital-marketing-agency-mumbai-riddhi-chhabria\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/digiperform.com\/interview-session-with-founder-digital-marketing-agency-mumbai-riddhi-chhabria\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/digiperform.com\/interview-session-with-founder-digital-marketing-agency-mumbai-riddhi-chhabria\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/digiperform.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"The right marketing strategy can add sparks &#038; shimmer to generate buzz, attract and convert the audience. &#8211; Riddhi Chhabria\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/digiperform.com\/#\/schema\/person\/1420e87bcb82e48906cd5160911fcc1a\",\"name\":\"admin\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/digiperform.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/b69047a5cc9f5694c48ca69f8b62a83b?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/b69047a5cc9f5694c48ca69f8b62a83b?s=96&d=mm&r=g\",\"caption\":\"admin\"},\"sameAs\":[\"https:\/\/digihero.in\/new\"],\"url\":\"https:\/\/digiperform.com\/author\/admin\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"The right marketing strategy can add sparks & shimmer to generate buzz, attract and convert the audience. - Riddhi Chhabria - Digiperform","description":"In DigiTalks by Digiperform, Riddhi Chhabria, from Mumbai, founder of digital marketing agency in Mumbai, All Stars Digital.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/digiperform.com\/interview-session-with-founder-digital-marketing-agency-mumbai-riddhi-chhabria\/","og_locale":"en_US","og_type":"article","og_title":"The right marketing strategy can add sparks & shimmer to generate buzz, attract and convert the audience. - Riddhi Chhabria - Digiperform","og_description":"In DigiTalks by Digiperform, Riddhi Chhabria, from Mumbai, founder of digital marketing agency in Mumbai, All Stars Digital.","og_url":"https:\/\/digiperform.com\/interview-session-with-founder-digital-marketing-agency-mumbai-riddhi-chhabria\/","og_site_name":"Digiperform","article_published_time":"2019-06-22T08:07:48+00:00","article_modified_time":"2022-03-31T12:30:31+00:00","twitter_card":"summary_large_image","twitter_misc":{"Written by":"admin","Est. reading time":"16 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/digiperform.com\/#website","url":"https:\/\/digiperform.com\/","name":"Digiperform","description":"Digital Marketing Training Institute","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/digiperform.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/digiperform.com\/interview-session-with-founder-digital-marketing-agency-mumbai-riddhi-chhabria\/#primaryimage","url":"","contentUrl":""},{"@type":"WebPage","@id":"https:\/\/digiperform.com\/interview-session-with-founder-digital-marketing-agency-mumbai-riddhi-chhabria\/#webpage","url":"https:\/\/digiperform.com\/interview-session-with-founder-digital-marketing-agency-mumbai-riddhi-chhabria\/","name":"The right marketing strategy can add sparks & shimmer to generate buzz, attract and convert the audience. - Riddhi Chhabria - Digiperform","isPartOf":{"@id":"https:\/\/digiperform.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/digiperform.com\/interview-session-with-founder-digital-marketing-agency-mumbai-riddhi-chhabria\/#primaryimage"},"datePublished":"2019-06-22T08:07:48+00:00","dateModified":"2022-03-31T12:30:31+00:00","author":{"@id":"https:\/\/digiperform.com\/#\/schema\/person\/1420e87bcb82e48906cd5160911fcc1a"},"description":"In DigiTalks by Digiperform, Riddhi Chhabria, from Mumbai, founder of digital marketing agency in Mumbai, All Stars Digital.","breadcrumb":{"@id":"https:\/\/digiperform.com\/interview-session-with-founder-digital-marketing-agency-mumbai-riddhi-chhabria\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/digiperform.com\/interview-session-with-founder-digital-marketing-agency-mumbai-riddhi-chhabria\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/digiperform.com\/interview-session-with-founder-digital-marketing-agency-mumbai-riddhi-chhabria\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/digiperform.com\/"},{"@type":"ListItem","position":2,"name":"The right marketing strategy can add sparks &#038; shimmer to generate buzz, attract and convert the audience. &#8211; Riddhi Chhabria"}]},{"@type":"Person","@id":"https:\/\/digiperform.com\/#\/schema\/person\/1420e87bcb82e48906cd5160911fcc1a","name":"admin","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/digiperform.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/b69047a5cc9f5694c48ca69f8b62a83b?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/b69047a5cc9f5694c48ca69f8b62a83b?s=96&d=mm&r=g","caption":"admin"},"sameAs":["https:\/\/digihero.in\/new"],"url":"https:\/\/digiperform.com\/author\/admin\/"}]}},"_links":{"self":[{"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/posts\/22392"}],"collection":[{"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/comments?post=22392"}],"version-history":[{"count":2,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/posts\/22392\/revisions"}],"predecessor-version":[{"id":38618,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/posts\/22392\/revisions\/38618"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/digiperform.com\/wp-json\/"}],"wp:attachment":[{"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/media?parent=22392"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/categories?post=22392"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/tags?post=22392"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}