{"id":23787,"date":"2019-08-17T08:58:29","date_gmt":"2019-08-17T08:58:29","guid":{"rendered":"https:\/\/digiperform.in\/backup\/?p=23787"},"modified":"2022-03-31T19:06:41","modified_gmt":"2022-03-31T19:06:41","slug":"interview-with-atman-rathod-founder-of-cmarix","status":"publish","type":"post","link":"https:\/\/digiperform.com\/interview-with-atman-rathod-founder-of-cmarix\/","title":{"rendered":"An Interview with the Founder of Cmarix &#8211; Atman Rathod"},"content":{"rendered":"<em><strong>Entrepreneurship is neither a science nor an art. It&#8217;s Practice. &#8211; Anonymous<\/strong><\/em>\r\nThis has been well accompanied by one of the entrepreneurs of Ahmedabad, Atman Rathod.\r\n<a href=\"https:\/\/www.linkedin.com\/in\/rathodatman\/\" target=\"_blank\" rel=\"noopener noreferrer\">Atman Rathod<\/a> is the Director &amp; Co-founder of <a href=\"https:\/\/www.cmarix.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">CMARIX <\/a><span style=\"font-weight: 400;\">Technolabs Pvt. Ltd. which is a <\/span>process technology company based out from Ahmedabad, India. They are leading technology disruption with clients across 46 countries globally. They are a premium technology outsourcing company with in house team of 115+ engineers and provide turnkey solutions in terms of all your technology needs.\r\n<a href=\"https:\/\/digiperform.com\/wp-content\/uploads\/2019\/08\/atman-rathod.jpeg\" target=\"_blank\" rel=\"noopener noreferrer\"><img loading=\"lazy\" class=\" wp-image-23802 aligncenter\" src=\"https:\/\/digiperform.com\/wp-content\/uploads\/2019\/08\/atman-rathod.jpeg\" alt=\"atman rathod\" width=\"357\" height=\"357\" \/><\/a>\r\nIn our industry speak section, <strong>DigiTalks By Digiperform<\/strong>, we decided to get in touch with him personally and ask for his journey from college students to Digital Entrepreneur.\r\nHave a look and we hope his life and experiences will help others to motivate and feel confident in their abilities.\r\n<h4><strong>Digiperform: Hi Atman Rathod! How are you? Briefly share about yourself, your hobbies, likes or dislikes, previous experiences…..etc. and your professional life as well, in your words.<\/strong><\/h4>\r\n<span style=\"font-weight: 400;\"><strong>Atman:<\/strong> Hello Digiperform team, Thank you for this opportunity. <\/span>\r\n<span style=\"font-weight: 400;\">What keeps me going is the constant love for learning new things, reading in regards to different subjects from physics to Metaphysics or from business to economics. <\/span>\r\n<span style=\"font-weight: 400;\">Other than that, nature, exercising and an endeavor to improve me at every moment makes my journey more interesting. <\/span>\r\n<span style=\"font-weight: 400;\">Back in 2002, during my college life, I came across a book “<em><strong>You Can Win<\/strong><\/em>” <em><strong>by Shiv Khera<\/strong><\/em>, which was the first book that sparked something and made me feel that I realize the potential hidden within me for outstanding personal and professional growth. <\/span>\r\n<span style=\"font-weight: 400;\">It brought me out from the common perception people have today “<em>life is a merger of two phases i.e. personal and professional&#8221;<\/em>. However, I believe we have one life and we have only one to live it. So, no matter who we are – we are at work and at home. <\/span>\r\n<span style=\"font-weight: 400;\">The last decade, brought to me a plethora of experience while reading more than 300+ books including top authors like Anthony Robbins, Brian Tracy, Osho, Sadguru, Robert Kiyosaki, Leo Tolstoy, Robin Sharma, Zig Ziglar, Lao Tzu, Confucius, Robert Green and many more. <\/span>\r\n<span style=\"font-weight: 400;\">Life becomes beautiful when you pick up things, absorb and implement it. This is the power of learning and growing. I see myself as a student of life and go about living it in the most holistic way as I can.  <\/span>\r\n<h4><strong>Digiperform: Kindly share about CMARIX TechnoLabs Pvt. Ltd. Also, briefly share the core foundation of CMARIX and its amazing team. <\/strong><\/h4>\r\n<span style=\"font-weight: 400;\"><strong>Atman:<\/strong> The essential idea of getting CMARIX Technolabs Pvt. Ltd. company into existence was to build a company whose core foundation is known for its client-centric, employee-centric culture and an optimistic attitude. <\/span><span style=\"font-weight: 400;\">We have developed a result-driven work culture while constantly enhancing better technology delivery standards of India. <\/span>\r\n<span style=\"font-weight: 400;\">We see ourselves in the top 25% league of companies who have expertise in our business domain. Not because of the number of employees or the total turnover, but the actual thing that matters is the work culture of the company, passion, benchmark, and vision. <\/span>\r\n<span style=\"font-weight: 400;\">I learned early in my career that organizational culture is the most important and non-tangible part of any organization. It can build or break the company. We have a great culture here at CMARIX which is the core essence of our success and we take active steps to constantly enrich it. <\/span>\r\n<span style=\"font-weight: 400;\">We are among the very few companies who have 80% of the manpower with more than 4+ years of experience. The kind of projects which we work for is not a cup of tea for non-technical or a fresher. <\/span>\r\n<span style=\"font-weight: 400;\">Our core strength, i.e. our team comprises of technology experts, domain experts, SCRUM masters, Design-led engineers, Digital marketing professionals and several other work profiles that together form a resilient &amp; one-stop solution team. <\/span>\r\n<span style=\"font-weight: 400;\">It is a pride in acknowledging the fact that we have one of the smallest sales team when referred to any IT company in Gujarat. The core reason behind this is, we are a complete development-centric company. <\/span>\r\n<span style=\"font-weight: 400;\">The work speaks and probably that is why they stay with us for long. We ensure we do whatever it takes to add tremendous value and not only provide service delivery but to transform their business. <\/span>\r\n<span style=\"font-weight: 400;\">This is the key reason that motivated us to start this company and the core essence of our success mantra. <\/span>\r\n<h4><strong>Digiperform: What is your typical day out as a passionate Director, Investor, and Startup consultant and of course a loving father?<\/strong><\/h4>\r\n<span style=\"font-weight: 400;\"><strong>Atman:<\/strong> Nice question. This is often something I ask during the interviews as I believe this is the best way to know a person. <\/span>\r\n<span style=\"font-weight: 400;\">My day starts with the gym and hitting the office right after. I prefer micro-managing the execution as much as I can as it helps me build great leadership within the company. <\/span>\r\n<span style=\"font-weight: 400;\">We have quick standup SCRUM meetings with various department heads which includes Development Delivery, Design, Marketing, HR, Sales, Accounts, and Operations. <\/span>\r\n<span style=\"font-weight: 400;\">Once the management aspect is taken care I use the afternoon hours to do meetings with our global partners as well as providing consultation to my enterprise clients. <\/span>\r\n<span style=\"font-weight: 400;\">I use late afternoon to improve “processes” and “people” as they are the two core elements of this organization. My late evenings are spent taking reporting of the planned work to ensure its completion and smooth execution. <\/span>\r\n<span style=\"font-weight: 400;\">I have always motivated a team to complete days’ work in given time of 8 working hours. To us, if someone is sitting in the office late in the evening it means they haven’t skillfully completed the work in the given time and need improvement. <\/span>\r\n<span style=\"font-weight: 400;\">We never encourage “staying late in office” to be interpreted as “working hard”. We believe in smart work and I want everyone associated with us to have a good work-life balance. It’s very important for person and professional time. <\/span>\r\n<span style=\"font-weight: 400;\">Moreover, another interesting thing is, I have got a house in the same building as my office which saves me the need to buy a car. I can just walk to the office in 3 min. I think I am saving around 1 hour of traveling time during the workday which I can spend playing with my 3-year-old kid when I reach home in the late evening. <\/span>\r\n<span style=\"font-weight: 400;\">And, I believe it’s very important to give time to kids as they are building blocks of the nation and it is our core responsibility on how we are raising our kids as they drive the result in the next generation &amp; one who will take charge of our great country – India.  <\/span>\r\n<a href=\"https:\/\/digiperform.com\/wp-content\/uploads\/2019\/08\/cmarix.jpg\" target=\"_blank\" rel=\"noopener noreferrer\"><img loading=\"lazy\" class=\"wp-image-23804 aligncenter\" src=\"https:\/\/digiperform.com\/wp-content\/uploads\/2019\/08\/cmarix.jpg\" alt=\"cmarix office\" width=\"624\" height=\"416\" \/><\/a>\r\n<h4><strong>Digiperform: Your expertise involves working with customers across 80+ countries globally and providing services of Enterprise custom software, Website design &amp; development as well as Mobile Application Development (as per LinkedIn). Our readers would like to know more about the journey.<\/strong><\/h4>\r\n<span style=\"font-weight: 400;\"><strong>Atman:<\/strong> After doing my engineering in Information Technology from Saurashtra University I went to London to pursue my further studies which included a certificate in business management and Master of Science in Management from Middlesex University, London, Hendon Campus. <\/span>\r\n<span style=\"font-weight: 400;\">After I finished my masters, I worked in London for a few years. I believe it was a very important part of my experience as I had the opportunity to study, work and live with people from across the globe. <\/span>\r\n<span style=\"font-weight: 400;\">I understood the service delivery perception of people in the west and how we can adjust the cultural difference to bring people on the same ground and ensure a win-win relationship between different stakeholders. <\/span>\r\n<span style=\"font-weight: 400;\">And, I have traveled personally to over 22 countries across the globe and providing technology services to startups, SMEs, Enterprise and Fortune 100 companies. <\/span>\r\n<span style=\"font-weight: 400;\">Right now we have different clients across the globe and often I speak and work with clients in the remote island who are looking for technology solutions. <\/span>\r\n<span style=\"font-weight: 400;\">We have had more changes in the last 20 years on how things are implemented virtually, every aspect of life as compared to the last 500 year in human history. <\/span>\r\n<span style=\"font-weight: 400;\">This is the most exciting time in the world to live in and I am very grateful to be one of the essential contributing parts of this changing ecosystem<\/span><span style=\"font-weight: 400;\">. <\/span>\r\n<h4><strong>Digiperform: You company had been ranked among top 3 Best Software Development Companies of Gujarat State by Gujarat Electronics and Software Industries Association (GESIA). What makes CMARIX the best of all?<\/strong><\/h4>\r\n<span style=\"font-weight: 400;\"><strong>Atman:<\/strong> The answer is in operations. Right from how we take interviews, select the right people. Get them into the right processes to work on the type of projects which we want to work on and bring about the result which amazes our customers, thereby providing the work environment, compensation, and other benefits to our team. <\/span>\r\n<span style=\"font-weight: 400;\">Our selection criteria are never solely based on the technical skillset of people. We always look for that raw material with good fundamentals and passion for learning and bringing results. <\/span>\r\n<span style=\"font-weight: 400;\">Where, we give them necessary mentors, training, work environment and everything else that is required to bring the right results. <\/span>\r\n<span style=\"font-weight: 400;\">We love our employees and our customers and as a Management our job is to ensure there is a very positive cycle of value delivery between them to generate tremendous results and outstanding performance. <\/span>\r\n<a href=\"https:\/\/digiperform.com\/wp-content\/uploads\/2019\/08\/Screenshot-2019-08-17-at-2.22.56-PM.png\" target=\"_blank\" rel=\"noopener noreferrer\"><img loading=\"lazy\" class=\"alignnone size-full wp-image-23803\" src=\"https:\/\/digiperform.com\/wp-content\/uploads\/2019\/08\/Screenshot-2019-08-17-at-2.22.56-PM.png\" alt=\"Team of Cmarix\" width=\"1352\" height=\"621\" \/><\/a>\r\n<h4><strong>Digiperform: Do you believe that Technology and Online Marketing can go hand-in-hand? If yes, how do you see technology and marketing evolving in the future? What are the top three trends do you foresee for the coming year 2019?<\/strong><\/h4>\r\n<span style=\"font-weight: 400;\"><strong>Atman:<\/strong> In the current information and tech era, everything is connected. Online marketing is mandatory. Yes, technology and online marketing have a great future together.<\/span>\r\n<span style=\"font-weight: 400;\">For instance, you can consider the growing trend of automation is marketing. Digital marketing is one of the fastest-growing marketing channel and the domain that needs a lot of investment at the start, irrespective of their business domain. <\/span>\r\n<span style=\"font-weight: 400;\">Other than that, the trend that I can potentially sense &amp; visualize is the real-time functioning of development for a specific marketing endeavor. <\/span>\r\n<span style=\"font-weight: 400;\">Marketers won’t just have to stay bound to the writing and presentation skills, but they need to have a complete know-about of different platforms and strategies to attract the audience for the specific innovation, service or event. <\/span>\r\n<span style=\"font-weight: 400;\">New channels of targeting specific audience will come into place in the future and the markers need to be wise to analyze the platform &amp; plan before time in order to reap the rewards. <\/span>\r\n<span style=\"font-weight: 400;\">Remember, to leverage any opportunity – you need to be at the right place at the right time. <\/span>\r\n<h4><strong>Digiperform: As your company is into mobile app development, why you feel startups should adopt this trend? What makes mobile development and online marketing a necessity for startups?<\/strong><\/h4>\r\n<span style=\"font-weight: 400;\"><strong>Atman:<\/strong> In the upcoming 10 years the amount of mobile phone usage by people across the globe will be increased gradually. Thanks to the advent of smartphones, advanced technology and easy access to the internet that makes take life to convenience. <\/span>\r\n<span style=\"font-weight: 400;\">At any moment, information is readily available and mobile apps act as a virtual assistant for everyone. We can do anything and everything with a mobile. <\/span>\r\n<span style=\"font-weight: 400;\">Whether the endeavor is to order food, search for a job, find a place to leave, search for rent place, banking, insurance, looking out for cab and almost everything. <\/span>\r\n<span style=\"font-weight: 400;\">People want everything right beside them with ease, and mobile apps fulfill this aim. Without any doubt, the trend for developing unique and better apps is growing and a new idea is nothing without marketing. <\/span>\r\n<span style=\"font-weight: 400;\">Thus, the growth of app development and marketing is certainly big and entrepreneurs should embrace this change for their startup. <\/span>\r\n<h4><strong>Digiperform: According to you, what are the various ingredients required if someone wants to start his\/her own venture?<\/strong><\/h4>\r\n<span style=\"font-weight: 400;\"><strong>Atman:<\/strong> #1. Strong reason. Don’t tell me “money” is the reason for starting a venture. If it is then it won’t be successful in the long run also it is not the right reason for any service delivery. <\/span>\r\n<span style=\"font-weight: 400;\">Entrepreneurs need to have the passion and attitude to solve the problem in the right way, they need to know how they can reach their goal by adopting different strategies with selected resources. <\/span>\r\n<span style=\"font-weight: 400;\">#2. Constant and Never-ending improvement behavior. As they say “kaizen”, a key Japanese principle for any business that will help you stay successful once you have become successful. <\/span>\r\n<span style=\"font-weight: 400;\">#3. Give back – success comes with responsibility. It’s very important that you give back to society, people, country, world, and universe as it would complete the success circle. <\/span>\r\n<h4><strong>Digiperform: Any suggestion you would like to give to our readers and students?<\/strong><\/h4>\r\n<span style=\"font-weight: 400;\"><strong>Atman:<\/strong> We all are very lucky generation. As mentioned above, we are living in the information era and there are more potential and surprising changes in the upcoming 20 years than the last 500 years in this world. <\/span>\r\n<span style=\"font-weight: 400;\">Read, Learn, Experiment. Time is precious and utilizes every moment to grow. <\/span>\r\n<span style=\"font-weight: 400;\">Be a good student, a good professional, a good citizen and most important a good human being. Life is much bigger than we think it is and the universe is much generous than it looks ☺<\/span>\r\n\r\n<strong>Digiperform:<\/strong>\r\nThanks, Atman for such a wonderful interaction. Your journey really seems like a gem and the best thing to read by our readers. Thanks again for giving us your time and allowing us to know more about you and your company. We really wish great luck to you and your company.","protected":false},"excerpt":{"rendered":"In our industry speak section, DigiTalks By Digiperform, we decided to get in touch with Atman Rathod, Founder of Cmarix personally and ask for his journey from college students to Digital Entrepreneur.","protected":false},"author":1,"featured_media":35842,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[132],"tags":[523,241],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v19.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>An Interview with the Founder of Cmarix - Atman Rathod - Digiperform<\/title>\n<meta name=\"description\" content=\"In our industry speak section, DigiTalks By Digiperform, we decided to get in touch with Atman Rathod, Founder of Cmarix personally and ask for his journey from college students to Digital Entrepreneur.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/digiperform.com\/interview-with-atman-rathod-founder-of-cmarix\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"An Interview with the Founder of Cmarix - Atman Rathod - Digiperform\" \/>\n<meta property=\"og:description\" content=\"In our industry speak section, DigiTalks By Digiperform, we decided to get in touch with Atman Rathod, Founder of Cmarix personally and ask for his journey from college students to Digital Entrepreneur.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/digiperform.com\/interview-with-atman-rathod-founder-of-cmarix\/\" \/>\n<meta property=\"og:site_name\" content=\"Digiperform\" \/>\n<meta property=\"article:published_time\" content=\"2019-08-17T08:58:29+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-03-31T19:06:41+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/digiperform.com\/wp-content\/uploads\/2019\/08\/atman-rathod-270x153-1.png\" \/>\n\t<meta property=\"og:image:width\" content=\"270\" \/>\n\t<meta property=\"og:image:height\" content=\"153\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"admin\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"11 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/digiperform.com\/#website\",\"url\":\"https:\/\/digiperform.com\/\",\"name\":\"Digiperform\",\"description\":\"Digital Marketing Training Institute\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/digiperform.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/digiperform.com\/interview-with-atman-rathod-founder-of-cmarix\/#primaryimage\",\"url\":\"https:\/\/digiperform.com\/wp-content\/uploads\/2019\/08\/atman-rathod-270x153-1.png\",\"contentUrl\":\"https:\/\/digiperform.com\/wp-content\/uploads\/2019\/08\/atman-rathod-270x153-1.png\",\"width\":270,\"height\":153,\"caption\":\"An Interview with the Founder of Cmarix\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/digiperform.com\/interview-with-atman-rathod-founder-of-cmarix\/#webpage\",\"url\":\"https:\/\/digiperform.com\/interview-with-atman-rathod-founder-of-cmarix\/\",\"name\":\"An Interview with the Founder of Cmarix - Atman Rathod - Digiperform\",\"isPartOf\":{\"@id\":\"https:\/\/digiperform.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/digiperform.com\/interview-with-atman-rathod-founder-of-cmarix\/#primaryimage\"},\"datePublished\":\"2019-08-17T08:58:29+00:00\",\"dateModified\":\"2022-03-31T19:06:41+00:00\",\"author\":{\"@id\":\"https:\/\/digiperform.com\/#\/schema\/person\/1420e87bcb82e48906cd5160911fcc1a\"},\"description\":\"In our industry speak section, DigiTalks By Digiperform, we decided to get in touch with Atman Rathod, Founder of Cmarix personally and ask for his journey from college students to Digital Entrepreneur.\",\"breadcrumb\":{\"@id\":\"https:\/\/digiperform.com\/interview-with-atman-rathod-founder-of-cmarix\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/digiperform.com\/interview-with-atman-rathod-founder-of-cmarix\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/digiperform.com\/interview-with-atman-rathod-founder-of-cmarix\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/digiperform.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"An Interview with the Founder of Cmarix &#8211; Atman Rathod\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/digiperform.com\/#\/schema\/person\/1420e87bcb82e48906cd5160911fcc1a\",\"name\":\"admin\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/digiperform.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/b69047a5cc9f5694c48ca69f8b62a83b?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/b69047a5cc9f5694c48ca69f8b62a83b?s=96&d=mm&r=g\",\"caption\":\"admin\"},\"sameAs\":[\"https:\/\/digihero.in\/new\"],\"url\":\"https:\/\/digiperform.com\/author\/admin\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"An Interview with the Founder of Cmarix - Atman Rathod - Digiperform","description":"In our industry speak section, DigiTalks By Digiperform, we decided to get in touch with Atman Rathod, Founder of Cmarix personally and ask for his journey from college students to Digital Entrepreneur.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/digiperform.com\/interview-with-atman-rathod-founder-of-cmarix\/","og_locale":"en_US","og_type":"article","og_title":"An Interview with the Founder of Cmarix - Atman Rathod - Digiperform","og_description":"In our industry speak section, DigiTalks By Digiperform, we decided to get in touch with Atman Rathod, Founder of Cmarix personally and ask for his journey from college students to Digital Entrepreneur.","og_url":"https:\/\/digiperform.com\/interview-with-atman-rathod-founder-of-cmarix\/","og_site_name":"Digiperform","article_published_time":"2019-08-17T08:58:29+00:00","article_modified_time":"2022-03-31T19:06:41+00:00","og_image":[{"width":270,"height":153,"url":"https:\/\/digiperform.com\/wp-content\/uploads\/2019\/08\/atman-rathod-270x153-1.png","type":"image\/png"}],"twitter_card":"summary_large_image","twitter_misc":{"Written by":"admin","Est. reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/digiperform.com\/#website","url":"https:\/\/digiperform.com\/","name":"Digiperform","description":"Digital Marketing Training Institute","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/digiperform.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/digiperform.com\/interview-with-atman-rathod-founder-of-cmarix\/#primaryimage","url":"https:\/\/digiperform.com\/wp-content\/uploads\/2019\/08\/atman-rathod-270x153-1.png","contentUrl":"https:\/\/digiperform.com\/wp-content\/uploads\/2019\/08\/atman-rathod-270x153-1.png","width":270,"height":153,"caption":"An Interview with the Founder of Cmarix"},{"@type":"WebPage","@id":"https:\/\/digiperform.com\/interview-with-atman-rathod-founder-of-cmarix\/#webpage","url":"https:\/\/digiperform.com\/interview-with-atman-rathod-founder-of-cmarix\/","name":"An Interview with the Founder of Cmarix - Atman Rathod - Digiperform","isPartOf":{"@id":"https:\/\/digiperform.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/digiperform.com\/interview-with-atman-rathod-founder-of-cmarix\/#primaryimage"},"datePublished":"2019-08-17T08:58:29+00:00","dateModified":"2022-03-31T19:06:41+00:00","author":{"@id":"https:\/\/digiperform.com\/#\/schema\/person\/1420e87bcb82e48906cd5160911fcc1a"},"description":"In our industry speak section, DigiTalks By Digiperform, we decided to get in touch with Atman Rathod, Founder of Cmarix personally and ask for his journey from college students to Digital Entrepreneur.","breadcrumb":{"@id":"https:\/\/digiperform.com\/interview-with-atman-rathod-founder-of-cmarix\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/digiperform.com\/interview-with-atman-rathod-founder-of-cmarix\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/digiperform.com\/interview-with-atman-rathod-founder-of-cmarix\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/digiperform.com\/"},{"@type":"ListItem","position":2,"name":"An Interview with the Founder of Cmarix &#8211; Atman Rathod"}]},{"@type":"Person","@id":"https:\/\/digiperform.com\/#\/schema\/person\/1420e87bcb82e48906cd5160911fcc1a","name":"admin","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/digiperform.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/b69047a5cc9f5694c48ca69f8b62a83b?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/b69047a5cc9f5694c48ca69f8b62a83b?s=96&d=mm&r=g","caption":"admin"},"sameAs":["https:\/\/digihero.in\/new"],"url":"https:\/\/digiperform.com\/author\/admin\/"}]}},"_links":{"self":[{"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/posts\/23787"}],"collection":[{"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/comments?post=23787"}],"version-history":[{"count":3,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/posts\/23787\/revisions"}],"predecessor-version":[{"id":38667,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/posts\/23787\/revisions\/38667"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/media\/35842"}],"wp:attachment":[{"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/media?parent=23787"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/categories?post=23787"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/tags?post=23787"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}