{"id":25298,"date":"2020-01-14T12:18:26","date_gmt":"2020-01-14T12:18:26","guid":{"rendered":"https:\/\/digiperform.in\/backup\/?p=25298"},"modified":"2022-03-14T09:42:17","modified_gmt":"2022-03-14T09:42:17","slug":"digital-marketing-is-a-vast-field-at-this-moment-surely-itll-grow-in-the-coming-future-ankit-dhadwal","status":"publish","type":"post","link":"https:\/\/digiperform.com\/digital-marketing-is-a-vast-field-at-this-moment-surely-itll-grow-in-the-coming-future-ankit-dhadwal\/","title":{"rendered":"&#8220;Digital Marketing is a vast field at this moment &#038; surely it’ll grow in the coming future.&#8221;- Ankit Dhadwal"},"content":{"rendered":"In DigiTalks by Digiperform, Meet <span style=\"font-weight: 400;\">Ankit Dhadwal<\/span>, Founder &amp; CEO of Mount Woods Studio Pvt. Ltd, a Branding and Consultancy agency, a go-getter entrepreneur, risk-taker, traveler, leader, and so on. His journey is full of wow experiences, treasures, and of course hard work.\r\nwe decided to get in touch with him to know more about his passion, work, and team.\r\n<h2><b>1. First, welcome to our industry speak section, DigiTalks by Digiperform. It’s a pleasure to take your interview. Our viewers would like to know about you. Please walk us through your background.<\/b><\/h2>\r\n<span style=\"font-weight: 400;\">Firstly, I would like to congratulate the Digiperform team for creating a platform such as Digitalks where entrepreneurs like me can share their stories with the world. <\/span>\r\n<span style=\"font-weight: 400;\">You are a renowned Brand Name in the industry and what you guys are doing is very good. So keep it up.<\/span>\r\n<span style=\"font-weight: 400;\">My Name is Ankit Dhadwal and I’m the Founder &amp; CEO of <\/span><a href=\"https:\/\/www.mountwoods.com\/\"><span style=\"font-weight: 400;\">Mount Woods Studio Pvt. Ltd.<\/span><\/a><span style=\"font-weight: 400;\"> I belong to a beautiful place in Himachal Pradesh called Solan. <\/span>\r\n<span style=\"font-weight: 400;\">I have done my Diploma in CSE from Lovely Professional University and Graduated from Rayat Bahara Institute of Technology, Mohali, Punjab in 2015. <\/span>\r\n<span style=\"font-weight: 400;\">I always wanted to become an Engineer and when I completed my Engineering that was a very proud moment for me and my family. <\/span>\r\n<span style=\"font-weight: 400;\">Entrepreneurship was always there in my blood as from my childhood I used to think about running my business one day but at that time I was not clear which business will that be. <\/span>\r\n<span style=\"font-weight: 400;\">I also colored stones and pebbles, sold them in my class. Also, my mom is a successful businesswoman of her time and still running her clothing business which is <\/span><a href=\"http:\/\/www.mountclad.com\"><span style=\"font-weight: 400;\">Mount Clad<\/span><\/a><span style=\"font-weight: 400;\">.<\/span>\r\n<span style=\"font-weight: 400;\">When I was pursuing my Diploma, One of my seniors introduced me to blogging and I was so impressed that I wanted to give it a try. <\/span>\r\n<span style=\"font-weight: 400;\">I always loved building beautiful websites so blogging became my area of interest. <\/span>\r\n<span style=\"font-weight: 400;\">So being a coder myself I thought if I’ll learn the basics of digital marketing, it will add extra weight to my resume plus the income generated from it will be the cherry on the cake.<\/span>\r\n<span style=\"font-weight: 400;\">I think that has helped me a lot in understanding the online market and how it works and currently I&#8217;m living my dreams and working day &amp; night to achieve the milestones that I have set for me and my company Mount Woods Studio Pvt. Ltd.<\/span>\r\n<h2><strong>2. You are the Founder of Mount Woods Studio. Please tell us about your company, products, and services. Share the foundation with us.<\/strong><\/h2>\r\n<span style=\"font-weight: 400;\">We are a Branding and Consultancy agency where we solve design problems faced by businesses. <\/span>\r\n<span style=\"font-weight: 400;\">We help them in building a unique Brand Identity by creating High-Quality Custom Designs. <\/span>\r\n<span style=\"font-weight: 400;\">For example, some people think a logo is just a logo but those who have worked with us understand the value that we are adding to it. <\/span>\r\n<span style=\"font-weight: 400;\">There is a huge misconception that a logo is a brand that is clearly not. It’s a tool to represent your brand to customers. <\/span>\r\n<span style=\"font-weight: 400;\">That’s where we come in helping them to understand what actually a Brand is and how to build it.<\/span>\r\n<span style=\"font-weight: 400;\">We do provide digital solutions globally which include Web Development, UI\/UX, Graphic Designing, 2D Animation, Product Photography &amp; Video Production.<\/span>\r\n<span style=\"font-weight: 400;\">Talking about our clientele, we have customers across the USA, Australia and PAN India who have seen significant growth while working with us. From Startups to MNCs We have worked with them all.<\/span>\r\n<h2><b>3. What is the strength of your company? How you hunt new projects for your company?<\/b><\/h2>\r\n<span style=\"font-weight: 400;\">Team Members are the real strength of the company as they are the ones who have the same mentality as I do. <\/span>\r\n<span style=\"font-weight: 400;\">We all wanted to grow and nurture our knowledge. I can’t do everything on my own so having such team members is like a blessing for me. <\/span>\r\n<span style=\"font-weight: 400;\">We have team members who specialize in Graphic Designing, Animation, Creative Directors, Digital Marketing Strategists, and our Founder <strong>Mr. Pankaj Tilara<\/strong> who is so talented with coding that no matter how hard a problem is, he can solve it smoothly and efficiently.<\/span>\r\n<span style=\"font-weight: 400;\">As I am blessed with such great team members similarly we are also blessed with reference from client to client. We do online marketing but most referrals &amp; recommendations work for us. <\/span>\r\n<span style=\"font-weight: 400;\">That’s the power of custom-built work as they are unique and creative that clients refer us. <\/span>\r\n<span style=\"font-weight: 400;\">Also, most importantly, we believe in building long term business relationships with our clients rather than selling our services to them. <\/span>\r\n<span style=\"font-weight: 400;\">That’s where our Consultancy part comes in. We talk before moving ahead and understand their requirements first.<\/span>\r\n<h2><b>4. How much you believe that digital marketing is evolving in 2020? What are the three trends you would like to suggest to everyone?<\/b><\/h2>\r\n<span style=\"font-weight: 400;\">I’m glad that you asked this question. <\/span>\r\n<span style=\"font-weight: 400;\">Digital Marketing in 2020 is the most promising and booming sector where everyone needs to follow the strategies and tactics to survive in the market. <\/span>\r\n<span style=\"font-weight: 400;\">If you need to excel in the field of digital marketing in 2020 then you need to have a decent knowledge of important trends that will affect this industry greatly in 2020.<\/span>\r\n<span style=\"font-weight: 400;\">Some of these trends in 2020 are:<\/span>\r\n<ul>\r\n \t<li><b>Typography &#8211; <\/b>The more Highlighted your message is, the better it is. Take any website like Godaddy, Dribbble, Netflix, Amazon, etc, you will see bolder text where a clear message is given to their customers about what they do and provide.<\/li>\r\n \t<li><b>Alt Text &#8211; <\/b>This was a small thing in the past decade but now Google is focusing a lot more on emphasizing the importance of “Alt Text” and this goes for the images titles as well as other media.<\/li>\r\n \t<li><b>Page Loading Speed &#8211; <\/b>One of our clients met with Google team in San Francisco where they clearly said you should have a very good loading speed for every page of your website as in this digital era of high internet speed no one wants to visit a page that takes too long to open.<\/li>\r\n<\/ul>\r\n&nbsp;\r\n<h2><b>5. If someone is operating a startup and looking for various ways to content, what kind of strategy you would offer him\/her to follow to deliver the best content and reach out to the maximum audience? Let’s say, one owns a small restaurant. What kind of strategies should be followed, as a marketer and entrepreneur? <\/b><\/h2>\r\n<span style=\"font-weight: 400;\">Well, we have our client <\/span><b>Aliya Nada Saifi<\/b><span style=\"font-weight: 400;\"> from Pune who was a food blogger and now running Food Delivery Kitchen called <\/span><b>Roghandaaz<\/b><span style=\"font-weight: 400;\">. <\/span>\r\n<span style=\"font-weight: 400;\">I met her through Urban clap where we started with logo design and then did full branding for her. <\/span>\r\n<span style=\"font-weight: 400;\">So I can relate this question to yours very clearly with her. She is running her business successfully and having a wide range of audiences. <\/span>\r\n<span style=\"font-weight: 400;\">Before starting any business we always suggest to bring your thoughts on paper. This helps you get clarity on what actually you want to do and how you will execute things. <\/span>\r\n<span style=\"font-weight: 400;\">Next is identifying your customers. If you don’t know who your customers are, what they want, you will end up giving up soon. <\/span>\r\n<span style=\"font-weight: 400;\">Once you have identified your customer then the real challenge is to develop your market which is time-consuming. I believe Your Work Teaches you everything.<\/span>\r\n<span style=\"font-weight: 400;\">Aliya Nada did the same thing while working with her, we were in constant touch and communicating with each other on how to proceed further. <\/span>\r\n<span style=\"font-weight: 400;\">Once the branding part was done, her blogging friends and influencers helped her in building the base of her business. <\/span>\r\n<span style=\"font-weight: 400;\">Then instead of working on her site, she kept that in 2nd phase as she knew it would take time to get orders directly on her website. <\/span>\r\n<span style=\"font-weight: 400;\">So she opted for Food Delivery Giants like Ubereats, Zomato, Swiggy, etc. which were already having a larger audience, proper CMS and analytics to measure growth rate and revenue. <\/span>\r\n<span style=\"font-weight: 400;\">She developed everything step by step in phases and we were always there to help. Till now, the quality is not compromised which has given them very good ratings on these platforms.<\/span>\r\n<h2><b>6. Knowing your high professional activity, how do you combine your agenda to fulfill the tasks as a marketer, consultant, and entrepreneur?<\/b><\/h2>\r\n<span style=\"font-weight: 400;\">It’s not an easy task to put all three on the same plate, so to maintain a proper balance and still combining the agenda we try to put them on different plates and balance them all together to create a beautiful experience which not only satisfies me but the one who we are dealing with. <\/span>\r\n<span style=\"font-weight: 400;\">After all its all about customer satisfaction and that’s what matters to me. <\/span>\r\n<span style=\"font-weight: 400;\">If they are happy and had an amazing experience working with me, I think I have achieved milestone and moved one step further in my journey.<\/span>\r\n<h2><b>7. Digital Entrepreneur. Today’s millennial entrepreneurs consider themselves a Digital Entrepreneur? What is your point of view on that?<\/b><\/h2>\r\n<span style=\"font-weight: 400;\">I think it’s good to hear and I feel nice about their success. They are on their journey and achieving what they always wanted to. <\/span>\r\n<span style=\"font-weight: 400;\">Even I follow people who are doing exceptionally well in this industry and when I compare myself with them, my hunger to gain knowledge increases. <\/span>\r\n<span style=\"font-weight: 400;\">It’s all about the time which is the only key for true success, according to me.<\/span>\r\n<h2><b>8. How do you see digital marketing evolving in the future? What are the top three trends do you foresee for the coming year?<\/b><\/h2>\r\n<span style=\"font-weight: 400;\">As we all know that digital marketing is a vast field at this moment and surely it’ll grow in the oncoming future. <\/span>\r\n<span style=\"font-weight: 400;\">So I think that in the oncoming future we will see people doing specialization in a particular field of Digital Marketing. <\/span>\r\n<span style=\"font-weight: 400;\">But all we can do is speculate according to the current pattern and there might be some major improvements and changes that we may not know but still, we can mold ourselves according to the change.<\/span>\r\n<span style=\"font-weight: 400;\">According to me, these trends will always be there which were in the past decades:<\/span>\r\n<ol>\r\n \t<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Specialization<\/span><\/li>\r\n \t<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">The content was the king and will remain forever.<\/span><\/li>\r\n \t<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Backlinks will remain the backbone of the digital marketing community<\/span><\/li>\r\n<\/ol>\r\n&nbsp;\r\n<h2><b>9. As you are aware, Digiperform provides training to people who want to make a career in digital marketing which includes content marketing as well. What exactly you would like to suggest newcomers who are aspiring entrepreneurs.<\/b><\/h2>\r\n<span style=\"font-weight: 400;\">According to me, if you have made your mind to be on your entrepreneurial journey and are ready to tackle any situation then just go for it. <\/span>\r\n<span style=\"font-weight: 400;\">I must say that it will not be an easy journey but that doesn’t mean it’s not achievable. <\/span>\r\n<span style=\"font-weight: 400;\">There will be many successful failures which you will remember for your entire life but after that, the knowledge and lessons learned will be priceless and no one could have taught you.<\/span>\r\n<span style=\"font-weight: 400;\">Digiperform is doing a great job as they are showcasing the experiences of people from where newbies can learn, inspire, grow and try not to commit those mistakes which they did. <\/span>\r\n<span style=\"font-weight: 400;\">Digital marketing is an awesome field where there is no end to learning. Just keep going and keep digging in it. <\/span>\r\n<span style=\"font-weight: 400;\">Always think you are a newbie even if you have achieved a lot because there will be someone else who has the same mentality to grow and nurture his\/her skills.<\/span>\r\n<h2><b>10. According to you, what are the various ingredients for a successful digital marketer and entrepreneur?<\/b><\/h2>\r\n<span style=\"font-weight: 400;\">Well, the grass is always greener on the other side and for those who think you will enjoy a lot when running your business think 10 times again. <\/span>\r\n<span style=\"font-weight: 400;\">In 9 to 5 jobs, you only handle the pressure of work but still able to enjoy time with family. But in Entrepreneurship, you have to handle a lot of things at the same time. <\/span>\r\n<span style=\"font-weight: 400;\">Even the college drop-outs think it is Cool to start their own business but once you enter it, there is no going back. <\/span>\r\n<span style=\"font-weight: 400;\">At the month-end, you have to worry about the office rents, employees&#8217; salaries, clients, 24\/7,365 days of work, etc. <\/span>\r\n<span style=\"font-weight: 400;\">Having a strong mental balance is very necessary which develops with time and your patience will be tested every day. <\/span>\r\n<span style=\"font-weight: 400;\">It has his own perks and benefits which you will receive after years of learning and a vision.  <\/span>\r\n<span style=\"font-weight: 400;\">Like I always wanted to start my own business and I have seen my Mom working hard day and night for us. <\/span>\r\n<span style=\"font-weight: 400;\">So I had an idea about this but real challenges came when I entered fully into it. <\/span>\r\n<span style=\"font-weight: 400;\">According to me there are 3 main ingredients for becoming a successful Entrepreneur and this can be related to any field like being a Digital Marketer:<\/span>\r\n<ul>\r\n \t<li><b>Consistency<\/b><\/li>\r\n \t<li><b>Learning Attitude<\/b><span style=\"font-weight: 400;\"> no matter what position you are at<\/span><\/li>\r\n \t<li><span style=\"font-weight: 400;\">Give your best shot and no matter what it takes <\/span><b>Never Give Up<\/b><span style=\"font-weight: 400;\">  <\/span><\/li>\r\n<\/ul>\r\n<em><strong>&#8220;Dreams is a foundation of every castle&#8221; so just go for it.<\/strong><\/em>\r\n<strong>You can follow Mountwoods On Social Media: <a href=\"https:\/\/www.facebook.com\/mountwoods\/\" target=\"_blank\" rel=\"noopener noreferrer\">Facebook<\/a>, <a href=\"https:\/\/www.linkedin.com\/company\/mountwoods-studio\/\" target=\"_blank\" rel=\"noopener noreferrer\">LinkedIn<\/a>, <a href=\"https:\/\/www.instagram.com\/mountwoodstudio\" target=\"_blank\" rel=\"noopener noreferrer\">Instagram<\/a>, <a href=\"https:\/\/twitter.com\/WoodsMount\" target=\"_blank\" rel=\"noopener noreferrer\">Twitter<\/a>, <a href=\"https:\/\/www.youtube.com\/c\/MountWoodsStudio\" target=\"_blank\" rel=\"noopener noreferrer\">Youtube<\/a>, <a href=\"https:\/\/www.behance.net\/MountWoodsStudio\/\" target=\"_blank\" rel=\"noopener noreferrer\">Behance <\/a><\/strong>","protected":false},"excerpt":{"rendered":"In DigiTalks by Digiperform, Meet Ankit Dhadwal, Founder &amp; CEO of Mount Woods Studio Pvt. Ltd, a Branding and Consultancy agency, a go-getter entrepreneur, risk-taker, traveler, leader, and so on. His journey is full of wow experiences, treasures, and of&#8230;","protected":false},"author":1,"featured_media":35871,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[132],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v19.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>&quot;Digital Marketing is a vast field at this moment &amp; surely it’ll grow in the coming future.&quot;- Ankit Dhadwal - Digiperform<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/digiperform.com\/digital-marketing-is-a-vast-field-at-this-moment-surely-itll-grow-in-the-coming-future-ankit-dhadwal\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"&quot;Digital Marketing is a vast field at this moment &amp; surely it’ll grow in the coming future.&quot;- Ankit Dhadwal - Digiperform\" \/>\n<meta property=\"og:description\" content=\"In DigiTalks by Digiperform, Meet Ankit Dhadwal, Founder &amp; CEO of Mount Woods Studio Pvt. Ltd, a Branding and Consultancy agency, a go-getter entrepreneur, risk-taker, traveler, leader, and so on. His journey is full of wow experiences, treasures, and of...\" \/>\n<meta property=\"og:url\" content=\"https:\/\/digiperform.com\/digital-marketing-is-a-vast-field-at-this-moment-surely-itll-grow-in-the-coming-future-ankit-dhadwal\/\" \/>\n<meta property=\"og:site_name\" content=\"Digiperform\" \/>\n<meta property=\"article:published_time\" content=\"2020-01-14T12:18:26+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-03-14T09:42:17+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/digiperform.com\/wp-content\/uploads\/2020\/01\/ankit-Founder-of-Mount-Woods-Stu.png\" \/>\n\t<meta property=\"og:image:width\" content=\"533\" \/>\n\t<meta property=\"og:image:height\" content=\"300\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"admin\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"11 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/digiperform.com\/#website\",\"url\":\"https:\/\/digiperform.com\/\",\"name\":\"Digiperform\",\"description\":\"Digital Marketing Training Institute\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/digiperform.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/digiperform.com\/digital-marketing-is-a-vast-field-at-this-moment-surely-itll-grow-in-the-coming-future-ankit-dhadwal\/#primaryimage\",\"url\":\"https:\/\/digiperform.com\/wp-content\/uploads\/2020\/01\/ankit-Founder-of-Mount-Woods-Stu.png\",\"contentUrl\":\"https:\/\/digiperform.com\/wp-content\/uploads\/2020\/01\/ankit-Founder-of-Mount-Woods-Stu.png\",\"width\":533,\"height\":300,\"caption\":\"Digital Marketing Future\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/digiperform.com\/digital-marketing-is-a-vast-field-at-this-moment-surely-itll-grow-in-the-coming-future-ankit-dhadwal\/#webpage\",\"url\":\"https:\/\/digiperform.com\/digital-marketing-is-a-vast-field-at-this-moment-surely-itll-grow-in-the-coming-future-ankit-dhadwal\/\",\"name\":\"\\\"Digital Marketing is a vast field at this moment & surely it’ll grow in the coming future.\\\"- Ankit Dhadwal - Digiperform\",\"isPartOf\":{\"@id\":\"https:\/\/digiperform.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/digiperform.com\/digital-marketing-is-a-vast-field-at-this-moment-surely-itll-grow-in-the-coming-future-ankit-dhadwal\/#primaryimage\"},\"datePublished\":\"2020-01-14T12:18:26+00:00\",\"dateModified\":\"2022-03-14T09:42:17+00:00\",\"author\":{\"@id\":\"https:\/\/digiperform.com\/#\/schema\/person\/1420e87bcb82e48906cd5160911fcc1a\"},\"breadcrumb\":{\"@id\":\"https:\/\/digiperform.com\/digital-marketing-is-a-vast-field-at-this-moment-surely-itll-grow-in-the-coming-future-ankit-dhadwal\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/digiperform.com\/digital-marketing-is-a-vast-field-at-this-moment-surely-itll-grow-in-the-coming-future-ankit-dhadwal\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/digiperform.com\/digital-marketing-is-a-vast-field-at-this-moment-surely-itll-grow-in-the-coming-future-ankit-dhadwal\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/digiperform.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"&#8220;Digital Marketing is a vast field at this moment &#038; surely it’ll grow in the coming future.&#8221;- Ankit Dhadwal\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/digiperform.com\/#\/schema\/person\/1420e87bcb82e48906cd5160911fcc1a\",\"name\":\"admin\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/digiperform.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/b69047a5cc9f5694c48ca69f8b62a83b?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/b69047a5cc9f5694c48ca69f8b62a83b?s=96&d=mm&r=g\",\"caption\":\"admin\"},\"sameAs\":[\"https:\/\/digihero.in\/new\"],\"url\":\"https:\/\/digiperform.com\/author\/admin\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"\"Digital Marketing is a vast field at this moment & surely it’ll grow in the coming future.\"- Ankit Dhadwal - Digiperform","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/digiperform.com\/digital-marketing-is-a-vast-field-at-this-moment-surely-itll-grow-in-the-coming-future-ankit-dhadwal\/","og_locale":"en_US","og_type":"article","og_title":"\"Digital Marketing is a vast field at this moment & surely it’ll grow in the coming future.\"- Ankit Dhadwal - Digiperform","og_description":"In DigiTalks by Digiperform, Meet Ankit Dhadwal, Founder &amp; CEO of Mount Woods Studio Pvt. Ltd, a Branding and Consultancy agency, a go-getter entrepreneur, risk-taker, traveler, leader, and so on. His journey is full of wow experiences, treasures, and of...","og_url":"https:\/\/digiperform.com\/digital-marketing-is-a-vast-field-at-this-moment-surely-itll-grow-in-the-coming-future-ankit-dhadwal\/","og_site_name":"Digiperform","article_published_time":"2020-01-14T12:18:26+00:00","article_modified_time":"2022-03-14T09:42:17+00:00","og_image":[{"width":533,"height":300,"url":"https:\/\/digiperform.com\/wp-content\/uploads\/2020\/01\/ankit-Founder-of-Mount-Woods-Stu.png","type":"image\/png"}],"twitter_card":"summary_large_image","twitter_misc":{"Written by":"admin","Est. reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/digiperform.com\/#website","url":"https:\/\/digiperform.com\/","name":"Digiperform","description":"Digital Marketing Training Institute","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/digiperform.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/digiperform.com\/digital-marketing-is-a-vast-field-at-this-moment-surely-itll-grow-in-the-coming-future-ankit-dhadwal\/#primaryimage","url":"https:\/\/digiperform.com\/wp-content\/uploads\/2020\/01\/ankit-Founder-of-Mount-Woods-Stu.png","contentUrl":"https:\/\/digiperform.com\/wp-content\/uploads\/2020\/01\/ankit-Founder-of-Mount-Woods-Stu.png","width":533,"height":300,"caption":"Digital Marketing Future"},{"@type":"WebPage","@id":"https:\/\/digiperform.com\/digital-marketing-is-a-vast-field-at-this-moment-surely-itll-grow-in-the-coming-future-ankit-dhadwal\/#webpage","url":"https:\/\/digiperform.com\/digital-marketing-is-a-vast-field-at-this-moment-surely-itll-grow-in-the-coming-future-ankit-dhadwal\/","name":"\"Digital Marketing is a vast field at this moment & surely it’ll grow in the coming future.\"- Ankit Dhadwal - Digiperform","isPartOf":{"@id":"https:\/\/digiperform.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/digiperform.com\/digital-marketing-is-a-vast-field-at-this-moment-surely-itll-grow-in-the-coming-future-ankit-dhadwal\/#primaryimage"},"datePublished":"2020-01-14T12:18:26+00:00","dateModified":"2022-03-14T09:42:17+00:00","author":{"@id":"https:\/\/digiperform.com\/#\/schema\/person\/1420e87bcb82e48906cd5160911fcc1a"},"breadcrumb":{"@id":"https:\/\/digiperform.com\/digital-marketing-is-a-vast-field-at-this-moment-surely-itll-grow-in-the-coming-future-ankit-dhadwal\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/digiperform.com\/digital-marketing-is-a-vast-field-at-this-moment-surely-itll-grow-in-the-coming-future-ankit-dhadwal\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/digiperform.com\/digital-marketing-is-a-vast-field-at-this-moment-surely-itll-grow-in-the-coming-future-ankit-dhadwal\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/digiperform.com\/"},{"@type":"ListItem","position":2,"name":"&#8220;Digital Marketing is a vast field at this moment &#038; surely it’ll grow in the coming future.&#8221;- Ankit Dhadwal"}]},{"@type":"Person","@id":"https:\/\/digiperform.com\/#\/schema\/person\/1420e87bcb82e48906cd5160911fcc1a","name":"admin","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/digiperform.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/b69047a5cc9f5694c48ca69f8b62a83b?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/b69047a5cc9f5694c48ca69f8b62a83b?s=96&d=mm&r=g","caption":"admin"},"sameAs":["https:\/\/digihero.in\/new"],"url":"https:\/\/digiperform.com\/author\/admin\/"}]}},"_links":{"self":[{"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/posts\/25298"}],"collection":[{"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/comments?post=25298"}],"version-history":[{"count":1,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/posts\/25298\/revisions"}],"predecessor-version":[{"id":35872,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/posts\/25298\/revisions\/35872"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/media\/35871"}],"wp:attachment":[{"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/media?parent=25298"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/categories?post=25298"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/tags?post=25298"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}