{"id":29393,"date":"2021-08-21T07:30:48","date_gmt":"2021-08-21T07:30:48","guid":{"rendered":"https:\/\/digiperform.in\/backup\/?p=29393"},"modified":"2022-03-09T13:14:11","modified_gmt":"2022-03-09T13:14:11","slug":"9-most-important-metrics-to-measure-for-your-new-product","status":"publish","type":"post","link":"https:\/\/digiperform.com\/9-most-important-metrics-to-measure-for-your-new-product\/","title":{"rendered":"9 Most Important Metrics To Measure For Your New Product"},"content":{"rendered":"<span style=\"font-weight: 400;\">Let&#8217;s face it. <\/span>\r\n<span style=\"font-weight: 400;\">The core of every successful business is a product that a real audience wants. <\/span>\r\n<span style=\"font-weight: 400;\">No matter how powerful your product is or how much resources you put in, all your work would be in vain if your end-user does not feel the same about it. The problem is understanding whether you have real people who will be genuinely interested in buying your product or not is tricky. <\/span>\r\n<span style=\"font-weight: 400;\">There are multi-level challenges to it. <\/span>\r\n<span style=\"font-weight: 400;\">You may have a few people interested in solving a problem, but maybe they do not like the solution you offer. Your audience may like your initial offering but may not be satisfied with the existing product and move to your competitors. Whatever is the case, there are many considerations to achieve product-market fit. <\/span>\r\n<span style=\"font-weight: 400;\">This makes tracking metrics and KPIs (key performance indicators) critical for your overall business success. But you wouldn&#8217;t want to track some fancy vanity metrics. Would you now?<\/span>\r\n<span style=\"font-weight: 400;\">In this post, we bring nine growth-hacking metrics that can ensure your product&#8217;s success this year. <\/span>\r\n<h2><span style=\"font-weight: 400;\">9 metrics to measure your new product performance in 2021<\/span><\/h2>\r\n<span style=\"font-weight: 400;\">The core of your product performance metrics lies in understanding how responsive your audience is to it. This means no matter what you track; it should finally be able to tell you if your existing product and its elements are something that your audience wants. More importantly, if they do, then for how long? <\/span>\r\n<span style=\"font-weight: 400;\">In the following section, we bring to you 9 metrics that can comprehensively understand your product performance this year. <\/span>\r\n<h2><\/h2>\r\n<h2><strong>1. Proof of concept<\/strong><\/h2>\r\n<span style=\"font-weight: 400;\">The fundamental metric of a product&#8217;s strength starts at the very idea stage. If there is no market need, your product is sure to fall flat irrespective of its quality. As the famous essayist Paul Graham says, <\/span><span style=\"font-weight: 400;\">&#8220;make something people want.” <\/span><span style=\"font-weight: 400;\">This makes <\/span><a href=\"https:\/\/www.askattest.com\/blog\/guides\/concept-testing-new-product-development\"><span style=\"font-weight: 400;\">concept testing in new product development<\/span><\/a><span style=\"font-weight: 400;\"> a critical metric. <\/span>\r\n<span style=\"font-weight: 400;\">There are so many ways to do this. Market research and audience analysis together is the first stage of validating your product. Next, you can follow this up with a soft launch to test your solutions on real people who are look-alike your target audience. But the maximum optimization happens after you launch your first MVP (minimum viable product). <\/span>\r\n<span style=\"font-weight: 400;\">In doing so, your initial customers prove to be extremely valuable assets. They would help you understand the need and unlock your product&#8217;s true potential. You can keep on optimizing your product until it meets the product-market fit. <\/span>\r\n<h2><\/h2>\r\n<h2><strong>2. Technical performance<\/strong><\/h2>\r\n<img loading=\"lazy\" class=\"aligncenter\" src=\"https:\/\/www.simplypsychology.org\/maslow-5.jpg\" alt=\"Maslow's Hierarchy of Needs Five Stage Pyramid\" width=\"653\" height=\"486\" \/>\r\n<span style=\"font-weight: 400;\">To create a viral product, there are a few essential elements that need to be met. According to <\/span><a href=\"https:\/\/www.simplypsychology.org\/maslow.html#:~:text=From%20the%20bottom%20of%20the,attend%20to%20needs%20higher%20up.\"><span style=\"font-weight: 400;\">Maslow&#8217;s theory<\/span><\/a><span style=\"font-weight: 400;\">, if you look at any successful product, functionality comes before any other element. <\/span>\r\n<span style=\"font-weight: 400;\">A product with limited or no capability to solve the hard problems of a person offers significantly less value. This is why you need to keep your technical performance KPIs (key performance indicators) always in check. <\/span>\r\n<span style=\"font-weight: 400;\">Here your goal should be to achieve the highest levels of customer satisfaction. But to do so, you would have to deploy specific KPIs to ensure this broad metric is measurable and actionable simultaneously. <\/span>\r\n<span style=\"font-weight: 400;\">Downtime, response time, and bug fixing are 3 fundamental metrics that you can work upon here. Tracking your downtime frequency and impact, response time in seconds, and against competitors and bug fixing for new defects and troubleshooting time will create a competitive product. <\/span>\r\n<span style=\"font-weight: 400;\">The best part is that it helps to create an agile technical system for high performance.    <\/span>\r\n<h2><\/h2>\r\n<h2><strong>3. Business performance<\/strong><\/h2>\r\n<span style=\"font-weight: 400;\">Revenue is the life support of any business&#8217;s lifecycle. No matter how strong your product is, if you do not have any paying customers, your business will not sustain itself. This makes business performance indicators an integral part of a product&#8217;s performance audit. <\/span>\r\n<span style=\"font-weight: 400;\">However, performing a business performance audit isn&#8217;t always simple, especially if you have a free product. But to understand how these metrics are contributing to the bottom line of your business is important. Here are a few things that you should consider tracking.  <\/span>\r\n<span style=\"font-weight: 400;\">Revenue is the apparent metric to track. But the insight does not lie in the numbers. Instead, it is the category that gives you actionable advice and opportunities to impact this top-line metric. Tracking annual recurring revenue, the year-on-year growth rate is two of the most important KPIs to measure here. <\/span>\r\n<span style=\"font-weight: 400;\">Yet another metric is the profit margin. If you are not optimizing your ROI (return on investment), chances are you are losing money on the table. This helps to find the bottom line of your business health. <\/span>\r\n<h2><\/h2>\r\n<h2><strong>4. Engagement <\/strong><\/h2>\r\n<span style=\"font-weight: 400;\">The key to a viral product often lies in a single growth metric, product adoption. <\/span>\r\n<span style=\"font-weight: 400;\">The faster a mass audience adopts your product, the higher the chances are for your product to perform well. But more than often, the path to mass adoption is messy. <\/span>\r\n<span style=\"font-weight: 400;\">One powerful technique is to understand the ideal customer journey to your product discovery. This helps you design a system with the least friction between your product and your target audience, mapping customer behavior. <\/span>\r\n<span style=\"font-weight: 400;\">But to optimize this process, you would need to track a few metrics. KPIs like average customer interactions with the product day, week, and month is a great start. <\/span>\r\n<span style=\"font-weight: 400;\">You can go deeper with weekly active users, core tasks performed in a month, average session time, total traffic in a month, and many more. But if there is one significant metric that you cannot miss, it is the NPS (net promoter score).<\/span>\r\n<span style=\"font-weight: 400;\">It will help you understand the satisfaction levels of your existing customer base. The best part? It is the single metric that can give create forecasts on your product-market fit.<\/span>\r\n<h2><\/h2>\r\n<h2><strong>5. Lead generation<\/strong><\/h2>\r\n<span style=\"font-weight: 400;\">Lead generation will always be the most fundamental task when you create a new product. It is the single element that ensures the sustainability and growth of your customer base. This means you not only need leads but quality leads. <\/span>\r\n<span style=\"font-weight: 400;\">Now you can deploy so many techniques to do this, from referral schemes, premium access, webinars, and so much more. But if you are not measuring the success rate of all these channels and strategies, creating an efficient lead generation program for your product can fall flat before you know. This brings us to the key metrics that you should be tracking. <\/span>\r\n<span style=\"font-weight: 400;\">There are three key metrics to track here: new leads, sales conversion, and penetration. Tracking new leads every week gives you an idea of the quality of your traffic while conversions map the percentage of traffic who become your customers. <\/span>\r\n<span style=\"font-weight: 400;\">The penetration metrics give you an insight into your product&#8217;s performance across years. It maps any significant growth in your market capitalization and lets you create strategies to optimize it.  <\/span>\r\n<h2><\/h2>\r\n<h2><strong>6. Retention<\/strong><\/h2>\r\n<span style=\"font-weight: 400;\">No matter how powerful your lead generation magnet is if your sales funnel is leaky, your business&#8217;s sustainability will always be at stake. <\/span>\r\n<span style=\"font-weight: 400;\">In a crowded market space where acquiring a customer is six times more expensive than retaining pre-existing relationships, a customer retention program is a prerequisite. However, devising powerful strategies without understanding your business’s actual marketing and sales landscape is almost like walking in the dark. <\/span>\r\n<span style=\"font-weight: 400;\">Tracking retention measures will give you an anchor to your customer retention policies. The question is, which ones should you consider. <\/span>\r\n<span style=\"font-weight: 400;\">Generally speaking, there are two metrics to consider — churn rate and inactive users. The churn rate will give you an idea of the percentage of the audience that unsubscribes from your product, while the inactive users will help you map audiences who do not engage with your product. <\/span>\r\n<h2><\/h2>\r\n<h2><strong>7. Customer Return on Investment (ROI)<\/strong><\/h2>\r\n<img class=\"aligncenter\" src=\"https:\/\/www.demandjump.com\/hs-fs\/hubfs\/Customer%20Acquisition%20Cost%20by%20IndustryAsset%2020.png?width=600&amp;name=Customer%20Acquisition%20Cost%20by%20IndustryAsset%2020.png\" alt=\"Customer Acquisition Cost by Industry\" \/>\r\n<span style=\"font-weight: 400;\">Customers are the life-support of your business. Ideally, you would like to believe that each brings equal value to your business, but that hardly is the case. <\/span>\r\n<span style=\"font-weight: 400;\">More than often, you would find considerable gaps in the buying behavior of your customer base. While some are frequent buyers with higher-value products, others will be price shoppers who engage with your brand only when you offer a discount.<\/span>\r\n<span style=\"font-weight: 400;\">Understanding and customizing your offers for all these categories of buyers will not only help you strengthen relationships but improve the total value of the buyer. But this cannot be achieved without tracking the customer ROI metrics. <\/span>\r\n<span style=\"font-weight: 400;\">There are two primary metrics to consider: customer acquisition cost (CAC) and lifetime value (LTV). The CAC helps to map your investment of acquiring per customer to understand your profits. The LTV maps the value of a customer throughout the time that they engage with your brand. It starts from the first transaction and ends on the last. <\/span>\r\n<h2><\/h2>\r\n<h2><strong>8. Cross-selling and upselling<\/strong><\/h2>\r\n<span style=\"font-weight: 400;\">If you have to optimize your product&#8217;s strength, it cannot rely upon a single sales channel. Neither can your brand depend upon a single product to grow and sustain the momentum? This makes upselling and cross-selling so critical. <\/span>\r\n<span style=\"font-weight: 400;\">Understanding how your product alleviates the existing problems of your target audience and contextually offering them your services is the best way to create a high-performance sales machine. But making that would require some critical KPI considerations. <\/span>\r\n<span style=\"font-weight: 400;\">Ideally, tracking two metrics does the job here. The potential will map the maximum opportunity to cross-sell and upsell the product while monitoring the adoption rate gives you the momentum of your upselling and cross-selling strategies. <\/span>\r\n<h2><\/h2>\r\n<h2><strong>9. Productivity<\/strong><\/h2>\r\n<span style=\"font-weight: 400;\">In business, time is money. This means you can focus on all the work of the world and yet generate zero output, or there is a better way. <\/span>\r\n<span style=\"font-weight: 400;\">Prioritize your tasks towards a single Northstar metric to witness real growth and momentum in your business. This makes tracking productivity such a critical element, no matter how abstract it sounds. <\/span>\r\n<span style=\"font-weight: 400;\">To do this right, you need to track a single metric, the total number of tasks completed per day. But remember to keep the task list feasible. <\/span>\r\n<h3><\/h3>\r\n<h2><strong>In conclusion<\/strong><\/h2>\r\n<span style=\"font-weight: 400;\">Building a viral product is a lot of hard work. There is no overnight success to it. Do the right thing for a considerable amount of time,higher-value, and you will land at your destination. <\/span>\r\n<span style=\"font-weight: 400;\">The above metrics and KPIs are simply a strategic anchor for understanding if you are doing it right. <\/span>\r\n<span style=\"font-weight: 400;\">Remember, the truest success element of your product still lies with your customers. Your product needs to be lean, agile, and responsive to your audience. Keep the feedback loop open and consider the above metrics to understand your performance better. You would see the next superstar product before you know it. <\/span>\r\n<b>Author bio<\/b>\r\n<span style=\"font-weight: 400;\">Atreyee Chowdhury works full-time as an Instructional Designer and is passionate about writing. She has helped many small and medium-scale businesses achieve their content marketing goals with her carefully crafted and compelling content. She lives in Bangalore, India with her husband and parents. She loves to read, experiment with different cuisines, travel, and explore the latest content marketing and L&amp;D trends in her free time. You can reach her on<\/span><a href=\"https:\/\/www.linkedin.com\/in\/atreyeechowdhury\/\"><span style=\"font-weight: 400;\"> Linkedin<\/span><\/a><span style=\"font-weight: 400;\"> or write to her at <\/span><a href=\"mailto:atreyee.c@gmail.com\"><span style=\"font-weight: 400;\">atreyee.c@gmail.com<\/span><\/a><span style=\"font-weight: 400;\"> to discuss your content marketing requirements. <\/span>","protected":false},"excerpt":{"rendered":"Let&#8217;s face it.  The core of every successful business is a product that a real audience wants.  No matter how powerful your product is or how much resources you put in, all your work would be in vain if your&#8230;","protected":false},"author":1,"featured_media":34379,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[116],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v19.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>9 Most Important Metrics To Measure For Your New Product - Digiperform<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/digiperform.com\/9-most-important-metrics-to-measure-for-your-new-product\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"9 Most Important Metrics To Measure For Your New Product - Digiperform\" \/>\n<meta property=\"og:description\" content=\"Let&#8217;s face it.  The core of every successful business is a product that a real audience wants.  No matter how powerful your product is or how much resources you put in, all your work would be in vain if your...\" \/>\n<meta property=\"og:url\" content=\"https:\/\/digiperform.com\/9-most-important-metrics-to-measure-for-your-new-product\/\" \/>\n<meta property=\"og:site_name\" content=\"Digiperform\" \/>\n<meta property=\"article:published_time\" content=\"2021-08-21T07:30:48+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-03-09T13:14:11+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/digiperform.com\/wp-content\/uploads\/2021\/08\/Metrics-product.png\" \/>\n\t<meta property=\"og:image:width\" content=\"533\" \/>\n\t<meta property=\"og:image:height\" content=\"300\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"admin\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/digiperform.com\/#website\",\"url\":\"https:\/\/digiperform.com\/\",\"name\":\"Digiperform\",\"description\":\"Digital Marketing Training Institute\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/digiperform.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/digiperform.com\/9-most-important-metrics-to-measure-for-your-new-product\/#primaryimage\",\"url\":\"https:\/\/digiperform.com\/wp-content\/uploads\/2021\/08\/Metrics-product.png\",\"contentUrl\":\"https:\/\/digiperform.com\/wp-content\/uploads\/2021\/08\/Metrics-product.png\",\"width\":533,\"height\":300,\"caption\":\"important meetrics to measure for new product\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/digiperform.com\/9-most-important-metrics-to-measure-for-your-new-product\/#webpage\",\"url\":\"https:\/\/digiperform.com\/9-most-important-metrics-to-measure-for-your-new-product\/\",\"name\":\"9 Most Important Metrics To Measure For Your New Product - Digiperform\",\"isPartOf\":{\"@id\":\"https:\/\/digiperform.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/digiperform.com\/9-most-important-metrics-to-measure-for-your-new-product\/#primaryimage\"},\"datePublished\":\"2021-08-21T07:30:48+00:00\",\"dateModified\":\"2022-03-09T13:14:11+00:00\",\"author\":{\"@id\":\"https:\/\/digiperform.com\/#\/schema\/person\/1420e87bcb82e48906cd5160911fcc1a\"},\"breadcrumb\":{\"@id\":\"https:\/\/digiperform.com\/9-most-important-metrics-to-measure-for-your-new-product\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/digiperform.com\/9-most-important-metrics-to-measure-for-your-new-product\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/digiperform.com\/9-most-important-metrics-to-measure-for-your-new-product\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/digiperform.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"9 Most Important Metrics To Measure For Your New Product\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/digiperform.com\/#\/schema\/person\/1420e87bcb82e48906cd5160911fcc1a\",\"name\":\"admin\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/digiperform.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/b69047a5cc9f5694c48ca69f8b62a83b?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/b69047a5cc9f5694c48ca69f8b62a83b?s=96&d=mm&r=g\",\"caption\":\"admin\"},\"sameAs\":[\"https:\/\/digihero.in\/new\"],\"url\":\"https:\/\/digiperform.com\/author\/admin\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"9 Most Important Metrics To Measure For Your New Product - Digiperform","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/digiperform.com\/9-most-important-metrics-to-measure-for-your-new-product\/","og_locale":"en_US","og_type":"article","og_title":"9 Most Important Metrics To Measure For Your New Product - Digiperform","og_description":"Let&#8217;s face it.  The core of every successful business is a product that a real audience wants.  No matter how powerful your product is or how much resources you put in, all your work would be in vain if your...","og_url":"https:\/\/digiperform.com\/9-most-important-metrics-to-measure-for-your-new-product\/","og_site_name":"Digiperform","article_published_time":"2021-08-21T07:30:48+00:00","article_modified_time":"2022-03-09T13:14:11+00:00","og_image":[{"width":533,"height":300,"url":"https:\/\/digiperform.com\/wp-content\/uploads\/2021\/08\/Metrics-product.png","type":"image\/png"}],"twitter_card":"summary_large_image","twitter_misc":{"Written by":"admin","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/digiperform.com\/#website","url":"https:\/\/digiperform.com\/","name":"Digiperform","description":"Digital Marketing Training Institute","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/digiperform.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/digiperform.com\/9-most-important-metrics-to-measure-for-your-new-product\/#primaryimage","url":"https:\/\/digiperform.com\/wp-content\/uploads\/2021\/08\/Metrics-product.png","contentUrl":"https:\/\/digiperform.com\/wp-content\/uploads\/2021\/08\/Metrics-product.png","width":533,"height":300,"caption":"important meetrics to measure for new product"},{"@type":"WebPage","@id":"https:\/\/digiperform.com\/9-most-important-metrics-to-measure-for-your-new-product\/#webpage","url":"https:\/\/digiperform.com\/9-most-important-metrics-to-measure-for-your-new-product\/","name":"9 Most Important Metrics To Measure For Your New Product - Digiperform","isPartOf":{"@id":"https:\/\/digiperform.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/digiperform.com\/9-most-important-metrics-to-measure-for-your-new-product\/#primaryimage"},"datePublished":"2021-08-21T07:30:48+00:00","dateModified":"2022-03-09T13:14:11+00:00","author":{"@id":"https:\/\/digiperform.com\/#\/schema\/person\/1420e87bcb82e48906cd5160911fcc1a"},"breadcrumb":{"@id":"https:\/\/digiperform.com\/9-most-important-metrics-to-measure-for-your-new-product\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/digiperform.com\/9-most-important-metrics-to-measure-for-your-new-product\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/digiperform.com\/9-most-important-metrics-to-measure-for-your-new-product\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/digiperform.com\/"},{"@type":"ListItem","position":2,"name":"9 Most Important Metrics To Measure For Your New Product"}]},{"@type":"Person","@id":"https:\/\/digiperform.com\/#\/schema\/person\/1420e87bcb82e48906cd5160911fcc1a","name":"admin","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/digiperform.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/b69047a5cc9f5694c48ca69f8b62a83b?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/b69047a5cc9f5694c48ca69f8b62a83b?s=96&d=mm&r=g","caption":"admin"},"sameAs":["https:\/\/digihero.in\/new"],"url":"https:\/\/digiperform.com\/author\/admin\/"}]}},"_links":{"self":[{"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/posts\/29393"}],"collection":[{"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/comments?post=29393"}],"version-history":[{"count":1,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/posts\/29393\/revisions"}],"predecessor-version":[{"id":34380,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/posts\/29393\/revisions\/34380"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/media\/34379"}],"wp:attachment":[{"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/media?parent=29393"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/categories?post=29393"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/tags?post=29393"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}