{"id":33657,"date":"2022-03-05T13:12:40","date_gmt":"2022-03-05T13:12:40","guid":{"rendered":"https:\/\/digiperform.com\/?p=33657"},"modified":"2022-06-23T15:35:45","modified_gmt":"2022-06-23T15:35:45","slug":"best-ways-to-combine-email-marketing-and-sms-marketing","status":"publish","type":"post","link":"https:\/\/digiperform.com\/best-ways-to-combine-email-marketing-and-sms-marketing\/","title":{"rendered":"Best ways to combine email marketing and SMS Marketing"},"content":{"rendered":"<span style=\"font-weight: 400;\">As a marketer, you recognize the importance of reaching out to your target audience with relevant content. Consumers spend more time on their smartphones than anywhere else. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">With over 50% of emails being opened on mobile devices and text message open rates approaching 98%, email and SMS marketing are two channels that every marketer should implement to communicate with potential customers.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">While email and text messages may appear similar, each has its own set of benefits, and both should be part of every digital marketer&#8217;s toolset. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Email is a fantastic way to deliver longer-form content and compelling pictures with the ability to add numerous links and calls-to-action.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Meanwhile, mobile messaging&#8217;s immediacy makes it a great channel for marketers to gain prominent attention and generate additional income. Email is undeniably essential, but text messaging is quickly gaining traction as a valuable companion to email.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">It&#8217;s not an issue to decide between the two channels to develop a comprehensive and effective brand communication strategy. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">When used together, email and text messaging give marketers a powerful tool for engaging customers across the customer lifecycle and improving overall performance.<\/span>\r\n\r\n&nbsp;\r\n<h3>Similarities and unique features of SMS and Email Marketing.<\/h3>\r\n<span style=\"font-weight: 400;\">Consumers don&#8217;t limit themselves to just one channel or gadget; they mix and match to find what they&#8217;re looking for. Accept that not everyone will want to sign up for your email list and that not everyone will receive SMS messages.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">However, some customers will desire both; therefore, marketers must design customer experiences that reflect these preferences; in other words, meet your audience where they are. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">More than half of the top 1,000 online merchants now use text message marketing, but that doesn&#8217;t imply they&#8217;re abandoning their <a href=\"https:\/\/www.mailmunch.com\/email-marketing\">email marketing<\/a> efforts. Instead, marketers are combining the two strategies.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Creating efficient email and SMS campaigns can help you provide an exceptional customer experience. Customers can pick where and how they want to interact with your company by giving personalized experiences on both channels. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">They can also be confident that they won&#8217;t miss any critical updates.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Because customers don&#8217;t always open and read emails as quickly as they do text messages, email is a fantastic medium to deliver content that isn&#8217;t as time-sensitive or that you&#8217;d like your audience to digest more thoroughly. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Email is especially well-suited to providing longer-form material, making it a good choice for relationship-building efforts like welcome newsletters or brand loyalty campaigns. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Email is also a naturally visual medium, so it&#8217;s a good fit for beautifully designed creative, visual storytelling with animation or video, and larger pieces of content like new category launches with numerous featured products.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">On the other hand, <\/span><a href=\"https:\/\/vertexsms.com\/en\/bulk-sms-marketing-and-text-message-marketing\"><span style=\"font-weight: 400;\">text messaging<\/span><\/a><span style=\"font-weight: 400;\"> is particularly efficient for encouraging rapid action with a shorter form of communication due to its instantaneous nature. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">People read their texts as quickly as they receive them, so the messages you send as a business should be brief, appealing, and, most importantly, actionable. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">To boost clicks and conversions while your brand is front of mind, incorporate a solid call to action in your messages, such as &#8220;shop the deal while it lasts&#8221; or &#8220;buy tickets today&#8221;.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Email and text messaging programs allow marketers to connect with customers more deeply and establish even more touchpoints across campaigns when used in tandem. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">For example, when holding a short-term promotion, a business might first advertise the sale by SMS, then promote it using email, and finally, send a final text as the offer&#8217;s expiration date approaches. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">This strategy allows customers the option of where and how they choose to interact with your business. It also keeps your brand top of mind across time and devices, increasing the likelihood that your audience will convert.<\/span>\r\n\r\n&nbsp;\r\n<h3>Combine email and SMS marketing in the customer journey<\/h3>\r\n<span style=\"font-weight: 400;\">Marketers should view email and text messaging software as complementary strategies rather than competitive. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">By supporting communication across different channels, you&#8217;re giving your subscribers more control over how they interact with you, resulting in higher engagement with your marketing content and increased income for your company. <\/span>\r\n\r\n&nbsp;\r\n<h4>Trigger messages<\/h4>\r\n<span style=\"font-weight: 400;\">Subscribers receive triggered or automated messages based on a specific action done by the user (browsing the site, abandoning a cart, etc.) or sometimes an action not yet taken (buying from a particular category, repurchasing within a specific timeframe, etc.). <\/span>\r\n\r\n<span style=\"font-weight: 400;\">With timely and relevant content unique to each subscriber, these highly tailored messages increase engagement and conversions.<\/span>\r\n\r\n&nbsp;\r\n<h4><strong>Welcome series <\/strong><\/h4>\r\n<span style=\"font-weight: 400;\">Your welcome series is your first chance to form a connection with a new subscriber. Brands use this tactic to give sign-up incentives, explain their product lineup, and demonstrate what differentiates them from the competitors.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">It also sets the tone for the types of messages they can expect from you in the future and the frequency with which you will communicate with them.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">In a welcome flow, text and email messages can convey various types of information and communicate the brand story. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Text messaging best describes time-sensitive promotional offers and reminders while email repeats the same promotional value, provides brand reinforcement, and further details your product&#8217;s unique features and benefits.<\/span>\r\n\r\n<b>Pro Tip: <\/b><span style=\"font-weight: 400;\">Ensure to use the first name of your customers to make it more personalized. People want to be treated special, and having their name in the subject line or the copy of your message will differentiate you from your competitors.<\/span>\r\n\r\n&nbsp;\r\n<h4><strong>Cart abandonment<\/strong><\/h4>\r\n<span style=\"font-weight: 400;\">For online retailers, shopping cart abandonment has become a significant issue. Almost a quarter of all online shopping carts are abandoned.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">While this represents a huge potential revenue loss, automated reminders to complete the abandoned transaction have proven effective revenue generators for many businesses. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">An abandoned cart email or text message reminds customers to finish their purchase and can be just the thing to turn browsing into a buyer.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">We recommend sending an abandoned cart reminder through text 30 minutes after the cart has been left to leverage these two channels in tandem; the immediate nature of text messaging makes this channel especially suited to driving shoppers back to your site rapidly. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">If the shopper does not convert, send another email reminder 1-3 hours after the abandonment. <\/span><a href=\"https:\/\/moosend.com\/templates\/cart-abandonment\/\"><span style=\"font-weight: 400;\">Moosend<\/span><\/a><span style=\"font-weight: 400;\">’s cart abandonment templates can help you get back potential customers without being a designer or developer.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Whether you send the reminder by text message or email, make sure to include a link back to the shopper&#8217;s online cart so they may finish their purchase as quickly as possible.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Having an automated sequence for such tasks will make your life easier and set your business on autopilot to drive more revenue.<\/span>\r\n\r\n&nbsp;\r\n<h4><strong>Post-purchase, upselling, and cross-selling <\/strong><\/h4>\r\n<span style=\"font-weight: 400;\">It costs around five times less to keep existing consumers than it does to acquire new ones. Brands can use post-purchase messages to reach out to customers while they&#8217;re most engaged and show them different or complementary things they might like to get. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Once customers have completed their initial purchase, use text and email messages to encourage them to buy again. Based on the customer&#8217;s recent purchase, your email marketing service can provide product recommendations that they might be interested in.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">If a contact fails to convert or engage via email, a follow-up text message, possibly with an offer, can be sent to encourage a bounce back. It&#8217;s great for varying the cadence of these communications so that the client doesn&#8217;t get text and email simultaneously but instead receives it over time as part of a single, unified journey.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Any text or email program would be incomplete without triggered messages; its automated deployment saves marketers time while allowing communication at scale without sacrificing the engagement from delivering timely and relevant content.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">However, it&#8217;s crucial to remember that these messages should not be considered as &#8220;set it and forget it.&#8221; Regularly evaluate the performance of triggered messages, whether sent via email or text, to find areas for optimization and improvement.<\/span>\r\n\r\n<b>Pro Tip:<\/b><span style=\"font-weight: 400;\"> Set up separate cart flows for contacts who are subscribers to one channel vs. both. If a subscriber is not receiving both channels, you may find that your message cadence needs to be increased for one of them.<\/span>\r\n\r\n&nbsp;\r\n<h4>Campaigns<\/h4>\r\n<span style=\"font-weight: 400;\">Product launches, sales, brand marketing, and other campaigns communications delivered to specific groups of subscribers remain a successful approach for reaching customers at scale and driving revenue.<\/span>\r\n\r\n&nbsp;\r\n<h4><strong>Exclusive offers and promotions <\/strong><\/h4>\r\n<span style=\"font-weight: 400;\">Exclusive discounts and promos are effective ways to keep customers interested in your email and text message campaigns. While your channel execution approach will vary depending on your audience and goals, we advocate using text messaging to convey your most time-sensitive promotions to generate a feeling of urgency and prompt fast action.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Segment your loyal customers into a specific group and send them personalized messages to help them reengage with your brand. Offer special discounts to make them feel part of your brand.<\/span>\r\n\r\n<b>Pro tip<\/b><span style=\"font-weight: 400;\">: It&#8217;s vital to remember that text messaging is an inherently private channel— customers pay close attention to and trust the companies with which they choose to communicate via text. Treat your mobile users like VIPs by sending them only the most unique offers.<\/span>\r\n\r\n&nbsp;\r\n<h4><b>Product launch <\/b><\/h4>\r\n<span style=\"font-weight: 400;\">New product launches are a great way to increase conversions, primarily if you don&#8217;t provide deals or discounts. You can target your email and text messaging subscribers to receive relevant product updates. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">To do that, use browsing data or historical purchase activity. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">By giving members first access to new products, product launches can help create consumer loyalty. Consumers enjoy feeling special, so giving them a sneak glimpse or the opportunity to pre-order your latest products will make them feel like VIPs. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Email and text messages can result in a genuinely revenue-driving campaign when used in unison to advertise a new product launch. Use text messaging&#8217;s immediacy to encourage immediate conversions. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Send an SMS with a &#8220;sneak peak&#8221; graphic and a direct link back to the product page at the moment of the launch. Treat your follow-up email like a story: include eye-catching visuals, as well as the product&#8217;s inspiration, features and benefits, and beautiful photography or video material.<\/span>\r\n\r\n&nbsp;\r\n<h4><strong>Seasonal<\/strong><\/h4>\r\n<span style=\"font-weight: 400;\">Seasonal advertising allows marketers to capitalize on the excitement that surrounds holidays and significant events. Seasonal email and text messaging campaigns can be promotional or inspirational.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Leveraging both email and text messaging combined can result in significant performance and revenue, just as it can with product launch campaigns. Play to the strengths of each channel to optimize the impact of your seasonal promotion. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Use both channels to prompt rapid action during the busy Christmas season and reach out to on-the-go shoppers. Include a seasonally related graphic to attract subscribers&#8217; attention in both email and text messages. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">End with a clear CTA with a link back to your site to motivate subscribers to take action. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Campaigns promoting significant product releases, anniversary or semi-annual promotions, holidays, or clearance deals, for example, could be marketed via email and text messaging.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Make sure you&#8217;re not delivering the same stuff to the same people on both channels, though. <\/span><span style=\"font-weight: 400;\">Be strategic about what you&#8217;re sharing by adapting your messages to the channel where they&#8217;ll appear.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">For example, test the delivery timing for text and email. Early in the morning may be the ideal time to send an email for customers to see as they begin their day, whereas text messaging is great for business hours, early evenings, and weekends.<\/span>\r\n\r\n&nbsp;\r\n<h3>The Takeaway<\/h3>\r\n<span style=\"font-weight: 400;\">Brands can communicate with subscribers across devices and at every stage of the consumer lifecycle when they use email and text messaging together. It&#8217;s not a case of email vs. SMS marketing for these two efficient communication platforms. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The two work better together when done effectively. Why choose just one channel when you can use both to increase engagement and revenue—and, most crucially, to make your consumers happier? <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Marketers should rely on established solution providers and marketing specialists who specialize in each channel to maximize the performance of each channel.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Until the next one, keep sending.<\/span>\r\n\r\n&nbsp;\r\n\r\n<span style=\"font-weight: 400;\">&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8211;<\/span>\r\n\r\n&nbsp;\r\n\r\n<a href=\"https:\/\/www.linkedin.com\/in\/souchoroukof\/\"><span style=\"font-weight: 400;\">Alex<\/span><\/a><span style=\"font-weight: 400;\"> works at Moosend as a content writer. He took a chance and moved from his professional architectural career to the field of digital marketing, and hasn&#8217;t looked back. He enjoys traveling to new areas throughout the world in his spare time.<\/span>\r\n\r\n&nbsp;","protected":false},"excerpt":{"rendered":"As a marketer, you recognize the importance of reaching out to your target audience with relevant content. Consumers spend more time on their smartphones than anywhere else.  With over 50% of emails being opened on mobile devices and text message&#8230;","protected":false},"author":2,"featured_media":33658,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[32,60,64],"tags":[61,65],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v19.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Best ways to combine email marketing and SMS Marketing - Digiperform<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/digiperform.com\/best-ways-to-combine-email-marketing-and-sms-marketing\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Best ways to combine email marketing and SMS Marketing - Digiperform\" \/>\n<meta property=\"og:description\" content=\"As a marketer, you recognize the importance of reaching out to your target audience with relevant content. Consumers spend more time on their smartphones than anywhere else.  With over 50% of emails being opened on mobile devices and text message...\" \/>\n<meta property=\"og:url\" content=\"https:\/\/digiperform.com\/best-ways-to-combine-email-marketing-and-sms-marketing\/\" \/>\n<meta property=\"og:site_name\" content=\"Digiperform\" \/>\n<meta property=\"article:published_time\" content=\"2022-03-05T13:12:40+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-06-23T15:35:45+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/digiperform.com\/wp-content\/uploads\/2022\/03\/SMS-email_blog.png\" \/>\n\t<meta property=\"og:image:width\" content=\"533\" \/>\n\t<meta property=\"og:image:height\" content=\"300\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Manju\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/digiperform.com\/#website\",\"url\":\"https:\/\/digiperform.com\/\",\"name\":\"Digiperform\",\"description\":\"Digital Marketing Training Institute\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/digiperform.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/digiperform.com\/best-ways-to-combine-email-marketing-and-sms-marketing\/#primaryimage\",\"url\":\"https:\/\/digiperform.com\/wp-content\/uploads\/2022\/03\/SMS-email_blog.png\",\"contentUrl\":\"https:\/\/digiperform.com\/wp-content\/uploads\/2022\/03\/SMS-email_blog.png\",\"width\":533,\"height\":300,\"caption\":\"how to combine email and SMS marketing\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/digiperform.com\/best-ways-to-combine-email-marketing-and-sms-marketing\/#webpage\",\"url\":\"https:\/\/digiperform.com\/best-ways-to-combine-email-marketing-and-sms-marketing\/\",\"name\":\"Best ways to combine email marketing and SMS Marketing - Digiperform\",\"isPartOf\":{\"@id\":\"https:\/\/digiperform.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/digiperform.com\/best-ways-to-combine-email-marketing-and-sms-marketing\/#primaryimage\"},\"datePublished\":\"2022-03-05T13:12:40+00:00\",\"dateModified\":\"2022-06-23T15:35:45+00:00\",\"author\":{\"@id\":\"https:\/\/digiperform.com\/#\/schema\/person\/86dbea16b26c0c75fdcb0f25d257f88d\"},\"breadcrumb\":{\"@id\":\"https:\/\/digiperform.com\/best-ways-to-combine-email-marketing-and-sms-marketing\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/digiperform.com\/best-ways-to-combine-email-marketing-and-sms-marketing\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/digiperform.com\/best-ways-to-combine-email-marketing-and-sms-marketing\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/digiperform.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Best ways to combine email marketing and SMS Marketing\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/digiperform.com\/#\/schema\/person\/86dbea16b26c0c75fdcb0f25d257f88d\",\"name\":\"Manju\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/digiperform.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/c806be710d1f0a1053109e16a5fd83c3?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/c806be710d1f0a1053109e16a5fd83c3?s=96&d=mm&r=g\",\"caption\":\"Manju\"},\"url\":\"https:\/\/digiperform.com\/author\/digi_blogs\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Best ways to combine email marketing and SMS Marketing - Digiperform","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/digiperform.com\/best-ways-to-combine-email-marketing-and-sms-marketing\/","og_locale":"en_US","og_type":"article","og_title":"Best ways to combine email marketing and SMS Marketing - Digiperform","og_description":"As a marketer, you recognize the importance of reaching out to your target audience with relevant content. Consumers spend more time on their smartphones than anywhere else.  With over 50% of emails being opened on mobile devices and text message...","og_url":"https:\/\/digiperform.com\/best-ways-to-combine-email-marketing-and-sms-marketing\/","og_site_name":"Digiperform","article_published_time":"2022-03-05T13:12:40+00:00","article_modified_time":"2022-06-23T15:35:45+00:00","og_image":[{"width":533,"height":300,"url":"https:\/\/digiperform.com\/wp-content\/uploads\/2022\/03\/SMS-email_blog.png","type":"image\/png"}],"twitter_card":"summary_large_image","twitter_misc":{"Written by":"Manju","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/digiperform.com\/#website","url":"https:\/\/digiperform.com\/","name":"Digiperform","description":"Digital Marketing Training Institute","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/digiperform.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/digiperform.com\/best-ways-to-combine-email-marketing-and-sms-marketing\/#primaryimage","url":"https:\/\/digiperform.com\/wp-content\/uploads\/2022\/03\/SMS-email_blog.png","contentUrl":"https:\/\/digiperform.com\/wp-content\/uploads\/2022\/03\/SMS-email_blog.png","width":533,"height":300,"caption":"how to combine email and SMS marketing"},{"@type":"WebPage","@id":"https:\/\/digiperform.com\/best-ways-to-combine-email-marketing-and-sms-marketing\/#webpage","url":"https:\/\/digiperform.com\/best-ways-to-combine-email-marketing-and-sms-marketing\/","name":"Best ways to combine email marketing and SMS Marketing - Digiperform","isPartOf":{"@id":"https:\/\/digiperform.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/digiperform.com\/best-ways-to-combine-email-marketing-and-sms-marketing\/#primaryimage"},"datePublished":"2022-03-05T13:12:40+00:00","dateModified":"2022-06-23T15:35:45+00:00","author":{"@id":"https:\/\/digiperform.com\/#\/schema\/person\/86dbea16b26c0c75fdcb0f25d257f88d"},"breadcrumb":{"@id":"https:\/\/digiperform.com\/best-ways-to-combine-email-marketing-and-sms-marketing\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/digiperform.com\/best-ways-to-combine-email-marketing-and-sms-marketing\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/digiperform.com\/best-ways-to-combine-email-marketing-and-sms-marketing\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/digiperform.com\/"},{"@type":"ListItem","position":2,"name":"Best ways to combine email marketing and SMS Marketing"}]},{"@type":"Person","@id":"https:\/\/digiperform.com\/#\/schema\/person\/86dbea16b26c0c75fdcb0f25d257f88d","name":"Manju","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/digiperform.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/c806be710d1f0a1053109e16a5fd83c3?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/c806be710d1f0a1053109e16a5fd83c3?s=96&d=mm&r=g","caption":"Manju"},"url":"https:\/\/digiperform.com\/author\/digi_blogs\/"}]}},"_links":{"self":[{"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/posts\/33657"}],"collection":[{"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/comments?post=33657"}],"version-history":[{"count":3,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/posts\/33657\/revisions"}],"predecessor-version":[{"id":39770,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/posts\/33657\/revisions\/39770"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/media\/33658"}],"wp:attachment":[{"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/media?parent=33657"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/categories?post=33657"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/tags?post=33657"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}