{"id":34152,"date":"2021-01-19T11:48:54","date_gmt":"2021-01-19T11:48:54","guid":{"rendered":"https:\/\/digiperform.com\/?p=34152"},"modified":"2022-03-28T10:33:16","modified_gmt":"2022-03-28T10:33:16","slug":"15-different-types-of-marketing-campaigns-ultimate-guide","status":"publish","type":"post","link":"https:\/\/digiperform.com\/15-different-types-of-marketing-campaigns-ultimate-guide\/","title":{"rendered":"15 Different Types Of Marketing Campaigns (Ultimate Guide)"},"content":{"rendered":"[vc_row pix_particles_check=&#8221;&#8221;][vc_column][vc_column_text]When it comes to “Marketing” a product, service, or anything that has to reach potential customers one can adopt various ways to do so. Door to Door marketing is the traditional method that was first adopted in the history of marketing. Then came advertising through posters, via newspaper prints, magazines, and now it has reached digital media through search engines, social media, emailers, etc.\r\n\r\nMarketing is the most crucial part that decides the fate and fortune of any product’s success.\r\n\r\nWhat makes a marketing campaign impactful includes reach, visual impact, and ultimately buyers that it gives good ROI?\r\n\r\nCommon components of a great marketing campaign include:\r\n<ul>\r\n \t<li aria-level=\"1\">Promotion<\/li>\r\n \t<li aria-level=\"1\">Advertising<\/li>\r\n \t<li aria-level=\"1\">Targeting<\/li>\r\n \t<li aria-level=\"1\">Distribution<\/li>\r\n \t<li aria-level=\"1\">Merchandising<\/li>\r\n \t<li aria-level=\"1\">Pricing<\/li>\r\n \t<li aria-level=\"1\">Selling<\/li>\r\n<\/ul>\r\nIf all these features are included in a marketing campaign, it can be marked as a <a href=\"https:\/\/www.investopedia.com\/terms\/m\/marketing-campaign.asp\">perfect marketing campaign<\/a>. Still, the best marketing is the one that produces and generates profitable results for a brand or a company not just in terms of revenue but also reputation building.\r\n\r\nThere is not a single best marketing campaign formula that can seal the deal for you, thus, here are 15 Different types of “Marketing Campaigns” that can help you target your potential customers and make your product sales go up.\r\n\r\n&nbsp;\r\n<h3>Digital Marketing Campaigns<\/h3>\r\nIn the present world, everything is going digital, and advanced tools are being used everywhere, from bookings to purchasing.\r\n\r\nDigital marketing campaigns are the best way to <a href=\"https:\/\/www.thegratifiedblog.com\/how-to-grow-your-business-with-digital-marketing\/\">grow any business online<\/a>. They can help you launch and market your brand or product through various social media platforms such as Facebook and Instagram and search engines. The lead generation depends upon the marketing campaign you choose.\r\n\r\nAlthough digital marketing is a quite cheap marketing practice, however, if you want to target many customers in particular sales geolocation, you may need to invest more money accordingly. Google listing as a part of organic SEO practice is also a great way of lead generation through digital marketing.\r\n\r\nHave you ever wondered why a certain product appears on your screen when you have just talked about it to someone? Or search for it a while ago? Well! That’s called digital remarketing.\r\n\r\nDigital marketing mainly works on three main factors, which are Search Engine Optimization, Search Engine Marketing, and Content Marketing.\r\n\r\nTo go into the details of it;\r\n<ul>\r\n \t<li aria-level=\"1\"><b>SEO or Search Engine Optimization <\/b>typically means ranking your website top of search results on a search engine on queries that can bring you business. The relevancy of the content on a webpage matters the most when it comes to making your page visible to the right audience. Apart from that other techniques are also followed to rank a domain like link-building practices and technical on-page optimization.<\/li>\r\n<\/ul>\r\n&nbsp;\r\n<ul>\r\n \t<li aria-level=\"1\"><b>Paid Search Engine Marketing <\/b>is a way of establishing your online presence via <a href=\"https:\/\/www.wordstream.com\/paid-search\">paid search marketing campaigns<\/a> on search engines like Google. Brands and businesses initiate paid campaigns on search engines for their domain to appear on the top of the search results on relevant search engine queries. Domains are charged per click of the audience on the domain called pay per click campaign.<\/li>\r\n<\/ul>\r\n<ul>\r\n \t<li aria-level=\"1\"><b>Content Marketing <\/b>every marketer must have heard at least once that “content is the king” in the castle of marketing. And it is an absolutely true phrase in marketing. From popular taglines to attractive jingles we’ve all been following and are loyal to our favorite brands. The basic point of content is to make it relatable to the audience and to answer the questions without them even asking! Such as why you should buy it? Why is it better than others? How is it useful for you? Also, it can help build trust among the audience.<\/li>\r\n<\/ul>\r\n<h2><\/h2>\r\n<h3>OTB Campaigns<\/h3>\r\nOut of the box campaigns or OTB marketing campaigns are the ones that use out of the box and entirely different marketing strategies such as making a viral video or a song that gets hit on social media.  A company can make use of physical props and mascots to entice customers to try out the products of their company.\r\n<h2><\/h2>\r\n<h3>Radio, Television, and Theatrical Campaigns<\/h3>\r\nRadio, television, and movie theatres are great ways for marketing campaigning and might generate great leads for the business. A jingle over the radio or a great advertisement over the television with a message or a tagline that creates an everlasting impact on the customers can be a good marketing strategy.\r\n\r\nUsing popular actors or a face that is popular as brand ambassadors also helps to create a huge impact on the customer and entice them to use products of your brand.\r\n<h2><\/h2>\r\n<h3>Event Campaigning<\/h3>\r\nOrganizing events such as launch events or setting up booths in popular malls or places where people often visit can be a great campaigning strategy. Organizing lucky draws, competitions, where winners get to use your products, helps customers know about your brand. Launch events with social media celebrities who can promote your product on their pages influence the customers. Distributing free mini samples during an event also catches the attention of potential customers.\r\n<h2><\/h2>\r\n<h3>Influencer Marketing<\/h3>\r\nCollaborating your brand or product with an already popular name in the marketing industry can bring great business for your company. Nowadays, social media influencers are gaining great popularity through their Instagram handles and YouTube.\r\n\r\nWhen you collaborate with these influencers and send them your products so they can share reviews, pictures, and videos about your product it helps their followers and subscribers to know about it and to follow your brand. Now there is an international market that not only recognizes social media influencers but celebrates the role in bringing out the best marketing techniques through the use of their talent.\r\n<h2><\/h2>\r\n<h3>Seasonal Push Campaigns<\/h3>\r\nA seasonal push campaign is a marketing campaign that is used to promote a brand or a product during popular festive seasons to accelerate seasonal sales, products, or services. This type of marketing campaign can be a good strategy for businesses that launch products with a festive theme and launch offers and schemes during particular seasons. Creating exciting festive offers and hampers is a great part of seasonal push campaigns.\r\n\r\n&nbsp;\r\n<h3>Email Marketing Campaigns<\/h3>\r\nEmail marketing campaigns are a great way to keep customers engaged by sending them emails about new product launches, sales, offers, and premium advantages. It uses data of already enrolled customers and collects data on new potential customers to send out target emails.\r\n\r\nFor example, an organization may send out an email campaign to all of its customers informing them of an upcoming sale and offering an additional 20% off coupon if they purchase via an attached redirecting link to their website. Along with email marketing, people can also be reached through texts for new offers or new product launches.  Using a link that directs to the brand is a great technique but should be avoided for spam.\r\n\r\n&nbsp;\r\n<h3>Content Marketing Through Blogs<\/h3>\r\nWriting blogs with the use of appropriate keywords and content that generates leads is a great marketing strategy. Blog writing is now a popular tool for marketing as it contains all the needed information for potential customers.  Blogs can be written on their own website or other platforms such as word press, Blog post, Quora is also a great platform to market your product by answering various questions from the users. Blog writing can also be done on platforms that allow linking the website link of your brand on their site paid\/unpaid and can help people reach your business.\r\n\r\n&nbsp;\r\n<h3>Apps Marketing<\/h3>\r\nCreating marketing campaigns and launching them via popular apps are a great marketing technique. Short videos about your product can be made to display on the apps by sponsoring the apps. For example, if some game is very popular and offers sponsored video in their in-app, your product can be advertised there. Popular apps are downloaded by many users and thus an ad running through the app can create popularity for your brand and bring you good business.\r\n\r\n&nbsp;\r\n<h3>Contest Marketing Campaigns<\/h3>\r\nA brand or company can create pages on popular social media platforms and create engagement posts and contests for the followers. Such as giveaways where people have to tag their friends and repost about the products and share reviews so that people get to know more about them. Contest marketing campaigns can also be done via ads where if a person buys your product and shares a code via SMS, gets a free gift such as data on their mobiles. Thus, this marketing campaign is a great way to go about marketing your product.\r\n<h2><\/h2>\r\n<h3>Brand Awareness Campaigns<\/h3>\r\nBrand Awareness marketing campaigns chiefly build up awareness, engagement, and recognition for a company and its brand. Since increasing awareness is the main component when it comes to marketing the brand it is an extremely important step.\r\n\r\nBrand awareness initiatives have <a href=\"https:\/\/www.incredo.co\/key-saas-metrics-that-matter-for-your-business-growth\/\">metrics that helps you understand your business growth<\/a> such as:\r\n<ul>\r\n \t<li aria-level=\"1\">Website traffic<\/li>\r\n \t<li aria-level=\"1\">Social media community growth<\/li>\r\n \t<li aria-level=\"1\">Social shares + engagement<\/li>\r\n<\/ul>\r\nThese brand awareness campaigns are designed so that they can reach potential customer’s hearts and minds. This basically means connecting with the customers directly and letting them know how your product is useful for them and why they should invest in it. It also gives the brand an opportunity to communicate with customers and tell them why it is better than your competitors.\r\n<h2><\/h2>\r\n<h3>Traditional Marketing Campaigns<\/h3>\r\nTraditional marketing campaigns include hoardings on busy roads and in the areas where potential customers for your brand are more likely to spot. Hoardings and billboards can catch the attention of customers that are driving through or are walking. Using posters for marketing campaigns on buses or trains or in the subways are also productive when it comes to reaching out to the public.\r\n\r\nThis traditional approach always creates and generates leads for your business.  Traditional marketing campaigns also include the use of door-to-door pamphlet distribution or posters around the areas.\r\n<h2><\/h2>\r\n<h3>Sponsor Marketing Campaigns<\/h3>\r\nWhen a brand or a company sponsors any event, show, film or magazine, or book they are creating a marketing campaign through it. You might have seen many brands such as Pepsi or coca-cola sponsoring events such as Cricket matches.\r\n\r\nYou might have observed logos of their company on the t-shirts of players and in and around the stadium. This technique is also very popular for brands that have a high budget for their marketing campaigns. This helps customers catch attention to your product and they may then want to buy it.\r\n<h2><\/h2>\r\n<h3>Paid Social Media Marketing Campaigns<\/h3>\r\nOne is the general organic way of running marketing campaigns over social media while the other is paid. When you pay a social media platform to run your ads over social media and help people reach you that is known as paid marketing.\r\n\r\nThe social media platforms help you target your potential customers and run the ads during the time when people are more likely to see them. This helps your business reach people and brings growth to your business.\r\n<h2><\/h2>\r\n<h3>Brand Introduction Marketing Campaigns<\/h3>\r\nWhen a company is launching a new brand in the market they are most likely to reach very few people. However, if they introduce their product in the market in a unique manner such as free samples to acquaintances or to relatable businesses. Free demo sessions in a fair or an exhibition. The product is introduced in a better and practical way and it helps customers to learn more about it. Immediate feedback is also collected that helps the brand to fix any issues if found. This marketing campaigning technique is best for new brands and also gains the trust of the customers.\r\n<h2><\/h2>\r\n<h3>Conclusion<\/h3>\r\nAll these marketing campaigns can boost your business and create a permanent and strong brand image of your company. It is also important that the company stay up to date with online marketing trends and updates itself with the latest marketing practices very well. You can make well-managed marketing plans in notes, for that you can use <a href=\"https:\/\/www.smarttask.io\/alternatives\/trello-alternative\">tools like trello<\/a>.\r\n\r\nOnly marketing is not enough when it comes to creating brand loyalty. Thus it is extremely important for the company to run regular inspections of their products and to gain regular customer feedback for any improvements. Marketing campaigns should target the most potential customers which are likely to use your brand and refer to others. Nowadays a smarter way of running marketing campaigns is to make them relatable and directly indicating towards the audience.\r\n\r\n&nbsp;\r\n\r\n<b>Author Bio:<\/b> The article was written by Pragya Goyal, Content Strategist at <a href=\"http:\/\/thegratifiedblog.com\/\">TheGratifiedBlog.com<\/a>, a Digital Marketing &amp; Web Development Company, helping businesses to grow.[\/vc_column_text][\/vc_column][\/vc_row]","protected":false},"excerpt":{"rendered":"[vc_row pix_particles_check=&#8221;&#8221;][vc_column][vc_column_text]When it comes to “Marketing” a product, service, or anything that has to reach potential customers one can adopt various ways to do so. Door to Door marketing is the traditional method that was first adopted in the history&#8230;","protected":false},"author":1,"featured_media":35149,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[32,34],"tags":[97,96],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v19.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>15 Different Types Of Marketing Campaigns (Ultimate Guide) - Digiperform<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/digiperform.com\/15-different-types-of-marketing-campaigns-ultimate-guide\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"15 Different Types Of Marketing Campaigns (Ultimate Guide) - Digiperform\" \/>\n<meta property=\"og:description\" content=\"[vc_row pix_particles_check=&#8221;&#8221;][vc_column][vc_column_text]When it comes to “Marketing” a product, service, or anything that has to reach potential customers one can adopt various ways to do so. Door to Door marketing is the traditional method that was first adopted in the history...\" \/>\n<meta property=\"og:url\" content=\"https:\/\/digiperform.com\/15-different-types-of-marketing-campaigns-ultimate-guide\/\" \/>\n<meta property=\"og:site_name\" content=\"Digiperform\" \/>\n<meta property=\"article:published_time\" content=\"2021-01-19T11:48:54+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-03-28T10:33:16+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/digiperform.com\/wp-content\/uploads\/2021\/01\/Marketing-Campaigns-blog.png\" \/>\n\t<meta property=\"og:image:width\" content=\"533\" \/>\n\t<meta property=\"og:image:height\" content=\"300\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"admin\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/digiperform.com\/#website\",\"url\":\"https:\/\/digiperform.com\/\",\"name\":\"Digiperform\",\"description\":\"Digital Marketing Training Institute\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/digiperform.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/digiperform.com\/15-different-types-of-marketing-campaigns-ultimate-guide\/#primaryimage\",\"url\":\"https:\/\/digiperform.com\/wp-content\/uploads\/2021\/01\/Marketing-Campaigns-blog.png\",\"contentUrl\":\"https:\/\/digiperform.com\/wp-content\/uploads\/2021\/01\/Marketing-Campaigns-blog.png\",\"width\":533,\"height\":300,\"caption\":\"Marketing Campaigns\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/digiperform.com\/15-different-types-of-marketing-campaigns-ultimate-guide\/#webpage\",\"url\":\"https:\/\/digiperform.com\/15-different-types-of-marketing-campaigns-ultimate-guide\/\",\"name\":\"15 Different Types Of Marketing Campaigns (Ultimate Guide) - Digiperform\",\"isPartOf\":{\"@id\":\"https:\/\/digiperform.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/digiperform.com\/15-different-types-of-marketing-campaigns-ultimate-guide\/#primaryimage\"},\"datePublished\":\"2021-01-19T11:48:54+00:00\",\"dateModified\":\"2022-03-28T10:33:16+00:00\",\"author\":{\"@id\":\"https:\/\/digiperform.com\/#\/schema\/person\/1420e87bcb82e48906cd5160911fcc1a\"},\"breadcrumb\":{\"@id\":\"https:\/\/digiperform.com\/15-different-types-of-marketing-campaigns-ultimate-guide\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/digiperform.com\/15-different-types-of-marketing-campaigns-ultimate-guide\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/digiperform.com\/15-different-types-of-marketing-campaigns-ultimate-guide\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/digiperform.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"15 Different Types Of Marketing Campaigns (Ultimate Guide)\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/digiperform.com\/#\/schema\/person\/1420e87bcb82e48906cd5160911fcc1a\",\"name\":\"admin\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/digiperform.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/b69047a5cc9f5694c48ca69f8b62a83b?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/b69047a5cc9f5694c48ca69f8b62a83b?s=96&d=mm&r=g\",\"caption\":\"admin\"},\"sameAs\":[\"https:\/\/digihero.in\/new\"],\"url\":\"https:\/\/digiperform.com\/author\/admin\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"15 Different Types Of Marketing Campaigns (Ultimate Guide) - Digiperform","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/digiperform.com\/15-different-types-of-marketing-campaigns-ultimate-guide\/","og_locale":"en_US","og_type":"article","og_title":"15 Different Types Of Marketing Campaigns (Ultimate Guide) - Digiperform","og_description":"[vc_row pix_particles_check=&#8221;&#8221;][vc_column][vc_column_text]When it comes to “Marketing” a product, service, or anything that has to reach potential customers one can adopt various ways to do so. Door to Door marketing is the traditional method that was first adopted in the history...","og_url":"https:\/\/digiperform.com\/15-different-types-of-marketing-campaigns-ultimate-guide\/","og_site_name":"Digiperform","article_published_time":"2021-01-19T11:48:54+00:00","article_modified_time":"2022-03-28T10:33:16+00:00","og_image":[{"width":533,"height":300,"url":"https:\/\/digiperform.com\/wp-content\/uploads\/2021\/01\/Marketing-Campaigns-blog.png","type":"image\/png"}],"twitter_card":"summary_large_image","twitter_misc":{"Written by":"admin","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/digiperform.com\/#website","url":"https:\/\/digiperform.com\/","name":"Digiperform","description":"Digital Marketing Training Institute","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/digiperform.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/digiperform.com\/15-different-types-of-marketing-campaigns-ultimate-guide\/#primaryimage","url":"https:\/\/digiperform.com\/wp-content\/uploads\/2021\/01\/Marketing-Campaigns-blog.png","contentUrl":"https:\/\/digiperform.com\/wp-content\/uploads\/2021\/01\/Marketing-Campaigns-blog.png","width":533,"height":300,"caption":"Marketing Campaigns"},{"@type":"WebPage","@id":"https:\/\/digiperform.com\/15-different-types-of-marketing-campaigns-ultimate-guide\/#webpage","url":"https:\/\/digiperform.com\/15-different-types-of-marketing-campaigns-ultimate-guide\/","name":"15 Different Types Of Marketing Campaigns (Ultimate Guide) - Digiperform","isPartOf":{"@id":"https:\/\/digiperform.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/digiperform.com\/15-different-types-of-marketing-campaigns-ultimate-guide\/#primaryimage"},"datePublished":"2021-01-19T11:48:54+00:00","dateModified":"2022-03-28T10:33:16+00:00","author":{"@id":"https:\/\/digiperform.com\/#\/schema\/person\/1420e87bcb82e48906cd5160911fcc1a"},"breadcrumb":{"@id":"https:\/\/digiperform.com\/15-different-types-of-marketing-campaigns-ultimate-guide\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/digiperform.com\/15-different-types-of-marketing-campaigns-ultimate-guide\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/digiperform.com\/15-different-types-of-marketing-campaigns-ultimate-guide\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/digiperform.com\/"},{"@type":"ListItem","position":2,"name":"15 Different Types Of Marketing Campaigns (Ultimate Guide)"}]},{"@type":"Person","@id":"https:\/\/digiperform.com\/#\/schema\/person\/1420e87bcb82e48906cd5160911fcc1a","name":"admin","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/digiperform.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/b69047a5cc9f5694c48ca69f8b62a83b?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/b69047a5cc9f5694c48ca69f8b62a83b?s=96&d=mm&r=g","caption":"admin"},"sameAs":["https:\/\/digihero.in\/new"],"url":"https:\/\/digiperform.com\/author\/admin\/"}]}},"_links":{"self":[{"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/posts\/34152"}],"collection":[{"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/comments?post=34152"}],"version-history":[{"count":3,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/posts\/34152\/revisions"}],"predecessor-version":[{"id":37655,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/posts\/34152\/revisions\/37655"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/media\/35149"}],"wp:attachment":[{"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/media?parent=34152"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/categories?post=34152"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/digiperform.com\/wp-json\/wp\/v2\/tags?post=34152"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}